<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Lizenz-Bedingungen in den Sourcefiles
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2008-March/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Lizenz-Bedingungen%20in%20den%20Sourcefiles&In-Reply-To=%3C1205226924.6034.95.camel%40urs-laptop%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000122.html">
   <LINK REL="Next"  HREF="000118.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Lizenz-Bedingungen in den Sourcefiles</H1>
    <B>Urs Lerch</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Lizenz-Bedingungen%20in%20den%20Sourcefiles&In-Reply-To=%3C1205226924.6034.95.camel%40urs-laptop%3E"
       TITLE="[deepamehta-users] Lizenz-Bedingungen in den Sourcefiles">mail at ulerch.net
       </A><BR>
    <I>Tue Mar 11 10:15:24 CET 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000122.html">[deepamehta-users] BUY FLKI (on the OTC symbol FLKI) Now	Participate in the next Billion Dollar Brand - see	www.cleanplus.com, www.falkenltd.com,	BUY it www.cleanplus.com/shop, DISTRIBUTE it www.cleanplus.com,	OWN it on the OTC Symbol FLKI
</A></li>
        <LI>Next message: <A HREF="000118.html">[deepamehta-users] DeepaMehta 2.0b8 Release Candidate 2	fertiggestellt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#117">[ date ]</a>
              <a href="thread.html#117">[ thread ]</a>
              <a href="subject.html#117">[ subject ]</a>
              <a href="author.html#117">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo zusammen

Nicht nur, aber auch als Vorbereitung f&#252;r die Annahme von DeepaMehta am
Google Summer of Code, sollte meiner Meinung nach zumindest alle
Java-Source-Files die Lizenzbedingung enthalten. Der Text k&#246;nnte mit
relativ wenig Aufwand mittels eines Scripts an den Anfang jedes Files
geschrieben werden.

Ich w&#252;rde als Text folgendes vorschlagen (Vorlage stammt von der FSF
<A HREF="http://www.gnu.org/licenses/old-licenses/gpl-2.0.html#SEC4">http://www.gnu.org/licenses/old-licenses/gpl-2.0.html#SEC4</A>):

/*
 *    This program is free software; you can redistribute it and/or
 *    modify it under the terms of the GNU General Public License as
 *    published by the Free Software Foundation; either version 2 of the
 *    License, or (at your option) any later version.
 *
 *    This program is distributed in the hope that it will be useful,
 *    but WITHOUT ANY WARRANTY; without even the implied warranty of
 *    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *    GNU General Public License for more details.
 *
 *    You should have received a copy of the GNU General Public License
 *    along with this program; if not, write to the Free Software
 *    Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
 */

Die FSF schl&#228;gt noch vor, eine Beschreibung des Programms sowie das
Copyright des Autors hinzuf&#252;gen. Ersteres finde ich nicht notwendig,
allenfalls w&#252;rde der Link auf die Homepage Sinn machen. Bei dem
Copyright ist mir nicht klar, ob das &#252;berhaupt erw&#252;nscht ist, da bisher
kein Vermerk in den Dateien vorhanden ist.

Zus&#228;tzlich liesse sich dar&#252;ber streiten, ob automatisch auch
Folgeversionen der GPL g&#252;ltig sein sollen. Ich habe da keine
Pr&#228;ferenzen.

Rechtlich gesehen w&#252;rde sich aus meiner Sicht nichts &#228;ndern, da die
Lizenz schon andernorts definiert ist. Es w&#252;rde jedoch zu mehr Klarheit
f&#252;hren und entspricht auch den Gegebenheiten in der Open-Source-
Community.

Zus&#228;tzlich sollte im Root-Verzeichnis eine Lizenzdatei mit dem
Originaltext der GPL v2 enthalten sein (siehe
<A HREF="http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt">http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt</A>).

Falls dies i.O. ist, w&#252;rde ich das gerne selber machen, br&#228;uchte daf&#252;r
aber noch Schreibzugriff aufs Repository. Ich k&#246;nnte es in einem Fenster
am Mittwoch, 12.3. abends zwischen 22 und 24 Uhr erledigen, so dass
m&#246;glichst wenig betroffen sind.

Gruss
Urs


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000122.html">[deepamehta-users] BUY FLKI (on the OTC symbol FLKI) Now	Participate in the next Billion Dollar Brand - see	www.cleanplus.com, www.falkenltd.com,	BUY it www.cleanplus.com/shop, DISTRIBUTE it www.cleanplus.com,	OWN it on the OTC Symbol FLKI
</A></li>
	<LI>Next message: <A HREF="000118.html">[deepamehta-users] DeepaMehta 2.0b8 Release Candidate 2	fertiggestellt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#117">[ date ]</a>
              <a href="thread.html#117">[ thread ]</a>
              <a href="subject.html#117">[ subject ]</a>
              <a href="author.html#117">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
