<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] F&#246;rderverein
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2008-August/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%3D%3Fiso-8859-1%3Fq%3FF%3DF6rderverein%3F%3D&In-Reply-To=%3C8571e4a8547b9b03646a358eb1a813a8%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000185.html">
   <LINK REL="Next"  HREF="000187.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] F&#246;rderverein</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%3D%3Fiso-8859-1%3Fq%3FF%3DF6rderverein%3F%3D&In-Reply-To=%3C8571e4a8547b9b03646a358eb1a813a8%40deepamehta.de%3E"
       TITLE="[deepamehta-users] F&#246;rderverein">jri at deepamehta.de
       </A><BR>
    <I>Tue Aug  5 18:14:34 CEST 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000185.html">[deepamehta-users] Retyping einer TopicMap und wo darf eine	TopicMap erzeugt werden
</A></li>
        <LI>Next message: <A HREF="000187.html">[deepamehta-users] F&#246;rderverein
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#186">[ date ]</a>
              <a href="thread.html#186">[ thread ]</a>
              <a href="subject.html#186">[ subject ]</a>
              <a href="author.html#186">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Lieber Urs,

vielen Dank f&#252;r Deine Infos zum Thema Vereinsgr&#252;ndung und f&#252;r die 
Stellungnahme, die Du vom Rechtsanwalt eingeholt hast!

Punkt 2 (Weiterentwicklung garantieren) scheint mir ein Kernpunkt f&#252;r 
die Organisationsgr&#252;ndung zu sein. Punkte 1 und 3 (demokratische 
Meinungsbildung und Au&#223;enkommunikation) scheinen mir in diesem 
Zusammenhang nebens&#228;chlich zu sein resp. erfordern nicht unbedingt eine 
Organisation.

Das Thema &quot;Gemeinn&#252;tzigkeit&quot; halte ich f&#252;r zentral wichtig, da wir -- 
wie der Rechtsanwalt schreibt -- auf diese Weise mehr M&#246;glichkeiten 
haben, an &#246;ffentliche Gelder heranzukommen. Auch hab' ich geh&#246;rt, da&#223; 
gemeinn&#252;tzige Organisationen bestimmte Auftr&#228;ge nur an wiederum 
gemeinn&#252;tzige Organisationen vergeben d&#252;rfen.

Ich gehe davon aus, da&#223; es uns h&#246;chstwahrscheinlich gelingen wird, ein 
&#252;bergeordnetes Ziel zu formulieren, f&#252;r welches uns Gemeinn&#252;tzigkeit 
attestiert werden kann. Das hab' ich angedeutet, als ich schrieb:
&gt;<i> (A future perspective for the foundation could be to encourage a
</I>&gt;<i> interdisciplinary dialogue about the human-machine relationship
</I>&gt;<i> i.e.organising symposiums.)
</I>Unser Thema kann ein aufkl&#228;rerisches sein: n&#228;mlich, an einem besseren 
Verst&#228;ndnis des Mensch-Maschine Verh&#228;ltnisses arbeiten, mit dem Ziel, 
die Bedingungen f&#252;r pers&#246;nlichen und gesellschaftlichen Nutzen von 
Technik-Einsatz besser verstehen zu k&#246;nnen. Das geht nur durch die 
F&#246;rderung eines interdisziplin&#228;ren Dialogs. Die Informatik ist im 
Vergleich anderer Wissenschaftsdisziplinen extrem jung, und hat noch 
kein eigenes Begriffsinstrumentarium zur Betrachtung der ganzen 
Mensch-Maschine-R&#252;ckkoplungsschleife parat. Informatiker beschr&#228;nken 
sich oft auf die technische Seite, verwenden dann aber zur Beschreibung 
ihrer Artefakte oft leichtfertig Begriffe, die aus dem Reich des 
belebten Lebens stammen. Dazu geh&#246;ren etwa &quot;Information&quot;, &quot;Wissen&quot;, 
&quot;Lernen&quot;, &quot;Verstehen&quot;, &quot;Bedeutung&quot;, &quot;Handeln&quot;, &quot;Autonomie&quot;, 
&quot;Intelligenz&quot;. Dies verf&#252;hrt die Computer-Forscher immerwieder dazu, 
F&#228;higkeiten in die Maschine reinzudeuten, die prinzipiell nicht 
vorhanden sind. Daf&#252;r aber werden buchst&#228;blich Milliarden 
Forschungsmittel aufgewendet (siehe THESEUS-Programm) und auch die 
Anwender lassen sich nur allzu gern verzaubern von dem Versprechen 
eines &quot;intelligenten Agenten&quot;, der ihnen die Arbeit abnimmt. Auf der 
anderen Seite f&#252;hrt diese Verblendung und Verk&#252;rzung dazu, da&#223; das, WAS 
der Computer kann, nicht gen&#252;gend in die Denk- und Handlungswelt der 
Menschen hineinentwickelt wird, ein wesentlicher Teil des Potential des 
Computers also garnicht ausgesch&#246;pft wird. Welche Wege die Forscher und 
Entwickler beim Systemdesign einschlagen, h&#228;ngt ma&#223;geblich von den 
Leitbildern ab, die sie verinnerlicht haben, derer aber sie sich nicht 
immer bewu&#223;t sind. Die Reflektion &#252;ber die Leitbilder der 
Technikentwicklung erfordert ein philosophisches Fundament, das nur 
interdisziplin&#228;r geschaffen werden kann. Den interdisziplin&#228;ren Dialog 
zwischen Natur- und Geisteswissenschaftlern zu f&#246;rdern und das 
philosophische Fundament zum Verst&#228;ndnis des 
Mensch-Maschine-Gesellschafts-Systems zu legen, das kann das 
&#252;bergeordnete Ziel unserer Organisation sein. Die T&#228;tigkeiten der 
Organisation w&#252;rden dann z.B. umfassen:
A) Veranstaltung von Symposien und Herausgabe von Materialien.
B) Herstellung technischer Systeme und Design von Methoden.
Ich denke, da&#223; wir mit einer derartigen &quot;Mission&quot; Gemeinn&#252;tzigkeit gut 
begr&#252;nden k&#246;nnen.

Jetzt m&#246;chte ich noch drei Punkte erw&#228;hnen, die in einer Diskussion, 
die ich hatte, aufgetaucht sind:
1) M&#246;glicherweise ist anstatt eines Vereins doch eine Stiftung, oder 
noch etwas anderes, die passendere Form. Dieser Punkt ist aus meiner 
Sicht noch offen, und geh&#246;rt zu den dringensden Fragen.
2) Die Firma und die Organisation sollen ganz klar voneinander getrennt 
sein. M&#246;glicherweise sollte ein Firmengesellschafter garnicht 
Vereinsmitglied werden k&#246;nnen. Evt. ist dann auch die Bezahlung von 
Vereinsleistungen auch unproblematischer.
3) Die Organisation soll sich auf &quot;hochkar&#228;tige&quot; Mitglieder und 
Vorst&#228;nde konzentrieren. Dann macht sie sich attraktiv f&#252;r weitere 
Hochkar&#228;ter und erlangt gr&#246;&#223;ere Wirkung. Die Ansprache potentieller 
hochkar&#228;tiger Mitglieder soll sehr gut vorbereitet werden.

Wir k&#246;nnen gerne im Wiki Resourcen zum Thema Organisationsgr&#252;ndung 
erstellen. Das Wiki ist trotz Serverausfalls noch erreichbar. Eine 
Registrierung ist nicht notwendig aber empfohlen.
<A HREF="http://deepamehta.newthinking.net/wiki/">http://deepamehta.newthinking.net/wiki/</A>

Um Impulse Dritter zu erm&#246;glichen, schicke ich diese Antwort an die 
users-Liste und lege auch das Statement vom Rechtsanwalt nochmal bei.

Gr&#252;&#223;e
J&#246;rg


On 01.08.2008, at 22:57, Urs Lerch wrote:

&gt;<i> Hallo J&#246;rg, Hallo Malte,
</I>&gt;<i>
</I>&gt;<i> heute habe ich vom Rechtanswalt weitere Informationen erhalten (siehe
</I>&gt;<i> Brief in der Beilage). Ich poste das mal nur an euch, da sich die 
</I>&gt;<i> Listen
</I>&gt;<i> bisher nicht sonderlich um eine Vereingsgr&#252;ndung zu k&#252;mmern scheinen.
</I>&gt;<i>
</I>&gt;<i> Das mit der Gemeinn&#252;tzigkeit k&#246;nnte wohl noch ein Problem darstellen.
</I>&gt;<i> Ich habe allerdings in der Satzung vom LinuxTag e.V.
</I>&gt;<i> ( <A HREF="http://www.linuxtag.org/2008/de/linuxtag/satzung.html">http://www.linuxtag.org/2008/de/linuxtag/satzung.html</A> ) gesehen, dass
</I>&gt;<i> die Zahlung an Mitglieder durchaus m&#246;glich sein kann. Wir m&#252;ssten 
</I>&gt;<i> unsere
</I>&gt;<i> Zielsetzung aber wahrscheinlich etwas offener definieren. Der Tipp mit
</I>&gt;<i> der Wissenschaft &amp; Forschung scheint mir gut ( siehe dazu auch
</I>&gt;<i> <A HREF="http://de.wikipedia.org/wiki/Gemeinn%C3%BCtzig">http://de.wikipedia.org/wiki/Gemeinn%C3%BCtzig</A> ).
</I>&gt;<i>
</I>&gt;<i> &#65279;Den Wikiartikel zum Vereinsrecht
</I>&gt;<i> ( <A HREF="http://de.wikipedia.org/wiki/Vereinsrecht">http://de.wikipedia.org/wiki/Vereinsrecht</A> ) finde ich im &#252;brigen auch
</I>&gt;<i> noch recht informativ.
</I>&gt;<i>
</I>&gt;<i> Da die Gemeinn&#252;tzigkeit offensichtlich vom Finanzamt erteilt wird, w&#228;re
</I>&gt;<i> eine Connection dahin sicherlich hilfreich. Kennt ihr jemanden (der
</I>&gt;<i> jemanden kennt usw.) der dort arbeitet?
</I>&gt;<i>
</I>&gt;<i> Also, erste Bedingung w&#228;re auf jeden Fall mal sieben 
</I>&gt;<i> Gr&#252;ndungsmitglieder
</I>&gt;<i> zu finden. Malte hatte da mal noch einige Namen fallen gelassen. Dann
</I>&gt;<i> m&#252;ssten wir die Satzung schreiben. Habt ihr eine Vorstellung, wie das
</I>&gt;<i> vor sich gehen soll? &#220;ber ein Wiki vielleicht (wenn denn die Homepage
</I>&gt;<i> mal wieder online ist)? Ich k&#246;nnte mal eine erste Fassung als
</I>&gt;<i> Diskussionsgrundlage liefern.
</I>&gt;<i>
</I>&gt;<i> Eine professionelle Unterst&#252;tzung w&#228;re sicherlich hilfreich. Da der
</I>&gt;<i> Verein ja sinnvollerweise in Berlin seinen Sitz haben sollte und 
</I>&gt;<i> deshalb
</I>&gt;<i> meines Ermessens auch vom dortigen Finanzamt beurteilt wird, sollten 
</I>&gt;<i> wir
</I>&gt;<i> uns vielleicht auch eher einen Berliner Spezialisten suchen. Als Name
</I>&gt;<i> f&#228;llt mir jetzt spontan Till J&#228;ger ein, der ein Buch &#252;ber juristische
</I>&gt;<i> Aspekte von Open Source Software geschrieben hat und mit der Free
</I>&gt;<i> Software Foundation Europe vernetzt ist
</I>&gt;<i> ( <A HREF="http://www.fsfeurope.org/projects/ftf/network.de.html">http://www.fsfeurope.org/projects/ftf/network.de.html</A> ).
</I>&gt;<i>
</I>&gt;<i> So viel mal f&#252;rs erste am Schweizer Nationalfeiertag. Freue mich auf
</I>&gt;<i> eure Antwort.
</I>&gt;<i>
</I>&gt;<i> Gruss,
</I>&gt;<i> Urs
</I>-------------- next part --------------
A non-text attachment was scrubbed...
Name: 2008-08-01_DeepaMehta_Schreiben_an_Herrn_Lerch.pdf
Type: application/pdf
Size: 95297 bytes
Desc: not available
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/deepamehta-users/attachments/20080805/ae1a3f20/attachment.pdf">https://lists.berlios.de/pipermail/deepamehta-users/attachments/20080805/ae1a3f20/attachment.pdf</A>&gt;
-------------- next part --------------

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000185.html">[deepamehta-users] Retyping einer TopicMap und wo darf eine	TopicMap erzeugt werden
</A></li>
	<LI>Next message: <A HREF="000187.html">[deepamehta-users] F&#246;rderverein
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#186">[ date ]</a>
              <a href="thread.html#186">[ thread ]</a>
              <a href="subject.html#186">[ subject ]</a>
              <a href="author.html#186">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
