<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Ein Topic auf einer Map unsichtbar machen aber seine Position erhalten ?
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Ein%20Topic%20auf%20einer%20Map%20unsichtbar%20machen%0A%20aber%20seine%20Position%20erhalten%20%3F&In-Reply-To=%3C1246788818.9289.87.camel%40spin%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000275.html">
   <LINK REL="Next"  HREF="000277.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Ein Topic auf einer Map unsichtbar machen aber seine Position erhalten ?</H1>
    <B>Malte Rei&#223;ig</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Ein%20Topic%20auf%20einer%20Map%20unsichtbar%20machen%0A%20aber%20seine%20Position%20erhalten%20%3F&In-Reply-To=%3C1246788818.9289.87.camel%40spin%3E"
       TITLE="[deepamehta-users] Ein Topic auf einer Map unsichtbar machen aber seine Position erhalten ?">mre at deepamehta.de
       </A><BR>
    <I>Sun Jul  5 12:13:38 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000275.html">[deepamehta-users] Ein Topic auf einer Map unsichtbar machen aber seine Position erhalten ?
</A></li>
        <LI>Next message: <A HREF="000277.html">[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#276">[ date ]</a>
              <a href="thread.html#276">[ thread ]</a>
              <a href="subject.html#276">[ subject ]</a>
              <a href="author.html#276">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Lieber Torsten, 

danke f&#252;r deine interessante Mail und es ist ja toll zu h&#246;ren das du
etwas Luft zum experimentieren finden konntest ! Weiterhin viel Spa&#223;.

Mal ganz abgesehen von meiner Meinung zu deiner Frage, viell. entstehen
da ja jetzt noch weitere Antworten.

Am Freitag, den 03.07.2009, 10:46 +0200 schrieb Torsten Ziegler:
&gt;<i> Hallo J&#246;rg und liebes DeepaMehta Team,
</I>&gt;<i> 
</I>&gt;<i> ich habe mir gerade mal wieder etwas Luft zum
</I>&gt;<i> Experimentieren geschafft und habe gleich zwei Fragen:
</I>&gt;<i> 
</I>&gt;<i> erst mal die zur Benutzung:
</I>&gt;<i> 
</I>&gt;<i> Ausgangssituation: Ein Topic ist in zwei Topic Maps aufgedeckt.
</I>&gt;<i> 
</I>&gt;<i> L&#246;sche ich es nun von der einen Topic Map, so ist es noch auf der
</I>&gt;<i> zweiten vorhanden, aber nat&#252;rlich nicht mehr ansprechbar. Ich mu&#223;
</I>&gt;<i> erst die zweite Topic Map schlie&#223;en und wieder auf machen damit es
</I>&gt;<i> verschwindet.
</I>&gt;<i> 
</I>&gt;<i> Soll das so sein ?
</I>
Nein, das ist noch nicht ideal gel&#246;st. Ich denke das dies w&#228;re aber
jetzt schon mit moderatem aufwand umzusetzen und siedelt sich genau wie
weiteres von dir unten beschrieben nicht auf Application Ebene sondern
auf Framework Ebene an. Sofern ein User also die Berechtigung bestizt
ein Topic zu l&#246;schen wird dieses Topic damit auch bei allen anderen
Usern aus Ihrer Map gel&#246;scht, ohne Einwirkung des Users in seine Map.
Das w&#252;rde das Prinzip verletzen, das sich nichts an der Sicht (an der
Map) des Users ohne sein zu tun ver&#228;ndert.

Eine sch&#246;ne Herausforderung, wie ich finde und in diesem Zusammenhang
f&#228;nde ich es toll, eine L&#246;sung f&#252;r mehrere Benutzer die an DeepaMehta
gleichzeitig arbeiten &quot;zimmern&quot; zu k&#246;nnen und dabei zusammen &#252;ber das
Konzept der &quot;Warnung/Benachrichtigung&quot; in DeepaMehta nochmal
nachzudenken. Dieses gilt es vielleicht so interaktiv zu gestalten
(m&#246;gl. ohne krasses PopUp), dass die User die das zu l&#246;schende Topic
bereits kennen und in Ihrer Map haben, sich entscheiden k&#246;nnen dies zu
behalten oder zu entfernen. Aus meiner Sicht eine Herausforderung,
L&#246;sung f&#252;r ein beschriebens Problem von dir und allg. Verbesserung mit
Zukunft z.B. hinsichtlich der Behandlung von &quot;Versionierung&quot; im User
Interface also dem akzeptieren oder ablehnen von Ver&#228;nderungen an
Inhalten die ein anderer User gerade durchgef&#252;hrt hat.

&gt;<i> und dann mehr zum Prinzip (das ich gerne ver&#228;ndern w&#252;rde):
</I>&gt;<i> 
</I>&gt;<i> Ein Topic kann versteckt (hide) oder gel&#246;scht (delete) werden.
</I>
Dies einfache und klare Trennung finde ich pers&#246;nlich ganz gut, warum
siehe weiter unten.

&gt;<i> 
</I>&gt;<i> Bisher ist es so:
</I>&gt;<i> 
</I>&gt;<i> Beim verstecken wird das ViewTopic gel&#246;scht und somit geht
</I>&gt;<i> die Position auf der Topic Map verloren.
</I>&gt;<i> Beim l&#246;schen wird das Topic von allen Topic Maps gel&#246;scht, ohne
</I>&gt;<i> dass ich gewarnt werde, da&#223; es in anderem Zusammenhang vielleicht
</I>&gt;<i> noch (sinnvoll) in Verwendung ist.
</I>&gt;<i> 
</I>&gt;<i> Was ich sch&#246;ner f&#228;nde (und implementieren m&#246;chte):
</I>&gt;<i> 
</I>&gt;<i> Beim verstecken (hide) wird das Topic wirklich nur unsichtbar gemacht
</I>&gt;<i> (z.B. ein anderer View Mode im Presentable Topic) aber das View Topic
</I>&gt;<i> bleibt erhalten und somit kann auch das Topic an seiner alten Position
</I>&gt;<i> (nat&#252;rlich in Abh&#228;ngigkeit der Topic Map) wieder hergestellt werden
</I>
Das w&#252;rde also hei&#223;en viewtopics (PresentationTopics) k&#246;nnen in einer
Map entweder &quot;visible&quot; oder &quot;invisible&quot; sein und momentan sind die
Topics entweder in der Map oder nicht. F&#252;r den Benutzer macht dies zum
jetzigen Ausblenden nur einen einzigen Unterschied, das Topic wird beim
erneuten aufdecken nicht an der Position aufgedeckt zu der der User
gerade am n&#228;chsten ist, sondern an vorheriger Position.

&gt;<i> Das l&#246;schen w&#252;rde ich gerne zweiteilen:
</I>&gt;<i> L&#246;schen von der Topic Map = l&#246;schen des View Topic = bisher: hide
</I>&gt;<i> L&#246;schen aus dem Corporate Memory = l&#246;schen des Topics und aller 
</I>&gt;<i> ViewTopics = bisher: delete
</I>
Aus 2 Kommandos mit klarer Trennung/Benennung mach 3

&gt;<i> Meine Frage dazu ist:
</I>&gt;<i> Wie verh&#228;lt sich diese Idee zum Konzept von Deepamehta ?
</I>&gt;<i> Passt das zur Philosophie oder widerspricht es ?
</I>
It's not minimal ;)

Aus meiner Sicht macht es einfache Dinge schwerer und das ist noch etwas
extra, was man neuen Benutzern erst vermitteln muss, da es eine feine
Trennung in den &#220;berlegungen des Users einf&#252;hrt und dass zum &quot;L&#246;schen&quot;
von Inhalten in DeepaMehta. Ich sehe das so: Eher w&#252;rde ich den
Sonderfall des &quot;L&#246;schens&quot; aus dem Men&#252; entfernen und f&#252;r den
Anfang/Normalfall nur das &quot;Ausblenden&quot; zur Verf&#252;gung stellen, als dem
L&#246;schen eine zweite Ebene hinzuzuf&#252;gen.

Die Elemente im Interface haben nur begrenzt Raum zur Verf&#252;gung und der
will sinnvoll aufgeteilt sein. So w&#252;rden jetzt zus&#228;tzlich Eintr&#228;ge im
Men&#252; auftauchen, deren Unterschied wirklich sehr fein (im Sinne von
gering) ist.

Zur Philosophie, dann lieber mehr m&#252;ndlich :)

&gt;<i> Und zur Implementierung: wo ist es sinnvoll anzufassen ?
</I>
Beim n&#228;chsten Dev-Treffen w&#228;re eine gute Gelegenheit, da beides etwas
tiefer ansetzen w&#252;rde und es gut w&#228;re, wenn alle mit diskutieren k&#246;nnen.
Daf&#252;r ben&#246;tigen wir zur Zeit auch nur noch einen Terminvorschlag,
einiges Interesse ist bereits angek&#252;ndigt.

&gt;<i> Kann ich das  auf der Application Ebene  erledigen  (ich glaube eher nicht)
</I>&gt;<i> oder mu&#223; ich in die Presentable Topic / Corporate Directives Ebene 
</I>&gt;<i> eingreifen ?
</I>&gt;<i> 
</I>&gt;<i> Danke und Gru&#223;
</I>&gt;<i> Torsten
</I>
Ich w&#252;rde mich freuen wenn wir diesbez&#252;glich viell. auch beim User
Treffen nochmal die Gelegenheit bekommen dar&#252;ber zu diskutieren oder
wenn jetzt hier der eine oder andere sich angesprochen f&#252;hlt,
mitzudenken.

Lieben Gru&#223; &amp; Sch&#246;nen Sonntag,

Malte

&gt;<i> 
</I>&gt;<i> _______________________________________________
</I>&gt;<i> deepamehta-users mailing list
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">deepamehta-users at lists.berlios.de</A>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">https://lists.berlios.de/mailman/listinfo/deepamehta-users</A>
</I>-- 
_BRING TO ME
* skype: einseinsnull
* jabber: <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">mre at newthinking.de</A>
* mail: <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">mre at deepamehta.de</A>
* fax: 01803-663388-72229

_GO TO
* www.deepamehta.de/wiki - co-create our freshest moves
* www.deepamehta.de/messageboard/controller - drop us a message
* www.deepamehta.de/wiki/en/User:Malte - my deepamehta page
* www.deepamehta.de/install/client/ - login and map with us online


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000275.html">[deepamehta-users] Ein Topic auf einer Map unsichtbar machen aber seine Position erhalten ?
</A></li>
	<LI>Next message: <A HREF="000277.html">[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#276">[ date ]</a>
              <a href="thread.html#276">[ thread ]</a>
              <a href="subject.html#276">[ subject ]</a>
              <a href="author.html#276">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
