<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%3D%3Fiso-8859-1%3Fq%3FText-Kasten_f%3DFCr_DeepaMehta-Ar%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Ftikel_%3D281%3D2E_Version%3D29%3F%3D&In-Reply-To=%3C3e2028e8452d1dfe2678678d1cacfcd4%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000276.html">
   <LINK REL="Next"  HREF="000278.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%3D%3Fiso-8859-1%3Fq%3FText-Kasten_f%3DFCr_DeepaMehta-Ar%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Ftikel_%3D281%3D2E_Version%3D29%3F%3D&In-Reply-To=%3C3e2028e8452d1dfe2678678d1cacfcd4%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)">jri at deepamehta.de
       </A><BR>
    <I>Sun Jul  5 23:57:18 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000276.html">[deepamehta-users] Ein Topic auf einer Map unsichtbar machen aber seine Position erhalten ?
</A></li>
        <LI>Next message: <A HREF="000278.html">[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#277">[ date ]</a>
              <a href="thread.html#277">[ thread ]</a>
              <a href="subject.html#277">[ subject ]</a>
              <a href="author.html#277">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Lieber Jens-Christoph,

hier lasse ich Dir die erste Version meines Texts f&#252;r den Kasten 
zukommen.

Der Text hei&#223;t &quot;Vision einer integrierten Arbeitsumgebung f&#252;r 
Wissensarbeiter&quot; und ist 4600 Zeichen lang, also etwas zu lang.
Er beschreibt die Vision, die Motivation, das Ziel und die Strategie 
des DeepaMehta-Projekts. Also eher high-level, was meiner Meinung nach 
OK, ist, da es ja um die Vision geht, und Du den anschaulichen Teil 
bereits gut im Hauptteil abdeckst.

Was aus Platzgr&#252;nden weggefallen ist, ist das konkrete Erlebnis, das 
der Anwender mit DeepaMehta hat. Zu diesem Thema schicke ich einen 
extra-Absatz (2200 Zeichen). Das ist absoluter Rohtext der Dich 
m&#246;glicherweise auf Ideen zu unserem weiteren Vorgehen bringt.

Was ich sehr gerne noch beif&#252;gen m&#246;chte, ist ein Bild, das das 
Arbeitskontext-zentrierte Paradigma dem Anwendungs-zentrierten 
Paradigma gegen&#252;berstellt (der Kernaspekt meines Texts).

=&gt; Ist Platz f&#252;r ein Bild vorhanden?

Mit dem Text bin ich noch nicht zufrieden. Nun wollte ich erstmal Dein 
Feedback einholen. Heute kann ich den Text noch &#228;ndern. (Morgen bin ich 
den ganzen Tag unterwegs und k&#246;nnte Dir erst wieder Dienstag fr&#252;h eine 
neue Version zukommen lassen.)

Gr&#252;&#223;e
J&#246;rg

www.deepamehta.de


 &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Kastentext (4600 Zeichen) &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;

Vision einer integrierten Arbeitsumgebung f&#252;r Wissensarbeiter

Ein Wissensarbeiter verdient seinen Lebensunterhalt mit der 
Interpretation und der Transformierung von Information (nach Peter 
Drucker). Er liest viel Text, den er sich selber beschafft oder von 
anderen hereingereicht bekommt. Daraus erstellt er neuen Text, oft auch 
im Teamwork. Es entstehen mehrere Versionen. Es kreiert, kopiert, 
stellt vorhandenes neu zusammen, und das Ergebnis landet bei einem 
anderen Wissensarbeiter auf dem Tisch. Ist das Projekt abgeschlossen 
werden die Artefakte archiviert, und der Kopf ist frei f&#252;r Neues. Oft 
arbeitet ein Wissensarbeiter in verschiedenen Arbeitskontexten zur 
gleichen Zeit, z.B. an der Stellung eines Forschungsantrags, dem 
Schreiben eines Artikels und der Organisation des n&#228;chsten Symposiums. 
Zu jedem Kontext geh&#246;ren z.B. Emails, Notizen, Kontakte, Webseiten und 
Termine. Der Alltag eines Wissensarbeiters ist 
Arbeitskontext-zentriert.

Das Erlebnis, das ein Nutzer heutiger Computersysteme hingegen hat, ist 
Anwendungs-zentriert. Gegenw&#228;rtig sind die meisten Anwendungen um 
Netzwerkprotokolle und Dateiformate herumgebaut: f&#252;r Email ein 
POP/IMAP/SMTP-Client, f&#252;rs Web ein HTTP-Client, zum Schreiben ein 
.doc/.odf-Editor usw. Viele Anwendungen beanspruchen einen exklusiven 
Bildschirmbereich, benutzen ein individuelles 
Abglage/Kategoriesungssystem (z.B. Email-Folder vs. Filebrowser-Folder) 
und bieten kaum M&#246;glichkeiten ihre Inhalte, mit denen anderer 
Anwendungen zu verkn&#252;pfen. Der Wissensarbeiter mu&#223; viel zwischen 
Anwendungen umschalten. Oft wird dabei der Bildschirm mit Informationen 
und Bedienelementen belegt, die mit dem aktuellen Arbeitskontext 
garnichts zu tun haben. Diese Art Maschine verlangt dem Nutzer 
kognitive Resourcen ab, die nicht in die eigentliche Arbeit flie&#223;en.

Ziel des DeepaMehta-Projekts ist, das Anwendungs-zentrierte Paradigma 
durch ein Arbeitskontext-zentriertes Paradigma abzul&#246;sen. Die 
Motivation dabei ist, die Benutzeroberfl&#228;che weiter weg von der 
Maschine, hin zur Arbeits- und Denkwelt des Nutzers zu verlegen. 
Fragestellungen sind:

1) Verglichen mit einer B&#252;roumgebung oder einem Schreibtisch ist die 
Fl&#228;che eines Computerbildschirms ziemlich klein. Wie kann diese knappe 
Resource bestm&#246;glichst genutzt werden? Einerseits sollen die Inhalte 
des Nutzers im Mittelpunkt stehen; der Bildschirm soll nur Inhalte 
anzeigen, die f&#252;r den aktuellen Arbeitskontext relevant sind. 
Andererseits beanspruchen auch die Bedienelemente der Maschine Platz.

2) Wie kann die &quot;Virtualit&#228;t&quot; des Computer (nach Ted Nelson) 
bestm&#246;glich verbunden werden, mit den Erfahrungen, die der Nutzer in 
der realen Welt macht? Einerseits soll der Nutzer die F&#228;higkeiten, die 
ihm in der realen Welt helfen, z.B. seine visuelle Intelligenz oder 
sein Orientierungssinn, auch bei der Arbeit am Computer nutzen k&#246;nnen. 
Andererseits sollen die virtuellen Eigenschaften des Computers 
ausgesch&#246;pft werden.

Die Einf&#252;hrung eines Arbeitskontext-zentrierten Paradigmas erfordert 
ein neues Modell f&#252;r Desktop-Awendungen. Damit z.B. die Daten 
verschiedener Anwendungen innerhalb eines Fensters angezeigt werden 
k&#246;nnen, m&#252;ssen die Anwendungen ihre Funktionen und Daten von der 
Visualisierung entkoppeln (ganz &#228;hnlich wie bei SOA-Anwendungen im 
Unternehmens- oder Webumfeld). Das hei&#223;t nicht, da&#223; alle vorhandenen 
Anwendungen neuprogrammiert werden m&#252;ssen. Denn, wenn die Aspekte, die 
alle Anwendungen, die ein Wissensarbeiter haupts&#228;chlich nutzt, 
gemeinsam haben, in eine Plattform verlagert werden, bleibt von den 
Anwendungen garnicht viel &#252;brig. Und diese Funktionalit&#228;ten stehen oft 
bereits als fertige Module (z.B. die JavaMail API f&#252;r Mail-Protokolle, 
die Open Source HTML-Engines &quot;Webkit&quot; und &quot;Gecko&quot; oder TinyMCE als 
webbasierter WYSIWYG Editor) zur Verf&#252;gung.

Zu den gemeinsamen Aspekten aller Anwendungen eines Wissensarbeiters 
geh&#246;ren: Informationen kommen irgendwo her, Informationen gehen 
irgendwo hin. Informationen kommen in 4 Geschmaksrichtungen daher: 
Text, Bild, Audio, Video. Informationen werden erzeugt, hergeholt, 
neuzusammengestellt. Informationen werden von mehreren Personen 
bearbeitet. Informationen sind mehr oder weniger strukturiert. In 
Informationen wird navigiert. Informationen werden versioniert, 
kategorisiert und archiviert. Diese Grundfunktionen sind (mehr oder 
weniger) bereits in der DeepaMehta-Plattform integriert und stehen den 
Nutzern und allen darauf aufbauenden Anwendungen konsistent zur 
Verf&#252;gung.

Die Vision von DeepaMehta ist ein Computer, der bereits nach dem 
Einschalten eine ad&#228;quate Arbeitsumgebung f&#252;r den Alltag eines 
Wissensarbeiters darstellt.

&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; Ende des Kastentexts &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;



 &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Rohtext zum Benutzererlebnis (2200 Zeichen) &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;

Der DeepaMehta-Bildschirm besteht aus einem einzigen Fenster. Es ist 
nie von anderen Fenstern &#252;berlagert. Der Arbeitskontext ist stets als 
Ganzes auf dem Bildschirm dargestellt (linke Seite), in Form einer 
Topic Map aus Topics und Assoziationen. Ein Topic ist z.B. eine Email, 
Webseite, Kontakt, Chatprotokoll, oder ein Projekt. Assoziationen 
repr&#228;sentieren den Bedeutungszusammenhang. Gleichzeitig werden 
Detailinformationen angezeigt (rechte Seite), z.B. Webseite oder der 
Text einer Email. Inhalte werden direkt an Ort und Stelle editiert und 
verarbeitet, z.B. wird eine Email direkt aus dem DeepaMehta-Fenster 
abgeschickt. Topics und Assoziationen werden manuell oder 
programmatisch erzeugt. Topics k&#246;nnen von &#252;berall herkommen, z.B. von 
Mailservern, Datenbanken, LDAP-Verzeichnissen oder Webservices. 
DeepaMehta setzt Topics miteinander in Bezug, &#252;ber Anwendungs- und 
Systemgrenzen hinweg. DeepaMehta bringt eine Reihe von Standard 
Topic-Typen und deren Funktionalit&#228;t bereits mit, z.B. &quot;Person&quot;, 
&quot;Email&quot;, &quot;Kalender&quot;. Weitere Topic-Typen, z.B. &quot;Protein&quot; und 
&quot;Gerichtsproze&#223;&quot;, werden von den Nutzern selbst definiert, ganz nach 
dem aus welchen Bereich man kommt. Die Topic Map wird vom Nutzer 
selbst&#228;ndig angeordnet. Die enstehenden r&#228;umlichen Strukturen tragen 
zur Orientierung und Erinnerung bei, ganz nach dem Prinzip von Mind 
Maps (nach Tony Buzan). W&#228;hrend des Arbeitens bleibt der Arbeitskontext 
auf dem Bildschirm sichtbar und wird inkrementell erweitert. Z.B. 
ensteht w&#228;hrend des Surfens im Web (rechte Seite) ein Netzwerk der 
besuchten Seiten. Der Nutzer mu&#223; nie etwas speichern, es bleibt einfach 
alles da. Wenn der Bildschirm zu un&#252;bersichtlich wird, blendet der 
Nutzer Dinge aus, die er im Moment nicht braucht. Sp&#228;ter kann er sie 
wieder vorholen, auch in anderen Arbeitskontexte. Zum Organisieren 
vieler Topic Maps richtet sich der Nutzer Workspaces ein. Mittels 
Shared Workspaces arbeiten Nutzer gemeinsam an Inhalten. 
DeepaMehta-Anwendungen, z.B. f&#252;r Kalender, Email, Webbrowser, sind f&#252;r 
den Nutzer nicht als solche wahrnehmbar. Stattdessen ist eine 
DeepaMehta-Anwendung einfach eine Reihe weiterer Topic-Typen, die ihre 
Kommandos und Detail-Visualisierungen selbst mitbringen.

&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; Ende &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000276.html">[deepamehta-users] Ein Topic auf einer Map unsichtbar machen aber seine Position erhalten ?
</A></li>
	<LI>Next message: <A HREF="000278.html">[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#277">[ date ]</a>
              <a href="thread.html#277">[ thread ]</a>
              <a href="subject.html#277">[ subject ]</a>
              <a href="author.html#277">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
