<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%0A%20%3D%3Fiso-8859-1%3Fq%3FText-Kasten_f%3DFCr_DeepaMehta-Ar%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Ftikel_%3D281%3D2E_Version%3D29%3F%3D&In-Reply-To=%3Ce858691b97caeb95b8bad8f483548749%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000277.html">
   <LINK REL="Next"  HREF="000279.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%0A%20%3D%3Fiso-8859-1%3Fq%3FText-Kasten_f%3DFCr_DeepaMehta-Ar%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Ftikel_%3D281%3D2E_Version%3D29%3F%3D&In-Reply-To=%3Ce858691b97caeb95b8bad8f483548749%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)">jri at deepamehta.de
       </A><BR>
    <I>Tue Jul  7 07:57:15 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000277.html">[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)
</A></li>
        <LI>Next message: <A HREF="000279.html">[deepamehta-users] Heute wieder Musik im Eschschloraque
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#278">[ date ]</a>
              <a href="thread.html#278">[ thread ]</a>
              <a href="subject.html#278">[ subject ]</a>
              <a href="author.html#278">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Lieber Jens-Christoph,

vielen Dank f&#252;r Dein Feedback!


On 05.07.2009, at 22:03, Jens-Christoph Brendel wrote:

&gt;<i> Hallo J&#246;rg,
</I>&gt;<i>
</I>&gt;<i> prima, dass es schon was zu lesen gibt. Ich mache es dann meistens so,
</I>&gt;<i> dass ich den Entwurf einmal lese und dabei gleich in die Mail tippe, 
</I>&gt;<i> was
</I>&gt;<i> mir auff&#228;llt. Da ist dann villeicht nicht alles zehnmal bedacht und
</I>&gt;<i> m&#246;glicherweise rede ich an DIngen vorbei, die sich weiter hinten kl&#228;ren
</I>&gt;<i> k&#246;nnen - aber es ist der Eindruck, den der Leser sp&#228;ter hat, der am
</I>&gt;<i> Anfang auch nicht wei&#223;, was vielleicht am Ende noch kommt, und der auch
</I>&gt;<i> beim ersten Versuch verstehen soll, was gemeint ist. Also los geht's:
</I>&gt;<i>
</I>&gt;<i> Am Sonntag, den 05.07.2009, 19:34 +0200 schrieb J&#246;rg Richter:
</I>&gt;&gt;<i> Vision einer integrierten Arbeitsumgebung f&#252;r Wissensarbeiter
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Ein Wissensarbeiter verdient seinen Lebensunterhalt mit der
</I>&gt;&gt;<i> Interpretation und der Transformierung von Information (nach Peter
</I>&gt;&gt;<i> Drucker). Er liest viel Text, den er sich selber beschafft oder von
</I>&gt;&gt;<i> anderen hereingereicht bekommt. Daraus erstellt er neuen Text, oft
</I>&gt;&gt;<i> auch im Teamwork. Es entstehen mehrere Versionen. Es kreiert, kopiert,
</I>&gt;&gt;<i> stellt vorhandenes neu zusammen, und das Ergebnis landet bei einem
</I>&gt;&gt;<i> anderen Wissensarbeiter auf dem Tisch. Ist das Projekt abgeschlossen
</I>&gt;&gt;<i> werden die Artefakte archiviert, und der Kopf ist frei f&#252;r Neues.
</I>&gt;<i>
</I>&gt;<i> Hier fallen mir sofort zwei Sachen auf:
</I>&gt;<i>
</I>&gt;<i> 1.) Der Einstieg in den Text muss den Leser neugierig machen, so dass 
</I>&gt;<i> er
</I>&gt;<i> stark motiviert ist weiterzulesen. Dar&#252;ber entscheidet er n&#228;mlich
</I>&gt;<i> w&#228;hrend der ersten S&#228;tze. Wenn ihn die langweilen, bl&#228;ttert er weiter,
</I>&gt;<i> und wenn danach ein brillianter Artikel kommt, n&#252;tzt das nichts mehr,
</I>&gt;<i> bis dahin liest keiner. Da ist bei dieser Einleitung noch Potenzial f&#252;r
</I>&gt;<i> Verbesserungen.
</I>&gt;<i>
</I>&gt;<i> 2.) Diese Beschreibung klingt nach Selbstzweck. Einer w&#228;lzt Papiere, um
</I>&gt;<i> Sie hernach an einen Zweiten weiterzureichen, der sie andersrum 
</I>&gt;<i> sortiert
</I>&gt;<i> seinerseits weitergibt... Das ist &#252;berspitzt, klar. Aber es w&#228;re 
</I>&gt;<i> besser,
</I>&gt;<i> wenn r&#252;berk&#228;me, dass auch Wissensarbeit Mittel zu einem praktischen
</I>&gt;<i> Zweck ist, von dem wir hoffentlich alle was haben. Ansonsten k&#246;nnte der
</I>&gt;<i> fatale Eindruck entstehen, irgendwelche weltvergessenen Akademiker
</I>&gt;<i> schieben sich mit wichtiger Miene gegenseitig Dokumente zu und nennen
</I>&gt;<i> das frecherweise auch noch Arbeit. :)
</I>&gt;<i>
</I>&gt;&gt;<i> Oft arbeitet ein Wissensarbeiter in verschiedenen Arbeitskontexten zur
</I>&gt;&gt;<i> gleichen Zeit, z.B. an der Stellung eines Forschungsantrags, dem
</I>&gt;&gt;<i> Schreiben eines Artikels und der Organisation des n&#228;chsten Symposiums.
</I>&gt;&gt;<i> Zu jedem Kontext geh&#246;ren z.B. Emails, Notizen, Kontakte, Webseiten und
</I>&gt;&gt;<i> Termine. Der Alltag eines Wissensarbeiters ist
</I>&gt;&gt;<i> Arbeitskontext-zentriert.
</I>&gt;<i>
</I>&gt;<i> Sowas k&#246;nnte eventuell ein Aufh&#228;nger sein: Ein ganz konkretes Beispiel 
</I>&gt;<i> -
</I>&gt;<i> von mir aus Forschungsauftrag - wie vielf&#228;ltige Informationen aller
</I>&gt;<i> m&#246;glichen Formate zusammenh&#228;ngen. Vielleicht kann man das Chaos mit
</I>&gt;<i> einer Prise Witz schildern und dann fragen: Wie l&#228;sst sich das
</I>&gt;<i> beherrschen? Ziel w&#228;re dann, dass sich der Leser in dieser Situation
</I>&gt;<i> wiedererkennt und sich sagt: Genau, das ist auch oft mein Problem. Der
</I>&gt;<i> Autor will also wissen, wie man besser damit umgeht. Dann soll er das
</I>&gt;<i> mal erkl&#228;ren, das muss ich lesen...
</I>&gt;<i>
</I>&gt;<i> Auch andere Aufh&#228;nger sind denkbar. Aber irgendwie so gilt es 
</I>&gt;<i> Motivation
</I>&gt;<i> zu wecken.
</I>&gt;<i>
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Das Erlebnis, das ein Nutzer heutiger Computersysteme hingegen hat,
</I>&gt;&gt;<i> ist Anwendungs-zentriert. Gegenw&#228;rtig sind die meisten Anwendungen um
</I>&gt;&gt;<i> Netzwerkprotokolle und Dateiformate herumgebaut: f&#252;r Email ein
</I>&gt;&gt;<i> POP/IMAP/SMTP-Client, f&#252;rs Web ein HTTP-Client, zum Schreiben ein
</I>&gt;&gt;<i> .doc/.odf-Editor usw. Viele Anwendungen beanspruchen einen exklusiven
</I>&gt;&gt;<i> Bildschirmbereich, benutzen ein individuelles
</I>&gt;&gt;<i> Ablage/Kategoriesungssystem (z.B. Email-Folder vs. Filebrowser-Folder)
</I>&gt;&gt;<i> und bieten kaum M&#246;glichkeiten ihre Inhalte, mit denen anderer
</I>&gt;&gt;<i> Anwendungen zu verkn&#252;pfen. Der Wissensarbeiter mu&#223; viel zwischen
</I>&gt;&gt;<i> Anwendungen umschalten.
</I>&gt;<i>
</I>&gt;<i> Jeder andere auch.
</I>&gt;<i>
</I>&gt;&gt;<i> Oft wird dabei der Bildschirm mit Informationen  und Bedienelementen
</I>&gt;&gt;<i> belegt, die mit dem aktuellen Arbeitskontext  garnichts zu tun haben.
</I>&gt;&gt;<i> Diese Art Maschine verlangt dem Nutzer kognitive Resourcen ab, die
</I>&gt;&gt;<i> nicht in die eigentliche Arbeit flie&#223;en.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Ziel des DeepaMehta-Projekts ist, das Anwendungs-zentrierte Paradigma
</I>&gt;&gt;<i> durch ein Arbeitskontext-zentriertes Paradigma abzul&#246;sen. Die
</I>&gt;&gt;<i> Motivation dabei ist, die Benutzeroberfl&#228;che weiter weg von der
</I>&gt;&gt;<i> Maschine, hin zur Arbeits- und Denkwelt des Nutzers zu verlegen.
</I>&gt;<i>
</I>&gt;&gt;<i> Fragestellungen sind:
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> 1) Verglichen mit einer B&#252;roumgebung oder einem Schreibtisch ist die
</I>&gt;&gt;<i> Fl&#228;che eines Computerbildschirms ziemlich klein. Wie kann diese knappe
</I>&gt;&gt;<i> Resource bestm&#246;glichst genutzt werden? Einerseits sollen die Inhalte
</I>&gt;&gt;<i> des Nutzers im Mittelpunkt stehen; der Bildschirm soll nur Inhalte
</I>&gt;&gt;<i> anzeigen, die f&#252;r den aktuellen Arbeitskontext relevant sind.
</I>&gt;<i>
</I>&gt;<i> ... die f&#252;r die aktuelle Aufgabe bedeutsam sind? Ich w&#252;rde mit
</I>&gt;<i> abstrakten Begriffen vorsichtig sein, vor allem, wenn sie nicht 
</I>&gt;<i> zwingend
</I>&gt;<i> n&#246;tig sind. Wo man sie braucht, soll man sie benutzen, wir m&#252;ssen 
</I>&gt;<i> nichts
</I>&gt;<i> &#252;berm&#228;&#223;ig simplifizieren. Aber wo ich dasselbe mit allt&#228;glichen Worten
</I>&gt;<i> sagen kann, sind immer die konkreten, anschaulichen, leicht
</I>&gt;<i> verst&#228;ndlichen Worte die bessere Alternative. Das ist in
</I>&gt;<i> Wissenschafts-Prosa zuweilen anders, aber abgesehen davon, dass die
</I>&gt;<i> deswegen oft ein wenig nach des Kaisers neuen Kleidern riecht, hier
</I>&gt;<i> schreiben wir einen Magazin-Artikel.
</I>
Ja, einfache W&#246;rter sind besser.
Das Wort &quot;Arbeitskontext&quot; m&#252;&#223;te dann durchg&#228;ngig durch &quot;Aufgabe&quot; 
ersetzt werden.
Es spielt eine zentrale Rolle in dem Text.
&quot;Arbeitskontext-zentriert&quot; m&#252;&#223;te dann durchg&#228;ngig durch 
&quot;Aufgaben-zentriert&quot; ersetzt werden.

&gt;&gt;<i> Andererseits beanspruchen auch die Bedienelemente der Maschine Platz.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> 2) Wie kann die &quot;Virtualit&#228;t&quot; des Computer (nach Ted Nelson)
</I>&gt;<i>
</I>&gt;<i> s.o. Wenn ich damit rechne, dass mein Auditorium mit Ted Nelson 
</I>&gt;<i> vertraut
</I>&gt;<i> ist und den kennt und einordnen kann, mag das Sinn machen. Unsere
</I>&gt;<i> Leserschaft ist keine Expertengemeinde, sondern breiter aufgestellt und
</I>&gt;<i> wird mehrheitlich wenig mit einem solchen Hinweis anfangen k&#246;nnen. Im
</I>&gt;<i> schlimmsten Fall klingt es bei den Red-Nelson-Ignoranten dann nach
</I>&gt;<i> Angeberei.
</I>
Ja, ich verstehe, was Du meinst.
Meine Idee hier war, da&#223; jemand der etwas an Philosophie, Hintergrund 
und Querdenken interessiert ist, Ted Nelsons Formulierung 
m&#246;glicherweise interessant findet, und sich fragt, wer der denn wohl 
ist, und anf&#228;ngt selber zu rescherschieren. Dieser Ausflug w&#228;re f&#252;r den 
&#252;ber-den-Tellerrand-Kucker dann durchaus inspirierend.

&gt;&gt;<i> bestm&#246;glich verbunden werden, mit den Erfahrungen, die der Nutzer in
</I>&gt;&gt;<i> der realen Welt macht? Einerseits soll der Nutzer die F&#228;higkeiten, die
</I>&gt;&gt;<i> ihm in der realen Welt helfen, z.B. seine visuelle Intelligenz oder
</I>&gt;&gt;<i> sein Orientierungssinn, auch bei der Arbeit am Computer nutzen k&#246;nnen.
</I>&gt;&gt;<i> Andererseits sollen die virtuellen Eigenschaften des Computers
</I>&gt;&gt;<i> ausgesch&#246;pft werden.
</I>&gt;<i>
</I>&gt;<i> Was bedeutet es genau, die &quot;virtuellen Eigenschaften des Computers&quot;
</I>&gt;<i> auszusch&#246;pfen? Ein konkretes Beispiel w&#228;re zum besseren Verst&#228;ndnis
</I>&gt;<i> nicht schlecht.
</I>
&quot;Virtualit&#228;t&quot; k&#246;nnte man so erkl&#228;ren:
Kein Schreibtisch kann mir instantan Papiere herbeamen, die auf einem 
anderen Schreibtisch irgendwo in der Welt liegen. Ein Computer kann 
das.

&gt;&gt;<i> Die Einf&#252;hrung eines Arbeitskontext-zentrierten Paradigmas erfordert
</I>&gt;&gt;<i> ein neues Modell f&#252;r Desktop-Awendungen. Damit z.B. die Daten
</I>&gt;&gt;<i> verschiedener Anwendungen innerhalb eines Fensters angezeigt werden
</I>&gt;&gt;<i> k&#246;nnen, m&#252;ssen die Anwendungen ihre Funktionen und Daten von der
</I>&gt;&gt;<i> Visualisierung entkoppeln (ganz &#228;hnlich wie bei SOA-Anwendungen im
</I>&gt;&gt;<i> Unternehmens- oder Webumfeld). Das hei&#223;t nicht, da&#223; alle vorhandenen
</I>&gt;&gt;<i> Anwendungen neuprogrammiert werden m&#252;ssen. Denn, wenn die Aspekte, die
</I>&gt;&gt;<i> alle Anwendungen, die ein Wissensarbeiter haupts&#228;chlich nutzt,
</I>&gt;&gt;<i> gemeinsam haben, in eine Plattform verlagert werden, bleibt von den
</I>&gt;&gt;<i> Anwendungen garnicht viel &#252;brig.
</I>&gt;<i>
</I>&gt;<i> W&#252;rde man aus allen Anwendungen diejenigen Funktionen extrahieren, die
</I>&gt;<i> ein Wissensarbeiter besonders h&#228;ufig nutzt, und sie in einer eigenen
</I>&gt;<i> Plattform versammeln, dann bliebe von den ausgeschlachteten
</I>&gt;<i> Applikationen nicht mehr viel &#252;brig.
</I>&gt;<i>
</I>&gt;<i> Oder so, jedenfalls einfacher, weniger verschachtelt.
</I>
Ja, das ist besser.

&gt;&gt;<i> Und diese Funktionalit&#228;ten stehen oft
</I>&gt;&gt;<i> bereits als fertige Module (z.B. die JavaMail API f&#252;r
</I>&gt;&gt;<i> Mail-Protokolle,
</I>&gt;&gt;<i> die Open Source HTML-Engines &quot;Webkit&quot; und &quot;Gecko&quot; oder TinyMCE als
</I>&gt;&gt;<i> webbasierter WYSIWYG Editor) zur Verf&#252;gung.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Zu den gemeinsamen Aspekten aller Anwendungen eines Wissensarbeiters
</I>&gt;&gt;<i> geh&#246;ren: Informationen kommen irgendwo her, Informationen gehen
</I>&gt;&gt;<i> irgendwo hin. Informationen kommen in 4 Geschmaksrichtungen daher:
</I>&gt;&gt;<i> Text, Bild, Audio, Video. Informationen werden erzeugt, hergeholt,
</I>&gt;&gt;<i> neuzusammengestellt. Informationen werden von mehreren Personen
</I>&gt;&gt;<i> bearbeitet. Informationen sind mehr oder weniger strukturiert. In
</I>&gt;&gt;<i> Informationen wird navigiert. Informationen werden versioniert,
</I>&gt;&gt;<i> kategorisiert und archiviert. Diese Grundfunktionen sind (mehr oder
</I>&gt;&gt;<i> weniger) bereits in der DeepaMehta-Plattform integriert und stehen den
</I>&gt;&gt;<i> Nutzern und allen darauf aufbauenden Anwendungen konsistent zur
</I>&gt;&gt;<i> Verf&#252;gung.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Die Vision von DeepaMehta ist ein Computer, der bereits nach dem
</I>&gt;&gt;<i> Einschalten eine ad&#228;quate Arbeitsumgebung f&#252;r den Alltag eines
</I>&gt;&gt;<i> Wissensarbeiters darstellt.
</I>&gt;<i>
</I>&gt;<i> Wie soll das genau aussehen soll ist aber nicht klar geworden.
</I>&gt;<i> Wie meine Benutzerschnittstelle heute aussieht, das wei&#223; ich.
</I>&gt;<i> Ich lerne: So ist sie aber nicht optimal. Ich erfahre auch, was
</I>&gt;<i> prinzipiell besser sein k&#246;nnte. Aber wie das nun konkret aussehen soll,
</I>&gt;<i> das kann ich mir nach der Lekt&#252;re nicht vorstellen und ich bef&#252;rchte,
</I>&gt;<i> das k&#246;nnte entt&#228;uschen.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; Ende des Kastentexts &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;
</I>&gt;&gt;<i>
</I>&gt;&gt;<i>
</I>&gt;&gt;<i>
</I>&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<i> Rohtext zum Benutzererlebnis (2200 Zeichen) &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Der DeepaMehta-Bildschirm besteht aus einem einzigen Fenster. Es ist
</I>&gt;&gt;<i> nie von anderen Fenstern &#252;berlagert. Der Arbeitskontext ist stets als
</I>&gt;&gt;<i> Ganzes auf dem Bildschirm dargestellt (linke Seite), in Form einer
</I>&gt;&gt;<i> Topic Map aus Topics und Assoziationen. Ein Topic ist z.B. eine Email,
</I>&gt;&gt;<i> Webseite, Kontakt, Chatprotokoll, oder ein Projekt.
</I>&gt;<i>
</I>&gt;<i> Ah, hier kommt, was oben fehlt.
</I>&gt;<i>
</I>&gt;&gt;<i> Assoziationen
</I>&gt;&gt;<i> repr&#228;sentieren den Bedeutungszusammenhang. Gleichzeitig werden
</I>&gt;&gt;<i> Detailinformationen angezeigt (rechte Seite), z.B. Webseite oder der
</I>&gt;&gt;<i> Text einer Email. Inhalte werden direkt an Ort und Stelle editiert
</I>&gt;&gt;<i> und
</I>&gt;&gt;<i> verarbeitet, z.B. wird eine Email direkt aus dem DeepaMehta-Fenster
</I>&gt;&gt;<i> abgeschickt. Topics und Assoziationen werden manuell oder
</I>&gt;&gt;<i> programmatisch erzeugt. Topics k&#246;nnen von &#252;berall herkommen, z.B. von
</I>&gt;&gt;<i> Mailservern, Datenbanken, LDAP-Verzeichnissen oder Webservices.
</I>&gt;&gt;<i> DeepaMehta setzt Topics miteinander in Bezug, &#252;ber Anwendungs- und
</I>&gt;&gt;<i> Systemgrenzen hinweg. DeepaMehta bringt eine Reihe von Standard
</I>&gt;&gt;<i> Topic-Typen und deren Funktionalit&#228;t bereits mit, z.B. &quot;Person&quot;,
</I>&gt;&gt;<i> &quot;Email&quot;, &quot;Kalender&quot;. Weitere Topic-Typen, z.B. &quot;Protein&quot; und
</I>&gt;&gt;<i> &quot;Gerichtsproze&#223;&quot;, werden von den Nutzern selbst definiert, ganz nach
</I>&gt;&gt;<i> dem aus welchen Bereich man kommt. Die Topic Map wird vom Nutzer
</I>&gt;&gt;<i> selbst&#228;ndig angeordnet. Die enstehenden r&#228;umlichen Strukturen tragen
</I>&gt;&gt;<i> zur Orientierung und Erinnerung bei, ganz nach dem Prinzip von Mind
</I>&gt;&gt;<i> Maps (nach Tony Buzan). W&#228;hrend des Arbeitens bleibt der
</I>&gt;&gt;<i> Arbeitskontext
</I>&gt;&gt;<i> auf dem Bildschirm sichtbar und wird inkrementell erweitert. Z.B.
</I>&gt;&gt;<i> ensteht w&#228;hrend des Surfens im Web (rechte Seite) ein Netzwerk der
</I>&gt;&gt;<i> besuchten Seiten. Der Nutzer mu&#223; nie etwas speichern, es bleibt
</I>&gt;&gt;<i> einfach
</I>&gt;&gt;<i> alles da. Wenn der Bildschirm zu un&#252;bersichtlich wird, blendet der
</I>&gt;&gt;<i> Nutzer Dinge aus, die er im Moment nicht braucht. Sp&#228;ter kann er sie
</I>&gt;&gt;<i> wieder vorholen, auch in anderen Arbeitskontexte. Zum Organisieren
</I>&gt;&gt;<i> vieler Topic Maps richtet sich der Nutzer Workspaces ein. Mittels
</I>&gt;&gt;<i> Shared Workspaces arbeiten Nutzer gemeinsam an Inhalten.
</I>&gt;&gt;<i> DeepaMehta-Anwendungen, z.B. f&#252;r Kalender, Email, Webbrowser, sind
</I>&gt;&gt;<i> f&#252;r
</I>&gt;&gt;<i> den Nutzer nicht als solche wahrnehmbar. Stattdessen ist eine
</I>&gt;&gt;<i> DeepaMehta-Anwendung einfach eine Reihe weiterer Topic-Typen, die
</I>&gt;&gt;<i> ihre
</I>&gt;&gt;<i> Kommandos und Detail-Visualisierungen selbst mitbringen.
</I>&gt;<i>
</I>&gt;<i> Ja, hier wird das etwas klarer. Das geh&#246;rt unbedingt dazu. Auf jeden
</I>&gt;<i> Fall ist auh ein Screenshot unverzichtbar, damit man sich das 
</I>&gt;<i> vorstellen
</I>&gt;<i> kann.
</I>&gt;<i>
</I>&gt;<i> Was mir pers&#246;nlich nach wie vor nicht recht einleuchtet ist, wie das so
</I>&gt;<i> intuitiv bei sehr vielen Topics funktionieren soll.
</I>
Der Punkt ist: Topic Maps sind nie Beh&#228;lter f&#252;r Inhalte, sondern stets 
Sichten auf Inhalte, die woanders existieren. Die Inhalte sind 
unabh&#228;ngig von deren Visualisierung. Alle Inhalte existieren im 
&quot;Corporate Memory&quot;, (Gesamtged&#228;chtnis), eine Datenbank. Das Corporate 
Memory ist nirgenswo als Gesamtes repr&#228;sentiert. Es gibt keinen 
zentralen Einstieg, Root-Topic oder &#228;hnliches. Meiner Meinung nach 
haben wir uns l&#228;ngst (seit dem Internet) von der Idee des absoluten 
&#220;berblicks verabschiedet. Stattdessen gillt es, zum passenden Zeitpunkt 
die gew&#252;schte Information in meine Sicht, d.h. meinen aktuellen 
Arbeitskontext, zu holen.

In DeepaMehta gibt es 2 Arten, Informationen aus dem Corporate Memory 
hochzuholen:
1) Suche: mittels (Volltext-)Suche kann man sozusagen an beliebigen 
Stellen ins Corporate Memory reinpieken.
2) Assoziative (semantische) Navigation: Sobald ein Topic sichtbar ist, 
kann man &#252;ber &quot;What's related?&quot; entlang den Assoziationen navigieren 
und so inhaltlich verkn&#252;pfte Topics hochholen.

&gt;<i> Dank der Workspaces?
</I>&gt;<i> Sind das dann nicht meine alten Ordner unter neuem Namen? Und was ist
</I>&gt;<i> mit den vielen Funktionen, die &#252;ber die Standard-B&#252;rojobs hinausgehen?
</I>&gt;<i> Heute nachmittag habe ich mir &#252;ber neue Motive f&#252;r Eigenanzeigen
</I>&gt;<i> Gedanken gemacht. Dazu brauchte ich ein 2D- und ein 3D-Grafikprogramm
</I>&gt;<i> und eine Layoutsoftware. Das gibt es nicht so ohne weiteres via APIs.
</I>&gt;<i> Wie w&#252;rde das integriert?
</I>
DeepaMehta sieht ausdr&#252;cklich den Wissensarbeiter als den 
pr&#228;destinierten Anwender, der den gr&#246;&#223;ten Mehrwert von DeepaMehta 
erh&#228;lt. Ich bin der Ansicht, da&#223; sich die 5% der Funktionen, die ein 
Wissensarbeiter von den monolithischen Grafik-, Text- und 
Layoutprogrammen tats&#228;chlich nutzt, ohne Probleme direkt in die 
Plattform integrieren lassen. Die restlichen 95% werden von 
Spezialisten benutzt, und ein Wissensarbeiter hat oft garkeine Widmung, 
Spezialist bestimmter Computeranwendungen zu werden.

Dennoch: DeepaMehta w&#252;rde kein Erfolg werden, wenn es sich als der neue 
Mittelpunkt sieht, und erwartet, da&#223; alle Anwendungen nun in DeepaMehta 
reinwandern. Es mu&#223; offen und durchl&#228;ssig sein. Erst so kann ein 
DeepaMehta-&#214;kosystem entstehen. Andere Open Source Projekte machen es 
vor. Daf&#252;r sehe ich 2 Ebenen:

Ebene 1: Erweiterung durch Plugins. Schon jetzt lassen sich mit dem 
DeepaMehta-Anwendungsframework Module entwickeln, die neue 
Programm-Logik einbinden. In DeepaMehta 3 wird das Plugin-Konzept auch 
auf die Pr&#228;sentationsschicht ausgedehnt, d.h. da&#223; Softwareentwickler 
weitere Datenvisualisierer und -Editoren anbieten k&#246;nnen.

Ebene 2: Schon jetzt k&#246;nnen in DeepaMehta herk&#246;mmliche Applikationen 
und Dateien integriert werden (Topic-Typen &quot;Document&quot; und 
&quot;Application&quot;). Ziehe einfach eine Datei aus dem Filebrowser in die 
Topic Map -&gt; ein Document-Topic entsteht. Ein Document-Topic kann die 
hinterlegte Datei in seiner Ursprungsapplication &#246;ffnen (Document-Topic 
doppelklicken). Auf diese Weise ist zwar das Ende der 
DeepaMehta-1-Fenster-Welt erreicht. Was bleibt, ist der Mehrwert, da&#223; 
die Datei jetzt in der DeepaMehta-Welt repr&#228;sentiert ist, als Topic, 
und in ein semantisches Netzwerk eingebunden werden kann.

&gt;<i> Und was wird aus meinem Betriebssystem, das
</I>&gt;<i> mit Files und Ordnern rechnet und sich darauf gr&#252;ndet? Bleibt das
</I>&gt;<i> unver&#228;ndert auf einer unteren Ebene wie es ist?
</I>&gt;<i>
</I>&gt;<i> Streichen k&#246;nnte man die einl&#228;utenden Bemerkungen, was ein
</I>&gt;<i> Wissensarbeiter tut. Das ist im Wesentlichen bekannt. Einsteigen m&#252;sste
</I>&gt;<i> man mit einer Frage oder einem Problem. Zugunsten der konkreten
</I>&gt;<i> Beschreibung am Schluss m&#252;sste man versuchen, die abstrakteren
</I>&gt;<i> &#220;berlegungen zu k&#252;rzen.
</I>&gt;<i>
</I>&gt;<i> Alles machbar. Wir k&#246;nnen es so machen, dass ich die n&#228;chste Fassung
</I>&gt;<i> redigiere. Dabei w&#252;rde ich dann auch die L&#228;nge auf die maximal m&#246;gliche
</I>&gt;<i> Seite begrenzen und Dir eine layoutete Fassung zum Gegenlesen geben.
</I>&gt;<i> Aber vielleicht willst Du ja noch was &#228;ndern/einarbeiten.
</I>
Ja, wenn Du die n&#228;chste Textfassung erstellst, das f&#228;nde ich gut.
Du bist der erfahrenere Schreiber und kennst Deine Leser.

Was h&#228;lst Du von meinem Vorhaben ein Bild in den Textkasten 
aufzunehmen, das das Arbeitskontext-zentrierte Paradigma (das dann 
&quot;Aufgaben-zentriert&quot; hei&#223;en w&#252;rde) dem Anwendungs-zentrierten Paradigma 
gegen&#252;berstellt? Das ist der Kernaspekt meines Texts und w&#252;rde das 
grafisch m&#246;glicherweise nochmal deutlich und einpr&#228;gsam machen. Ich 
w&#252;rde dann jetzt anfangen das Bild zu erstellen.

=&gt; Ist Platz f&#252;r ein Bild vorhanden?

Hier h&#228;nge ich noch ein paar Abs&#228;tze ran, die das Benutzererlebnis 
nochmal ein wenig detailierter beschreiben.

Vielen Dank f&#252;r Dein Feedback!

Gr&#252;&#223;e
J&#246;rg


DeepaMehta speichert alle Arten von Informationen, seien es Emails, 
Webseiten, Kontakte, Chatprotokolle als Topics in einer Datenbank. 
Topics sind First-Class Objekte d.h. sie k&#246;nnen innerhalb eines 
Fensters angezeigt werden und es k&#246;nnen beliebige Beziehungen zwischen 
den Objekten ausgedr&#252;ckt werden.

DeepaMehta teilt den Bildschirm in 2 Bereiche auf. Auf der linken 
H&#228;lfte ist stehts die Arbeitssituation als Ganzes repr&#228;sentiert: 
Information verschiedener Art und Herkunft in ihrem 
Bedeutungszusammenhang. Auf der rechten Seite werden 
Detail-Informationen sowohl angezeigt, als auch editiert. Jeder Topic 
stellt seine Kommandos selbst zur Verf&#252;gung, z.B. bietet ein 
Email-Topic ein &quot;Send&quot; Kommando.

Neue Topic-Typen, z.B. &quot;Buch&quot;, &quot;Veranstaltung&quot;, &quot;Bestellung&quot; oder auch 
&quot;Protein&quot; und &quot;Gerichtsproze&#223;&quot;, werden von den Anwendern selbst 
definiert, ganz nach dem aus welchen Bereich man kommt. Die Definition 
von Typen erfolgt ebenfalls in Form von Topic Maps, denn auch Typen 
sind selst Topics. Neue Topic-Typen k&#246;nnen sofort benutzt werden, d.h. 
der Anwender kann sofort B&#252;cher anlegen, nach B&#252;chern suchen, oder 
B&#252;cher z.B. mit Themen und Autoren assoziieren.

Gemeinsames arbeiten an Inhalten ist sofort m&#246;glich. Dazu werden 
Workspaces eingerichtet (&quot;Workspace&quot; ist selbst ein Typ, den DeepaMehta 
standardm&#228;&#223;ig mitbringt). Zu einem Workspace kann eine Anzahl von 
Benutzern eingeladen werden und eine Reihe von Typen zugeordnet werden. 
Sobald sich ein Mitglied einlogt findet er den neuen Workspace vor und 
kann gemeinsam mit den anderen Mitgliedern die Typen benutzen. Die 
Typen bilden sozusagen das Begriffsvokabular innerhalb eines 
Workspaces. Standard-Typen wie &quot;Person&quot; stehen in allen Workspaces zur 
Verf&#252;gung.

Java Entwickler k&#246;nnen Topics weitere Kommandos hinzuf&#252;gen. Dazu 
hinterlegen sie einem Topic-Typen eine Java-Klasse, in der sie Hooks 
definieren, um auf bestimmte Anwender- oder Systemereignisse zu 
reagieren. So kann z.B. ein &quot;Appointment&quot;-Topic (Teil der 
Kalender-Awendung) auf die Verschiebung eines Termins damit reagieren, 
da&#223; es allen Teilnehmern eine Benachrichtung schickt.



&gt;<i> beste Gr&#252;&#223;e
</I>&gt;<i>
</I>&gt;<i> Jens-Christoph
</I>&gt;<i> -- 
</I>&gt;<i> Jens-Christoph Brendel
</I>&gt;<i>
</I>&gt;<i> = Editor-in-Chief              Linux Technical Review =
</I>&gt;<i> Linux New Media  AG       |    Phone:  +49 89 9934 1146
</I>&gt;<i> Putzbrunner Str. 71       |    Fax:    +49 89 9934 1199
</I>&gt;<i> 81739 M&#252;nchen, Germany    |    Mobile: +49 163 356 2561
</I>&gt;<i>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">jbrendel at linuxnewmedia.de</A> - <A HREF="http://www.linuxnewmedia.de">http://www.linuxnewmedia.de</A>
</I>&gt;<i>
</I>&gt;<i> Linux New Media         Lawrence -  Malaga - Manchester
</I>&gt;<i> The Pulse of Linux      M&#252;nchen - Sao Paulo -  Warszawa
</I>&gt;<i>
</I>&gt;<i> Vorstand: Brian Osborn,    Hermann Plank
</I>&gt;<i> Aufsichtsratsvorsitzender: Rudolf Strobl
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000277.html">[deepamehta-users] Text-Kasten f&#252;r DeepaMehta-Artikel (1. Version)
</A></li>
	<LI>Next message: <A HREF="000279.html">[deepamehta-users] Heute wieder Musik im Eschschloraque
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#278">[ date ]</a>
              <a href="thread.html#278">[ thread ]</a>
              <a href="subject.html#278">[ subject ]</a>
              <a href="author.html#278">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
