<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] DeepaMehta Community Meeting am 8. Mai
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2007-May/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20DeepaMehta%20Community%20Meeting%20am%208.%20Mai&In-Reply-To=%3C72910438cf0f1cfce030005dab002a39%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000039.html">
   <LINK REL="Next"  HREF="000040.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] DeepaMehta Community Meeting am 8. Mai</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20DeepaMehta%20Community%20Meeting%20am%208.%20Mai&In-Reply-To=%3C72910438cf0f1cfce030005dab002a39%40deepamehta.de%3E"
       TITLE="[deepamehta-users] DeepaMehta Community Meeting am 8. Mai">jri at deepamehta.de
       </A><BR>
    <I>Wed May  2 21:51:25 CEST 2007</I>
    <P><UL>
        <LI>Previous message: <A HREF="000039.html">[deepamehta-users] [deepamehta-devel] Globales DeepaMehta
</A></li>
        <LI>Next message: <A HREF="000040.html">[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#37">[ date ]</a>
              <a href="thread.html#37">[ thread ]</a>
              <a href="subject.html#37">[ subject ]</a>
              <a href="author.html#37">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Liebe DeepaMehta-Freunde,

Das n&#228;chste DeepaMehta Community Meeting findet statt am

	Dienstag, 8. Mai, 18-21 Uhr.

im newthinking store Mitte in der Tucholskystra&#223;e 48.
ACHTUNG: anderer Ort als &#252;blich

	Motto: &quot;Eine revolution&#228;re Idee wird am Anfang oft &#252;bersehen. Dann 
lacht man &#252;ber sie, schlie&#223;lich bek&#228;mpft man sie -- und zum Schluss 
gewinnt sie doch.&quot; -- Mahatma Gandhi


Die DeepaMehta Anwender- und Entwickler-Community hat noch nicht die 
Dynamik und Produktivit&#228;t anderer &quot;gro&#223;er&quot; Open Source Projekte 
erreicht. Ziel dieses Community Meetings ist, Grundlagen zu schaffen, 
die zur Verbesserung dieser Situation beitragen.

Das Treffen wird von Dr. Jurij Poelchau moderiert, der viel Erfahrung 
mit dem Aufbau sozialer Netze hat. Jurij Poelchau ist Gr&#252;nder und 
Vorstandsmitglied vom f hoch x-Institut f&#252;r zukunftsf&#228;higes 
Wirtschaften (www.fhochx.de) und Vorstandsmitglied der amina-Stiftung.

Auf dem Programm:

1) J&#246;rg berichtet (ganz kurz ;-) &#252;ber Neuigkeiten der letzten Wochen.

2) J&#246;rg stellt den DeepaMehta 5-Jahresplan vor, der detailiert zu 
entwickelnde DeepaMehta-Features und deren gesch&#228;tzte Arbeitsaufw&#228;nde 
auflistet. Der 5-Jahresplan soll Softwareentwickler dabei unterst&#252;zen 
sich f&#252;r ein DeepaMehta-Engagement zu entscheiden, richtet sich aber 
auch z.B. an Dokumentations-Schreiber.

3) Transparent-Machung der Interessen und Zusagen aller Community 
Mitglieder. Zu jedem Community Mitglied werden zweierlei Informationen 
sichtbar gemacht:
	- Mein Profil / Was bringe ich mit? Wer bin ich? Was sind meine 
Interessen? In welchen (nicht-DeepaMehta-)Projekten engagiere ich mich? 
Mit welchen Institutionenn und Initiativen bin ich vernetzt?
	- Ich und die DeepaMehta Community / Wo will ich hin? Welche W&#252;nsche 
habe ich an die Community? Was ist mein Ziel in der DeepaMehta 
Community und was werde ich unternehmen es zu erreichen? Was habe ich 
f&#252;r konkrete Projektideen und was ist mein tats&#228;chlicher Beitrag dazu?

Zur Erfassung dieser Informationen wird die Online-DeepaMehta-Plattform 
benutzt. Jedes Community Mitglied kann seine Angaben selbst eingeben 
und aktualisieren. Die Informationen werden von anderen 
DeepaMehta-Benutzern einsehbar sein. Dies wird die erste 
DeepaMehta-Anwendung sein, die tats&#228;chlich von allen Community 
Mitgliedern gemeinsam benutzt wird. Die mittelfristige Perspektive ist 
die automatische Ver&#246;ffentlichung dieser Informationen auf der &quot;About 
Us&quot;-Seite der DeepaMehta-Website.

=&gt; Um an diesem Proze&#223; teilzunehmen, ist ein DeepaMehta-Online-Account 
notwendig. Wer noch keinen hat, lasse sich bitte einen einrichten. Wie 
das geht steht auf
www.deepamehta.de/install/client/login.html

=&gt; Morgen erhaltet ihr eine Anleitung zur o.g. Community-Anwendung, 
mittels der ihr bereits beginnen k&#246;nnt, euer Profil zu f&#252;llen. Je mehr 
Erfahrung ihr mit der Anwendung bis zum Treffen gemacht habt und je 
mehr Informationen bereits eingestellt sind, desto besser.


Im Allgemeinen sind die DeepaMehta Community-Treffen eine Gelegenheit, 
DeepaMehta-Entwickler und -Anwender kennenzulernen, sich &#252;ber die 
neusten Entwicklungen zu informieren, Fragen zu kl&#228;ren, Mitarbeit 
anzubieten und Projekte ins Leben zu rufen. Die Treffen finden 
unregelm&#228;&#223;ig statt, etwa einmal im Monat. Die Ank&#252;ndigungen erscheinen 
auf der DeepaMehta Website und in der Mailingliste deepamehta-users.

=&gt; An alle, die noch nicht die Mailingliste deepamehta-users abbiniert 
haben: Wenn ihr Interesse habt, am DeepaMehta Community Proze&#223; 
teilzunehmen, und z.B. per Mail &#252;ber die Veranstaltungshinweise 
informiert werden m&#246;chtet, abboniert bitte die Mailingliste 
deepamehta-users.


Gr&#252;&#223;e
J&#246;rg Richter

www.deepamehta.de


Diese Einladung im Internet:
www.deepamehta.de/events/community-meeting-20070508.html


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000039.html">[deepamehta-users] [deepamehta-devel] Globales DeepaMehta
</A></li>
	<LI>Next message: <A HREF="000040.html">[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#37">[ date ]</a>
              <a href="thread.html#37">[ thread ]</a>
              <a href="subject.html#37">[ subject ]</a>
              <a href="author.html#37">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
