<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Benutzung der DeepaMehta Community-Anwendung
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2007-May/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Benutzung%20der%20DeepaMehta%20Community-Anwendung&In-Reply-To=%3Ccb15a9b8d0bc53cc06ff4b8d56cef5a6%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000040.html">
   <LINK REL="Next"  HREF="000042.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Benutzung%20der%20DeepaMehta%20Community-Anwendung&In-Reply-To=%3Ccb15a9b8d0bc53cc06ff4b8d56cef5a6%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung">jri at deepamehta.de
       </A><BR>
    <I>Mon May  7 13:47:34 CEST 2007</I>
    <P><UL>
        <LI>Previous message: <A HREF="000040.html">[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung
</A></li>
        <LI>Next message: <A HREF="000042.html">[deepamehta-users] Protokoll DM Community-Treffens vom 08.05.07
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#41">[ date ]</a>
              <a href="thread.html#41">[ thread ]</a>
              <a href="subject.html#41">[ subject ]</a>
              <a href="author.html#41">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Lieber Harald,

danke f&#252;r Dein Feedback! Da Du wichtige Punkte ansprichst, mache ich 
Deine Mail hier auf der Liste sichtbar.


On 06.05.2007, at 15:33, Harald M&#252;ller wrote:

&gt;<i> hallo j&#246;rg,
</I>&gt;<i>
</I>&gt;<i> ich f&#228;nde es gut, wenn deine definitionen von wish, aim, etc
</I>&gt;<i> gleich auch in den description-feldern der jeweiligen topic types 
</I>&gt;<i> st&#252;nden.
</I>&gt;<i> so k&#246;nnte jeder nachvollziehen was er sich darunter vorzustellen hat
</I>&gt;<i> und gleichzeitig w&#252;rde man deepamehta auch benutzen!
</I>
Die Bedeutung der Typen &quot;Wish&quot;, &quot;Aim&quot; usw. in das Description-Feld des 
jeweiligen Typen einzutragen, ist genau der richtige Gedanke. Ich hatte 
das auch vor, bin aber noch nicht dazu gekommen. Der Text im 
Description-Feld der Typen ist auch Teil der Hilfe-Funktion und taucht 
als Hilfe-Text zu einer Topic-Instanz auf (z.B. &quot;What is a wish?&quot; resp. 
Doppelklick).

&gt;<i> leider konnte ich es nicht reinpasten, obwohl ich doch mitglied der 
</I>&gt;<i> deepamehtacommunity bin!
</I>&gt;<i> ist doch schade und zugleich unverst&#228;ndlich, dass ein mitglied der 
</I>&gt;<i> community nicht deren topictypes editieren darf.
</I>
Auch hier hast Du im Prinzip recht. Es ist zwar nicht so gedacht, da&#223; 
jedes Workspace-Mitglied die Hilfe-Texte der Typen und damit deren 
_Bedeutung_ &#228;ndern k&#246;nnen soll, denn auf die Bedeutung der Typen m&#252;ssen 
sich _alle_ Mitglieder einigen. Aber in der Tat ist DeepaMehtas 
Rechte-System noch nicht differenziert genug. Das ist ein gro&#223;es Thema 
und wird bald neu-entworfen. In Deinem speziellen Fall ist hier 
allerdings nicht das Rechte-System die Bremse. Denn: Du als 
DeepaMehta-Administrator darfst alle Inhalte &#228;ndern! Allerdings: 
Copy-Paste geht auf dem Mac tats&#228;chlich nicht (ich wei&#223; noch nicht 
warum, aber das ist ein anderes Problem. Bei Windows geht das). Was 
aber geht: Drag'n'Drop! Damit kannst Du die Hilfe-Texte aus der Mail in 
die DeepaMehta-Type-Descriptions reindroppen und ich w&#252;rde mich freuen, 
wennn Du das machst :-)

&gt;<i> f&#252;r mich wirken solche dinge immer noch als bremse.
</I>&gt;<i> ich m&#246;chte etwas tun, etwas erg&#228;nzen, anpassen, was auch immer, und 
</I>&gt;<i> darf es dann aber wegen mangelnder rechte nicht.
</I>&gt;<i> so wird meine motivation oft schon am anfang abgew&#252;rgt!
</I>&gt;<i>
</I>&gt;<i> viele gr&#252;&#223;e, harald
</I>
Auch andere Community-Mitglieder haben eventuell ein weiteres Problem 
entdeckt, das wiederum mit dem Rechte-System zusammenh&#228;ngt: die 
&quot;Description&quot; ihres eigenen User-Topics, wo die Selbstbeschreibung 
eingegeben werden soll, l&#228;&#223;t sich nicht &#228;ndern. F&#252;r die 4 Mitglieder, 
die inzwischen beigetreten sind (Harald M., Marlene B., Matthias M. und 
Malte R.) hab' ich die entsprechenden User-Topics inzwischen gezwickt, 
damit sie ihre Beschreibung eingeben k&#246;nnen. Aber alle ab jetzt 
beigetretenen, schreiben mir bitte eine kurze Mail, damit ich auch ihre 
User-Topics entsprechend zwicken kann.

Gr&#252;&#223;e
J&#246;rg

PS an Malte: wenn Du an der DeepaMehta Community interessiert bist, 
abboniere dich bitte die deepamehta-users Mailingliste. Es ist sonst zu 
kompliziert f&#252;r mich all' die Interessenten im Blick zu behalten, und 
manuell zu adressieren. Wenn Du die Liste abboniert hast, kannst Du 
keine wichtige Mitteilung vers&#228;umen. Andererseits wirst Du auch nicht 
&#252;berh&#228;uft, denn so viel Traffic gibt es im Moment noch nicht.


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000040.html">[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung
</A></li>
	<LI>Next message: <A HREF="000042.html">[deepamehta-users] Protokoll DM Community-Treffens vom 08.05.07
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#41">[ date ]</a>
              <a href="thread.html#41">[ thread ]</a>
              <a href="subject.html#41">[ subject ]</a>
              <a href="author.html#41">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
