<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Benutzung der DeepaMehta Community-Anwendung
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2007-May/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Benutzung%20der%20DeepaMehta%20Community-Anwendung&In-Reply-To=%3C664920e620824cbf4e24c2f11c4c7445%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000037.html">
   <LINK REL="Next"  HREF="000041.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Benutzung%20der%20DeepaMehta%20Community-Anwendung&In-Reply-To=%3C664920e620824cbf4e24c2f11c4c7445%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung">jri at deepamehta.de
       </A><BR>
    <I>Fri May  4 18:17:25 CEST 2007</I>
    <P><UL>
        <LI>Previous message: <A HREF="000037.html">[deepamehta-users] DeepaMehta Community Meeting am 8. Mai
</A></li>
        <LI>Next message: <A HREF="000041.html">[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#40">[ date ]</a>
              <a href="thread.html#40">[ thread ]</a>
              <a href="subject.html#40">[ subject ]</a>
              <a href="author.html#40">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Liebe DeepaMehta-Freunde,

wie in der Einladung angek&#252;ndigt, geht es beim n&#228;chsten 
Community-Treffen darum, die Interessen und Zusagen der Community 
Mitglieder transparent zu machen. Zu diesem Zweck wollen wir DeepaMehta 
selbst benutzen. Die entsprechende &quot;DeepaMehta Community&quot;-Anwendung ist 
jetzt vorbereitet, und kann ab sofort benutzt werden.

Jedes Community Mitglied kann seine Angaben selbst eingeben und 
aktualisieren. Ge&#228;ndert werden k&#246;nnen nur die eigenen Angaben. Gesehen 
werden k&#246;nnen alle Angaben potenziell von jedem DeepaMehta-Benutzer.

Zu jedem Community Mitglied sollen 2 Arten von Informationen sichtbar 
werden:

1) Mein Profil / Was bringe ich mit?

Hierzu geh&#246;ren allgemeine Information zur Person, _unabh&#228;ngig_ vom 
DeepaMehta-Projekt. Wer bin ich? (Wie sehe ich aus?) Was sind meine 
Interessen / meine Websites? In welchen Projekten engagiere ich mich? 
Mit welchen Personen, Institutionen und Initiativen bin ich vernetzt? 
Wie kann man mich kontaktieren?

Zur Eingabe dieser Informationen sollen folgende Topic Typen verwendet 
werden: &quot;Person&quot;, &quot;Institution&quot;, &quot;Project&quot;, &quot;Initiative&quot;. F&#252;r die 
Kontaktangaben k&#246;nnen folgende Topic Typen verwendet werden: &quot;Address&quot;, 
&quot;Email Address&quot;, &quot;Webpage&quot;, &quot;Phone Number&quot;, &quot;Fax Number&quot;, &quot;Mobile 
Number&quot;.

2) Die DeepaMehta Community und ich / Wo will ich hin?

Hier wird der Bezug zu DeepaMehta hergestellt. Welche W&#252;nsche habe ich 
an die Community? Was ist mein Ziel in der DeepaMehta Community und was 
werde ich unternehmen es zu erreichen? Was habe ich f&#252;r konkrete 
Projektideen und was ist mein tats&#228;chlicher Beitrag dazu?

Zur Eingabe dieser Informationen sind folgende Topic Typen vorbereitet: 
&quot;Wish&quot;, &quot;Aim&quot;, &quot;Project Concept&quot;. Zur speziellen Bedeutung dieser 3 
Typen:

Wish - Ein Wunsch an die DeepaMehta Community, z.B. &quot;Sch&#246;nerer Ort f&#252;r 
die Community Treffen&quot;, &quot;Bessere Moderation&quot;, &quot;Mehr Benutzer&quot; oder &quot;Ich 
m&#246;chte gerne in DeepaMehta mehrere Topics gleichzeitig ausw&#228;hlen 
k&#246;nnen&quot;.
W&#252;nsche k&#246;nnen einfach so ausgesprochen werden, ohne, da&#223; der 
W&#252;nschende einen aktiven Beitrag zur Realisierung des Wunsches leisten 
mu&#223;. Andererseits gibt es keine Garantie, ob der Wunsch jemals erf&#252;llt 
wird. Welche W&#252;nsche realisiert werden, wird damit zusammenh&#228;ngen 
wieviele Personen den gleichen Wunsch haben.

Aim (Ziel) - Ein pers&#246;nliches Ziel innerhalb des DeepaMehta-Projekts, 
mit gleichzeitger Vorstellung, was die konkreten Schritte und der 
eigene Beitrag zur Erreichung des Ziels sind. Z.B. &quot;ich m&#246;chte gerne 
eine bezahlte Stelle bei DeepaMehta haben und werde versuchen 
Kundenprojekte zu acquirieren.&quot; oder &quot;Ich m&#246;chte gerne, da&#223; ein 
DeepaMehta-Artikel in der c't erscheint und werde zusammen mit anderen 
einen schreiben und den Kontakt zur Redaktion herstellen.&quot; oder &quot;Ich 
m&#246;chte gerne in Kontakt mit 'hochkar&#228;tigen' Akteuren kommen und werde 
es &#252;bernehmen die 1. DeepaMehta Convention zu organisieren&quot;.

Project Concept - Die Idee f&#252;r ein (Entwicklungs-)Projekt mit der 
Zusage eine ver&#246;ffentlichungsf&#228;hige Konzeption dazu zu schreiben und 
sich um die Aufstellung eines Projektteams, inklusive Projektleiter zu 
k&#252;mmern. Aus Projektideen werden konkrete Projekte. Sobald das 
Projektteam bereitsteht, wird das Projekt gestartet und vom 
Projektleiter gesteuert. Projektideen sind z.B. &quot;Ich werde (gemeinsam 
mit J&#246;rg) eine Konzeption erstellen, wie Webbrowser-Funktionalit&#228;t in 
DeepaMehta integriert werden kann und werde ein entsprechendes 
Projektteam zusammenstellen&quot;


BENUTZUNG DER COMMUNITY-ANWENDUNG

1) Einloggen

Gehe auf www.deepamehta.de, klicke auf &quot;Login&quot; und logge Dich ein. F&#252;r 
den Fall, da&#223; Du noch keinen Account hast: auf der &quot;Login&quot;-Seite ist 
beschrieben, wie man einen Account bekommt.

2) Trete dem Workspace &quot;DeepaMehta Community&quot; bei (einmaliger Vorgang)

In einer beliebigen Topic Map: &quot;Search -&gt; Workspace&quot; (Rechtsklick auf 
den Topic Map-Hintergrund). Hole aus der Ergebnis-Tonne den Workspace: 
&quot;Show Result -&gt; DeepaMehta Community&quot; (Rechtsklick auf die Tonne). 
Trete dem Workspace bei: &quot;Join&quot; (Rechtsklick auf den Workspace).
Ergebnis 1: Dein User-Topic und eine Membership (orange) werden 
sichtbar.
Ergebnis 2: In den Search- und Create-Menus (Rechtsklick auf den Topic 
Map-Hintergrund) taucht jetzt der neue Workspace mit seinen 7 Topic 
Typen auf (&quot;Person&quot;, &quot;Institution&quot;, &quot;Project&quot;, &quot;Initiative&quot;, &quot;Wish&quot;, 
&quot;Aim&quot;, &quot;Project Concept&quot;). Siehe Screenshot:
www.deepamehta.de/events/deepamehta-community-workspace.png

3) Gebe Dein Profil und Deinen Bezug zum DeepaMehta-Projekt ein

Gebe Deine Selbstbeschreibung und Interessen in das 
&quot;Description&quot;-Freitextfeld Deines User-Topics ein. Per drag'n'drop 
kannst Du auch ein Portraitbild in dieses Feld ziehen. Zum Vernetzen 
mit anderen Personen (Usern), Institutionen, Projekten und Initiativen 
lege die entsprechenden Topics an (oder hole sie per &quot;Search&quot; aus dem 
Corporate Memory), und erzeuge eine Assoztiation (grau) zu Deinem 
User-Topic. Zum Eingaben Deiner Kontaktangaben (Email-Adresse usw.) 
benutze die Assign-Kommandos Deines User-Topics.

Um Deinen Bezug zum DeepaMehta-Projekt einzugeben, lege entsprechende 
&quot;Wish&quot;, &quot;Aim&quot; und &quot;Project Concept&quot;-Topics an, und erzeuge eine 
Assoztiation (grau) zu Deinem User-Topic.

4) Sieh' Dir an, was andere Community Mitglieder eingegeben haben

Aufdecken der anderen DeepaMehta Community-Mitglieder: Klicke den 
Workspace &quot;DeepaMehta Community&quot; an (rechte Taste) und w&#228;hle &quot;What's 
related? -&gt; Users&quot;. Ergebnis: alle Workspace-Mitglieder werden 
angezeigt (User-Topics). Zum Ansehen der Selbstbeschreibung klicke den 
entsprechenden User-Topic an. Zum Ansehen der Vernetzung (u.a. 
Kontaktangaben, DeepaMehta-Bezug) w&#228;hle den entsprechenden Topic Typ 
aus dem &quot;What's related?&quot;-Men&#252; des User-Topics.


=&gt; Bitte erstellt alle Inhalte m&#246;glichst in Englisch. Die langfristige 
Perspektive ist ja, internationale Zusammenarbeit zu erm&#246;glichen. Die 
mittelfristige Perspektive ist, die Inhalte der Community-Anwendung 
&#252;ber die &quot;About Us&quot;-Seite der (englischen) DeepaMehta Website zu 
ver&#246;ffentlichen.


So liebe Kollegen, jetzt k&#246;nntet ihr im Prinzip sofort starten ;-) und 
eure Inhalte eingeben. Es w&#228;r' ja sch&#246;n, wenn zum Community-Treffen am 
Dienstag bereits konkrete Erfahrung mit der Community-Anwendung gemacht 
wurden, und schon echte Inhalte da sind.

Gr&#252;&#223;e
J&#246;rg Richter

www.deepamehta.de


PS: Ich habe geh&#246;rt, da&#223; in der Ank&#252;ndigung des Community-Treffens die 
Ortsangabe nicht eindeutig war. Das Treffen findet statt im newthinking 
store MITTE (nicht Kreuzberg wie bisher).


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000037.html">[deepamehta-users] DeepaMehta Community Meeting am 8. Mai
</A></li>
	<LI>Next message: <A HREF="000041.html">[deepamehta-users] Benutzung der DeepaMehta Community-Anwendung
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#40">[ date ]</a>
              <a href="thread.html#40">[ thread ]</a>
              <a href="subject.html#40">[ subject ]</a>
              <a href="author.html#40">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
