<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users]  Meine Gedanken zu DeepaMehta
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2008-April/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%20Meine%20Gedanken%20zu%20DeepaMehta&In-Reply-To=%3C4808EDD5.8010806%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000135.html">
   <LINK REL="Next"  HREF="000137.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users]  Meine Gedanken zu DeepaMehta</H1>
    <B>Malte Rei&#223;ig</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%20Meine%20Gedanken%20zu%20DeepaMehta&In-Reply-To=%3C4808EDD5.8010806%40deepamehta.de%3E"
       TITLE="[deepamehta-users]  Meine Gedanken zu DeepaMehta">mre at deepamehta.de
       </A><BR>
    <I>Fri Apr 18 20:52:05 CEST 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000135.html">[deepamehta-users] Attention, it`s about your Corporate Memory
</A></li>
        <LI>Next message: <A HREF="000137.html">[deepamehta-users] A new wiki, but what`s next?
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#136">[ date ]</a>
              <a href="thread.html#136">[ thread ]</a>
              <a href="subject.html#136">[ subject ]</a>
              <a href="author.html#136">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>&lt; Hi Norbert,


&lt; wow vielen Dank f&#252;r deinen Input. Ich werde versuchen dir
&lt; einige deiner Fragen zu beantworten. Leider bekomme ich deine Mail
&lt; erst jetzt obwohl ich mittlerweile registrierter User in dieser
&lt; Liste bin, allerdings immer noch keine Nachrichten bekomme. Mist.

&lt; Also deshalb ist deine Nachricht auch nicht einger&#252;ckt sonder
&lt; meine. Eins nach dem anderen. Das ist jetzt alles &quot;heavy&quot; input,
&lt; aber schritt f&#252;r schritt kommen wir voran.

Moin Moin,
ich weis nicht ob ich mich besonders d&#228;mlich anstelle oder ob ich
zuviel von DM  erwarte. Fakt ist jedenfalls da&#223; _ich_ nicht sinnvoll
mit DM arbeiten kann.

Es beginnt f&#252;r mich damit da&#223; ich keine Zusammenfassung der
Zusammenh&#228;nge zwischen den einzelnen Typen finde. Z.B. zwischen
Topic und den zugeh&#246;rigen Properties. Bei den Properties kann ich
z.B. ein Inputfield angeben. Wo aber taucht das denn dann auf?? Oder
das Optionsmenue wo gebe ich die Optionen dieses Menues an und wie
setze ich die default Option ??


&lt; Hier m&#246;chte ich dich animieren, dich mal an den TypDefinitionen
&lt; langzuhangeln und deren Struktur zu erkunden. Die Properties haben
&lt; einzelne Visualization Modes und nur die beiden &quot;Options -&quot; Modes
&lt; erlauben das erzeugen von Property Values. Als Default Value
&lt; tr&#228;gst du den gew&#252;nschten Value ein.

&lt; TopicTypen sind so etwas wie Schablonen f&#252;r Objekte und alle
&lt; Instanzen vom Typ Person haben diese Eigenschaften, &#228;nderst du den
&lt; TopicTypen und machst ein &quot;Update&quot; Kommando, haben alle Instanzen
&lt; sofort die neuen Eigenschaften.

&lt; Das die Konzepte der OOP hier so ohne weiteres im User Interface
&lt; zur Verf&#252;gung stehen, mag der User ohne Einf&#252;hrung eine
&lt; Weile wirken lassen bis er dadurch zum DatenModell-Entwickler
&lt; wird, ;)

(Kerneltyps hilft mir auch nicht weiter) Wie benutze ich Chats?

&lt; Einfach in der Chat Map. Rechtsklick und wenn kein Chat da ist,
&lt; einfach einen anlegen, mehr hast du ja nicht zur auswahl ;)
&lt; k&#246;nnen uns ja mal verabreden, die Kommunikation findet dann im
&lt; Property Panel statt. Alle Mitglieder eines Workspace k&#246;nnen
&lt; miteinander chatten.

wie Foren ??
&lt; Suche Messages und kreiere eine &quot;Reply&quot; zu einer
&lt; konkreten, oder leg eine neue Message an. Diese Message ist dann
&lt; ohne Umschweife im Web in unserem Messageboard zu sehen ;)

Alles Informationen die der Entwickler kennt, aber der User sich
anlesen mu&#223;.Nur wo ?? Wenn du nicht weiter weist, einfach
&quot;Rechtsklick&quot; da kannst du fast nichts falsch machen, entweder auf
der Map oder auf ein Topic.

Ein weiteres Beispiel ist die Suche. Ich suche in der Topicmap nach
Topicmaps und bekomme 9092 Topicmaps. Wie bekomme ich eine Liste?
Die Auswahl show Results ist inaktiv was man bei der Anzahl der
Treffer verstehen kann, aber wie bzw. wo  schr&#228;nke ich die
Treffermenge ein??

&lt; Eine Tonne/Container ist ein sog. &quot;Smart Folder&quot; und einfach die
&lt; Suche Filtern mit &quot;Charactern/Buchstaben&quot; rechts im property panel


Erzeuge ich in einer Topicmap einen Workspace so geht das, leider
kann ich den nicht aus der Topicmap herhaus mit einem Doppelklick
&#246;ffnen, sonder mu&#223; &#252;ber das Pulldownmenue gehen.

&lt; Hierzu gibt es keine offensichtliche Konzeption. Der User kann
&lt; Mitglied sein oder nicht, sowie der Workspace Public oder Private.

Eine Topicmap kann anscheinend keine andere Topicmap enthalten.
Warum ?? Ich m&#246;chte Daten auch hirarchisch strukturieren k&#246;nnen.

&lt; mmmhh, bis jetzt kannst du dir nur vorhandene TopicMaps in deine
&lt; eigene Map einblenden (&#252;ber das kommando &quot;search-&gt;topicmap&quot;), hier
 &lt; ist auch schon der Doppelklick realisiert, so das man direkt in
&lt; die Map gelangt

folge ich den Anweisungen
<A HREF="https://www.mindworxs.de/zwiki/BenutzungDerCommunityAnwendung">https://www.mindworxs.de/zwiki/BenutzungDerCommunityAnwendung</A>
komme ich bis 1) Mein Profil / Was bringe ich mit?

Es ist mir zwar m&#246;glich die entsprechenden Topic Types zu erzeugen,
aber ich kann sie nicht mit dem Nutzer assoziieren. Assign hingegen
funktioniert.

&lt; mmh, wenn ich das richtig verstehe bist du also mitglied im Shared
&lt; Workspace &quot;DeepaMehta Community&quot; und deshalb ist es dir m&#246;glich
&lt; diese TopicTypen zu suchen und zu erstellen, ok. Ist es dir denn
&lt; m&#246;glich Assoziationen allgemein zu kreieren (mit der alt-taste
&lt; oder &#252;ber die mittlere Maustaste)?. Dann kannst du diese Zuweisung
&lt; auch ohne Assign Kommando ausf&#252;hren.

Im Forum sind einige auf Anfragen einige Howtows gepostet worden,
sind die mal an einer zentralen Stelle zusammengefasst worden ??
Wenn nein, mache ich das gerne.

&lt; damit habe ich schonmal angefangen. die datei findest du hier
&lt; <A HREF="http://www.deepamehta.de/~mre/howTos.txt">http://www.deepamehta.de/~mre/howTos.txt</A> .... bis jetzt hat
&lt; das noch keiner weiter verfolgt. deine erg&#228;nzungen w&#252;rden uns viel
&lt; viel weiterhelfen und ein neues wiki folgt daf&#252;r auch bald, :)!
&lt; da w&#252;rden wir uns nat&#252;rlich &#252;ber unterst&#252;tzung freuen, dann
&lt; brauchen wir das nicht immer wieder neu zu schreiben, da die
&lt; informationen in den mailinglisten verschwinden. bez&#252;glich des
&lt; wikis wird noch eine entscheidung fallen, im blog dazu bald mehr.
&lt; momentan teilen wir uns noch ein wiki.

Zu allem &#220;berfluss h&#228;ngt sich das Applet h&#228;ufig auf.
Die Fehlermeldungen w&#252;rde ich gerne in andere Anwendungen (z.B.
Mail) &#252;bernehmen k&#246;nnen oder in eine Datei schreiben k&#246;nnen.

&lt; den log vom client findest du dann &#252;ber deinen browser da dieser
&lt; das java gestartet hat. viell. unter tools-&gt; advanced oder -&gt;
&lt; error console oder -&gt; java console, je nachdem sicher bin ich mir
&lt; da nicht, wahrscheinlich h&#228;ngt das noch vom fehler ab :(

So das war es ersteinmal ;-) Bitte f&#252;hlt euch _nicht_ auf die F&#252;&#223;e
getreten, ich weis das f&#252;r die Dokumentation h&#228;ufig die Zeit fehlt!
Aber das geilste Programm ist Mist, wenns f&#252;r den User nicht zu
bedienen ist.

&lt; danke dir vielen dank.

In diesem Sinne noch frohes Schaffen w&#252;nscht
Norbert

&lt; gru&#223; malte

-- 
===============================================================================
*Dipl.Phys. Norbert Zacharias                             zac at
uni-oldenburg.de*
*FB Physik                  Norbert.Zacharias at
arbi.informatik.uni-oldenburg.de*
*Carl-von-Ossietzky-Universitaet                         Tel.
0049-441-7983530*
*Postfach 2503                                           FAX
0049-441-7983990*
*26111 Oldenburg
          *
*Was Du nicht willst das man Dir tu, das will auch nicht was willst
denn Du?  *
*Heinz Erhardt
          *
===============================================================================
______________________
www.deepamehta.de/~mre

<A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">mre at deepamehta.de</A>
<A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">mre at jabber.ccc.de</A>



</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000135.html">[deepamehta-users] Attention, it`s about your Corporate Memory
</A></li>
	<LI>Next message: <A HREF="000137.html">[deepamehta-users] A new wiki, but what`s next?
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#136">[ date ]</a>
              <a href="thread.html#136">[ thread ]</a>
              <a href="subject.html#136">[ subject ]</a>
              <a href="author.html#136">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
