<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-June/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%0A%20%3D%3Fiso-8859-1%3Fq%3FKommender_Beitrag_%3DFCber_Deepam%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Fehta_im_Linux_Magazin%3F%3D&In-Reply-To=%3C1244785586.7772.38.camel%40localhost%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000266.html">
   <LINK REL="Next"  HREF="000268.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin</H1>
    <B>Jens-Christoph Brendel</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%0A%20%3D%3Fiso-8859-1%3Fq%3FKommender_Beitrag_%3DFCber_Deepam%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Fehta_im_Linux_Magazin%3F%3D&In-Reply-To=%3C1244785586.7772.38.camel%40localhost%3E"
       TITLE="[deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin">jbrendel at linuxnewmedia.de
       </A><BR>
    <I>Fri Jun 12 07:46:26 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000266.html">[deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin
</A></li>
        <LI>Next message: <A HREF="000268.html">[deepamehta-users] Kommender Beitrag &#252;ber  Deepamehta im Linux Magazin
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#267">[ date ]</a>
              <a href="thread.html#267">[ thread ]</a>
              <a href="subject.html#267">[ subject ]</a>
              <a href="author.html#267">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo J&#246;rg,

vielen Dank f&#252;r Deine Mail. Ich habe sie jetzt einmal gelesen und m&#246;chte
gleich auf zwei,  drei Dinge eingehen, die mir auf der Zunge liegen.
Danach sehe ich mir sicher noch einmal extra die Einzelheiten an, die
ich in den Text &#252;bernehmen kann. Was mir aber gleich auffiel  war:

Am Freitag, den 12.06.2009, 02:33 +0200 schrieb J&#246;rg Richter:

&gt;<i> Zun&#228;chst eine Orientierungsfrage: wird der Artikel im Linux Technical  
</I>&gt;<i> Review erscheinen (und nicht im regul&#228;ren Linux Magazin)?
</I>
Dieser Artikel ist f&#252;r das regul&#228;re Linux-Magazin gedacht. Die Linux
Technical Review macht monothematische Ausgaben zu rund einem Dutzend
fester Themen und da ist im Moment nichts dabei, was gut passen w&#252;rde.

&gt;<i> Wir sehen DeepaMehta nicht als Topic Map Editor, sondern als &quot;Semantic  
</I>&gt;<i> Desktop&quot; oder &quot;Plattform f&#252;r Kollaboration und Wissensmanagement&quot;.
</I>
Ok, das k&#246;nnen wir schon so darstellen. Bei der Herleitung des Themas
ist nat&#252;rlich ein weiterer Aspekt, was man dem Leser zumuten kann. Ich
w&#252;rde annehmen, dass viele Magazin-Leser von Topic Maps noch nie etwas
geh&#246;rt haben und k&#246;nnte mir vorstellen, dass man zum Beispiel einen
Bogen Index-&gt;Thesaurus-&gt;Ontologie-&gt;Topic Map hinbekommen kann und dann
bei Deepemehta als Werkzeug daf&#252;r landet und dann auch sagt: Aber
eigentlich ist es mehr... Wenn ich dagegen von Anfang an parallel auch
mit RDF hantiere, &#252;berfordere ich den unbedarften Leser vielleicht.

&gt;<i> Stimmt, DeepaMehta ist keine komplette Umsetzung des Topic Maps  
</I>&gt;<i> Standard. Auf der anderen Seite enth&#228;lt DeepaMehta propriet&#228;re  
</I>&gt;<i> Erweiterungen -- im Wesentlichen die Properties -- mit dem Hintergrund,  
</I>&gt;<i> die (ISO-)Topic Maps Welt mit der (W3C-)RDF Welt zu verschmelzen. 
</I>
Gut, das hatte ich tats&#228;chlich bisher nicht so im Blick und werde es
herausstellen.

&gt;<i> DeepaMehta setzt nicht auf Topic Maps allein, weil DeepaMehta weg  
</I>&gt;<i> m&#246;chte von Dateien als first-class Objekten. Denn: viele Informationen,  
</I>&gt;<i> die den Alltag eines Wissensarbeiters ausmachen -- Emails, Webseiten,  
</I>&gt;<i> Chats, Suchanfragen, Kontakte -- liegen garnicht in Dateiform vor! 
</I>
Das verstehe ich ehrlich gesagt nicht ganz: Unix und damit auch Linux
kennt den ber&#252;hmten Leitsatz: Alles ist eine Datei. Und entsprechend
liegen doch auch alle von Dir aufgez&#228;hlten Objekte tats&#228;chlich in
Dateiform vor: Eine Webseite ist eine HTML-Datei, eine E-Mail finde ich
in einer Maildir- oder Mbox-Datei, Kontakte speichert mein Adressbuch in
einer Datei und so fort. Diese Applikationen pr&#228;sentieren mir wom&#246;glich
keine Files, sondern eben Webseiten, Karteikarten oder was auch immer,
aber alle verwenden Dateien. Abgesehen von ein paar Datenbanken, die auf
raw devices schreiben k&#246;nnen, hat auch keine heutige Applikation eine
Wahl.

Das bringt mich gleich zu einer weiterf&#252;hrenden Frage: Was meint
Deepamehta, wenn es die Dateien &#252;berwinden will? Sollen sie tats&#228;chlich
als Speicherform verschwinden - dann m&#252;sste ich mir ja sicher ein
eigenes Betriebssystem schreiben - oder soll nur die Darstellung in
Dateiform abgel&#246;st werden? D.h. ich verbinde dann irgendwelche
Inhaltscontainer, von denen ich nicht mehr wei&#223;, dass sie als Dateien
gespeichert werden, aber auf der physischen Ebene sind es nach wir vor
Files?

&gt;<i> Was den &quot;Vision&quot;-Kasten betrifft: da m&#252;ssen wir sehen, wie sich der  
</I>&gt;<i> Artikel herausbildet, damit der Kasten dann dazu passt. Vieles der  
</I>&gt;<i> DeepaMehta-Vision habe ich hier und in meinen 2 wissenschaftlichen  
</I>&gt;<i> Artikeln (www.deepamehta.de / Documentation / Published Articles)  
</I>&gt;<i> beschrieben. M&#246;glicherweise kannst Du, Jens-Christoph, damit bereits  
</I>&gt;<i> den Kasten bestreiten. M&#246;glicherweise kann auch ich den Kasten  
</I>&gt;<i> schreiben, das w&#228;re eine sch&#246;ne Herausforderung f&#252;r mich (die nat&#252;rlich  
</I>&gt;<i> viel Widmung/Zeit ben&#246;tigt) und eine sch&#246;ne Chance f&#252;r DeepaMehta.
</I>
Das finde ich gar nicht so schwierig. Wenn ich im Text nur den Fakt
erw&#228;hne, dass Deepamehta an einer neuen Benutzerschnittstelle arbeitet
und f&#252;r Details auf den Kasten verweise, dann haben wir eine klare
Trennung und es wird sich nichts &#252;berschneiden, solange der Kasten dann
seinerseits beim Thema Benutzerschnittstelle bleibt und nicht zu viel
Allgemeines darstellen will.

Wenn Du den Kasten schreiben w&#252;rdest, h&#228;tte es f&#252;r mich den Charme, dass
wir damit so etwas wie einen O-Ton h&#228;tten. Der bringt noch einmal eine
eigene Authentizit&#228;t mit und eine zus&#228;tzliche Farbe ins Spiel, was dem
Beitrag sicher gut t&#228;te. So riesig viel Arbeit ist es auch deshalb
nicht, weil die Kunst darin best&#228;nde, sich auf rund 3000-3500 Zeichen zu
beschr&#228;nken. Allerh&#246;chstens 4500, aber das w&#228;re schon eine komplette
Seite und damit kein eigentlicher Kasten mehr. Der Termin steht fest:
Heute in vier Wochen geht der Text in die Druckerei, etwas eher muss er
also in der Redaktion sein.

So weit erstmal.

beste Gr&#252;&#223;e

Jens-Christoph

-- 
Jens-Christoph Brendel 
            
= Editor-in-Chief              Linux Technical Review =
Linux New Media  AG       |    Phone:  +49 89 9934 1146
Putzbrunner Str. 71       |    Fax:    +49 89 9934 1199
81929 M&#252;nchen, Germany    |    Mobile: +49 163 356 2561   

<A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">jbrendel at linuxnewmedia.de</A> - <A HREF="http://www.linuxnewmedia.de">http://www.linuxnewmedia.de</A>

Linux New Media         Lawrence -  Malaga - Manchester 
The Pulse of Linux      M&#252;nchen - Sao Paulo -  Warszawa

Vorstand: Brian Osborn,    Hermann Plank
Aufsichtsratsvorsitzender: Rudolf Strobl
                                   


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000266.html">[deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin
</A></li>
	<LI>Next message: <A HREF="000268.html">[deepamehta-users] Kommender Beitrag &#252;ber  Deepamehta im Linux Magazin
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#267">[ date ]</a>
              <a href="thread.html#267">[ thread ]</a>
              <a href="subject.html#267">[ subject ]</a>
              <a href="author.html#267">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
