<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Modellierung mit Deepamehta: Such-Properties
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-June/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Modellierung%20mit%20Deepamehta%3A%20Such-Properties&In-Reply-To=%3Cca1d5b4ae7160b6f2a4513388e13217d%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000271.html">
   <LINK REL="Next"  HREF="000273.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Modellierung mit Deepamehta: Such-Properties</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Modellierung%20mit%20Deepamehta%3A%20Such-Properties&In-Reply-To=%3Cca1d5b4ae7160b6f2a4513388e13217d%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Modellierung mit Deepamehta: Such-Properties">jri at deepamehta.de
       </A><BR>
    <I>Mon Jun 22 18:56:08 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000271.html">[deepamehta-users] Mittwoch: Musik im Eschschloraque mit Spezialgast
</A></li>
        <LI>Next message: <A HREF="000273.html">[deepamehta-users] DeepaMehta Workshop Invitation,	Monday 13th of July
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#272">[ date ]</a>
              <a href="thread.html#272">[ thread ]</a>
              <a href="subject.html#272">[ subject ]</a>
              <a href="author.html#272">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Lieber Jens-Christoph Brendel,

inzwischen hab' ich Deinen ersten Artikel-Entwurf gelesen. Ich finde 
ihn gelungen und kann da schon gut mitgehen. Dein Einstieg &#252;ber Topic 
Maps und das Musik-Szenario finde ich gut. Da&#223; Du mein Input 
ber&#252;cksichtigst, und darstellst, da&#223; DeepaMehta mehr ist, als ein Topic 
Map Editor, freut mich. Das eine oder andere Detail m&#246;chte ich vor der 
Ver&#246;ffentlichung gerne &#228;ndern.


On 15.06.2009, at 14:03, Jens-Christoph Brendel wrote:

&gt;<i> Am Sonntag, den 14.06.2009, 22:50 +0200 schrieb J&#246;rg Richter:
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Zun&#228;chst: man kann nach Properties suchen!
</I>&gt;<i>
</I>&gt;<i> Ok, das ist ein wichtiger Punkt. Martin hatte mir geschrieben:
</I>&gt;<i> &quot;Ich finde deine Typisierung gut und schon funktional. Allerdings kann
</I>&gt;<i> es helfen wenn man bei 'echten' Einzelinformation wie zum Beispiel 
</I>&gt;<i> einem
</I>&gt;<i> Termin oder einer Person entsprechende relationen zwischen den
</I>&gt;<i> TopicTypes verwendet statt properties. Danach l&#228;sst sich dann auch
</I>&gt;<i> suchen und ordnen.&quot;
</I>&gt;<i>
</I>&gt;<i> Ich hatte das so verstanden, dass ich erst danach suchen kann, nachdem
</I>&gt;<i> ich die Properties in Topics verwandelt habe. So h&#228;tte ich das auch in
</I>&gt;<i> dem Beitrag dargestellt: Erst meine L&#246;sung, die aus einem Artikel-Topic
</I>&gt;<i> bestand, in dessen Typdefinition keine anderen Topics vorkamen. Dazu
</I>&gt;<i> h&#228;tte ich gesagt: Intuitiv, aber nicht nach Property-Werten
</I>&gt;<i> durchsuchbar. Dann h&#228;tte ich den Vorschlag pr&#228;sentiert, den mir Martin
</I>&gt;<i> geschickt hatte, mit einem Calendar- und einem Person-Topic anstelle
</I>&gt;<i> vormaliger Properties. Dazu h&#228;tte ich gesagt: Komplexer, aber jetzt
</I>&gt;<i> durchsuchbar.
</I>&gt;<i>
</I>&gt;<i> Wenn ich da was missverstanden habe, dann fehlt mir jetzt dieser
</I>&gt;<i> Schritt in der Argumentation: Was ist dann der Vorteil an Martins
</I>&gt;<i> Vorschlag?
</I>
Dadr&#252;ber habe ich inzwischen geschrieben (&quot;Problem der 
Typ-Property-Dichotomie&quot;). Welche Modellierung angemessen ist, h&#228;ngt 
vom Anwendungskontext ab. Im Gro&#223;en und Ganzen aber, ist die 
Typ-Property-Dichotomie, wie beschrieben, aber eher eine Problemquelle, 
die in DeepaMehta 3 abgeschafft wird.

&gt;&gt;<i> Zu jedem Topic-Typ erzeugt DeepaMehta automatisch einen individuellen
</I>&gt;&gt;<i> Such-(Topic-)Typ, um nach Topics suchen zu k&#246;nnen. Es sind die
</I>&gt;&gt;<i> Suchtonnen, die von diesem Such-Typ sind. Suchen (im Interface: 
</I>&gt;&gt;<i> Tonnen)
</I>&gt;&gt;<i> sind also typisierte Topics, und haben ihrerseits Properties. Die
</I>&gt;&gt;<i> Properties der Such-Typen dienen als Eingabefelder f&#252;r Suchbegriffe.
</I>&gt;&gt;<i> Standardm&#228;&#223;ig hat jeder Such-Typ nur eine &quot;Name&quot;-Property. Diese
</I>&gt;&gt;<i> erm&#246;glicht die Suche anhand des Topic-Namens.
</I>&gt;&gt;<i> =&gt; Der (Power-)Anwender kann zu einem Such-Typ weitere Properties
</I>&gt;&gt;<i> hinzuf&#252;gen, um z.B. Personen anhand ihres Geschlechts (eine Property)
</I>&gt;&gt;<i> zu suchen.
</I>&gt;<i>
</I>&gt;<i> D.h. die Suche nach Properties ist zumindest insoweit nicht einfach
</I>&gt;<i> m&#246;glich, als ich mir erst einen speziellen Suchtyp basteln muss, der
</I>&gt;<i> mehr Such-Properties hat als den Namen?
</I>
Genaugenommen ist es so:
- Der Suchtyp ist bereits da (legt DeepaMehta zu jedem Typ automatisch 
an).
- Die Properties sind auch bereits da (mitgeliefert oder 
Benutzer-definiert).
- Nur die Assoziationen zwischen Suchtyp und gew&#252;nschten 
Such-Properties m&#252;ssen vom Nutzer angelegt werden.
Somit definiert der Nutzer selbst, in welchen Properties er suchen 
m&#246;chte.
- Annahme: Es sind die Poweruser, die ihre Typen selber definieren.
- Das &quot;Verdrahten&quot; der Such-Properties ist Teil der Typ-Definiton, und 
findet im User Interface auf der gleichen Ebene statt.
- Fazit: Wer Typen selber baut, kann auch Such-Properties verdrahten.

Alternative Konzeptionen w&#228;ren:
1) DeepaMehta macht aus allen Properties automatisch Such-Properties. 
Es w&#228;ren dann z.B. auch &quot;Passwort&quot;-Properties suchbar.
2) Anstatt die Assoziation manuell kn&#252;pfen zu m&#252;ssen, k&#246;nnte eine 
Property selbst eine &quot;is Searchable&quot;-Property haben. Diese Einstellung 
w&#252;rde dann f&#252;r _alle_ Typen wirken, die diese Property verwenden.
3) Der &quot;K&#246;nigsweg&quot;, der wahrscheinlich in der Gro&#223;zahl der F&#228;lle 
n&#252;tzlich ist: Die Such-Filter garnicht auf Property-Ebene defnieren, 
sondern dem Benutzer, a la Google, nur ein -- Property-&#252;bergreifendes 
-- Suchfeld anbieten. Die grafische DeepaMehta GUI erm&#246;glicht das 
derzeit nicht, auf API-Ebene hingegen existiert dieser Such-Call, und 
wird von einigen DeepaMehta Web-Interfaces/Anwendungen benutzt.

&gt;&gt;<i> Datenmodell: Ein Typ ist per Aggregation (rote Assoziation) mit seinem
</I>&gt;&gt;<i> Such-Typ verbunden.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Beispiel: Erweitern der Personensuche um Geschlecht-Filter:
</I>&gt;&gt;<i> 1) Decke den &quot;Person&quot;-Typ auf (Search -&gt; Type Builder -&gt; Topic Type).
</I>&gt;&gt;<i> 2) Decke vom Person-Typ aus die &quot;Gender&quot;-Property auf (What's Related
</I>&gt;&gt;<i> -&gt; Properties)
</I>&gt;&gt;<i> 3) Decke vom Person-Typ aus den zugeh&#246;rigen Such-Typ, &quot;Person Search&quot;,
</I>&gt;&gt;<i> auf (What's Related -&gt; by Association Type / Aggregations)
</I>&gt;&gt;<i> 4) Ziehe eine Assoziation vom Such-Typ zur Gender-Property und
</I>&gt;&gt;<i> typisiere diese als Composition (Retype -&gt; Composition)
</I>&gt;&gt;<i> 5) Update den Such-Typ (Update)
</I>&gt;&gt;<i> =&gt; Ab jetzt steht allen Personen-Suchen (auch die bereits 
</I>&gt;&gt;<i> vorhandenen!)
</I>&gt;&gt;<i> ein Gender-Filter zu Verf&#252;gung.
</I>&gt;<i>
</I>&gt;<i> OK, dieses Beispiel konnte ich so nachvollziehen. Ohne Hilfe w&#228;re ich
</I>&gt;<i> aber nicht so schnell darauf gekommen - obwohl ich die Dokumentation
</I>&gt;<i> gelesen habe :)
</I>
Die Dokumentation ist in der Tat nicht vollst&#228;ndig. W&#252;nschenswert w&#228;re 
auch ein &quot;Best Practice&quot;-Abschnitt mit Hinweisen zur Modellierung. Die 
Dokumentation ist fast ausschlie&#223;lich von den Anwendern erstellt. Jeder 
Anwender ist eingeladen, die Dokumentation zu verbessern.

&gt;&gt;<i> Hier sprichst Du einen wichtigen Punkt an: die 
</I>&gt;&gt;<i> Typ-Property-Dichotomie.
</I>&gt;&gt;<i> Ich m&#246;chte darauf ausf&#252;hrlich antworten, schaffe das aber im Moment
</I>&gt;&gt;<i> nicht.
</I>&gt;&gt;<i> Morgen m&#246;chte ich das nachholen.
</I>&gt;<i>
</I>&gt;<i> Ich glaube, Du brauchst mich nicht zu agitieren, was die N&#252;tzlichkeit
</I>&gt;<i> der Idee angeht. H&#228;tte ich immer gleich alle Informationen zur Hand, 
</I>&gt;<i> die
</I>&gt;<i> ich in einem bestimmten Kontext brauche, w&#228;re das sehr hilfreich. Etwas
</I>&gt;<i> skeptisch bin ich, was die Umsetzbarkeit betrifft. Und ich glaube, 
</I>&gt;<i> dass der
</I>&gt;<i> herk&#246;mmliche Stil bei allen Nachteilen auch seine Vorteile hat: Ein 
</I>&gt;<i> Ordner
</I>&gt;<i> macht seinem Namen n&#228;mlich alle Ehre indem er ordnet, d.h. die 
</I>&gt;<i> Komplexit&#228;t
</I>&gt;<i> vermindert. Ich habe zum Beispiel in einer Ausgabe so um die 20 
</I>&gt;<i> Beitr&#228;ge und
</I>&gt;<i> tausche mit jedem Autor in der Regel um die zwei Dutzend Mails aus, 
</I>&gt;<i> bis alles
</I>&gt;<i> fertig ist.  Macht wenigstens 500 Mails pro Ausgabe, die ich aber in 
</I>&gt;<i> meinem
</I>&gt;<i> Mailclient in einer Ordnerhierarchie speichere: Titel/Ausgabe/Beitrag. 
</I>&gt;<i> Auf der
</I>&gt;<i> obersten Ebene ufern mir die Eintr&#228;ge nicht aus und mit drei Klicks 
</I>&gt;<i> bin ich
</I>&gt;<i> immer im richtigen Mail-Ordner. Ich f&#228;nde es vermutlich nicht 
</I>&gt;<i> intuitiver, w&#252;rde
</I>&gt;<i> ich mit 500 grafischen Elementen konfrontiert, die kreuz und quer 
</I>&gt;<i> verbunden
</I>&gt;<i> sind. Andererseits ist schon klar: H&#228;tte ich neben den Mails auch 
</I>&gt;<i> gleich die
</I>&gt;<i> Texte der Artikelversionen und die Planvorgaben aus dem 
</I>&gt;<i> Redaktionssystem
</I>&gt;<i> und meine Korrespondenz vom letzten Mal wegen des Honorars  in einer
</I>&gt;<i> Ansicht, w&#228;re das zweifellos praktisch.
</I>&gt;<i>
</I>&gt;<i> Aber diesen Punkt lasse ich ja weitgehend aus und Du kannst mich und 
</I>&gt;<i> vor
</I>&gt;<i> allem die Leser sehr gerne in Deinem Kasten restlos &#252;berzeugen.
</I>
Vielen Dank f&#252;r das anschauliche Szenario!
Das ist eine gute Beschreibung f&#252;r den Alltag eines 
Informationsarbeiters!

Ja, im Kasten werde ich versuchen deutlich machen, warum DeepaMehta in 
einem solchen Szenario Vorteile bringt.

&gt;<i> Ich wage mich mal aus der Deckung :) und h&#228;nge hier einen allerersten
</I>&gt;<i> Entwurf des Beitrags an (HTML-formatiert). An dem bastle ich sicher 
</I>&gt;<i> noch
</I>&gt;<i> rum, aber ich denke, man kann schon sehen, wie ich mir das Ganze
</I>&gt;<i> vorstellen k&#246;nnte.
</I>&gt;<i>
</I>&gt;<i> Ich nehme jeden Hinweis dazu gerne entgegen und &#252;berlege mir, ob ich 
</I>&gt;<i> ihn
</I>&gt;<i> ber&#252;cksichtigen kann. Was ich ohne Wenn und Aber korrigiere, sind
</I>&gt;<i> eventuelle sachliche Fehler. Meine Meinung als Autor lasse ich mir 
</I>&gt;<i> nicht
</I>&gt;<i> so schnell abkaufen, was aber nicht hei&#223;t, dass ich guten Argumenten
</I>&gt;<i> nicht aufgeschlossen w&#228;re.
</I>
On 12.06.2009, at 07:46, Jens-Christoph Brendel wrote:

&gt;<i> Wenn Du den Kasten schreiben w&#252;rdest, h&#228;tte es f&#252;r mich den Charme, 
</I>&gt;<i> dass
</I>&gt;<i> wir damit so etwas wie einen O-Ton h&#228;tten. Der bringt noch einmal eine
</I>&gt;<i> eigene Authentizit&#228;t mit und eine zus&#228;tzliche Farbe ins Spiel, was dem
</I>&gt;<i> Beitrag sicher gut t&#228;te. So riesig viel Arbeit ist es auch deshalb
</I>&gt;<i> nicht, weil die Kunst darin best&#228;nde, sich auf rund 3000-3500 Zeichen 
</I>&gt;<i> zu
</I>&gt;<i> beschr&#228;nken. Allerh&#246;chstens 4500, aber das w&#228;re schon eine komplette
</I>&gt;<i> Seite und damit kein eigentlicher Kasten mehr. Der Termin steht fest:
</I>&gt;<i> Heute in vier Wochen geht der Text in die Druckerei, etwas eher muss er
</I>&gt;<i> also in der Redaktion sein.
</I>
Danke f&#252;r die Eckdaten!
Ich werde Dir meinen Text f&#252;r den Kasten in der Woche ab 6. Juli 
zukommen lassen.

Gr&#252;&#223;e
J&#246;rg

www.deepamehta.de



&gt;<i> freundliche Gr&#252;&#223;e
</I>&gt;<i>
</I>&gt;<i> Jens-Christoph
</I>&gt;<i>
</I>&gt;<i>
</I>&gt;<i> -- 
</I>&gt;<i> Jens-Christoph Brendel
</I>&gt;<i>
</I>&gt;<i> = Editor-in-Chief              Linux Technical Review =
</I>&gt;<i> Linux New Media  AG       |    Phone:  +49 89 9934 1146
</I>&gt;<i> Putzbrunner Str. 71       |    Fax:    +49 89 9934 1199
</I>&gt;<i> 81929 M&#252;nchen, Germany    |    Mobile: +49 163 356 2561
</I>&gt;<i>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">jbrendel at linuxnewmedia.de</A> - <A HREF="http://www.linuxnewmedia.de">http://www.linuxnewmedia.de</A>
</I>&gt;<i>
</I>&gt;<i> Linux New Media         Lawrence -  Malaga - Manchester
</I>&gt;<i> The Pulse of Linux      M&#252;nchen - Sao Paulo -  Warszawa
</I>&gt;<i>
</I>&gt;<i> Vorstand: Brian Osborn,    Hermann Plank
</I>&gt;<i> Aufsichtsratsvorsitzender: Rudolf Strobl
</I>&gt;<i>
</I>&gt;<i> &lt;Deepamehta-Artikel.tar.gz&gt;
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000271.html">[deepamehta-users] Mittwoch: Musik im Eschschloraque mit Spezialgast
</A></li>
	<LI>Next message: <A HREF="000273.html">[deepamehta-users] DeepaMehta Workshop Invitation,	Monday 13th of July
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#272">[ date ]</a>
              <a href="thread.html#272">[ thread ]</a>
              <a href="subject.html#272">[ subject ]</a>
              <a href="author.html#272">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
