<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] DeepaMehta: das Problem der	Typ-Property-Dichotomie
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-June/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20DeepaMehta%3A%20das%20Problem%20der%0A%09Typ-Property-Dichotomie&In-Reply-To=%3C7f02a950af3c6ba3f73ff0e1e25600cf%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000269.html">
   <LINK REL="Next"  HREF="000271.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] DeepaMehta: das Problem der	Typ-Property-Dichotomie</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20DeepaMehta%3A%20das%20Problem%20der%0A%09Typ-Property-Dichotomie&In-Reply-To=%3C7f02a950af3c6ba3f73ff0e1e25600cf%40deepamehta.de%3E"
       TITLE="[deepamehta-users] DeepaMehta: das Problem der	Typ-Property-Dichotomie">jri at deepamehta.de
       </A><BR>
    <I>Tue Jun 16 02:20:39 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000269.html">[deepamehta-users] Beitrag &#252;ber Deepamehta
</A></li>
        <LI>Next message: <A HREF="000271.html">[deepamehta-users] Mittwoch: Musik im Eschschloraque mit Spezialgast
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#270">[ date ]</a>
              <a href="thread.html#270">[ thread ]</a>
              <a href="subject.html#270">[ subject ]</a>
              <a href="author.html#270">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Lieber Jens-Christoph,

hier m&#246;chte ich endlich auf das von Dir angesprochene Thema &quot;Typ vs. 
Property&quot; eingehen.


On 11.06.2009, at 17:15, Jens-Christoph Brendel wrote:

&gt;<i> [...]
</I>&gt;<i>
</I>&gt;<i> a) intuitiv, alle Eigenschaften sind Properties
</I>&gt;<i> b) wie von Euch gezeigt: einige Eigenschaften sind ihrerseits Topics 
</I>&gt;<i> und
</I>&gt;<i> deshalb einfach suchbar
</I>&gt;<i>
</I>&gt;<i> Damit landet man dann allerdings bei dem Problem, vor dem wir zuletzt
</I>&gt;<i> standen. Property-Topics vergr&#246;&#223;ern die Menge der Elemente in der Map
</I>&gt;<i> und machen sie ab einer bestimmten Gr&#246;&#223;e un&#252;bersichtlich. Wenn man
</I>&gt;<i> dasselbe mit Eigenschaften von Topics abbildet, hat man eine 
</I>&gt;<i> zus&#228;tzliche
</I>&gt;<i> Ebene, die die Komplexit&#228;t der Map vermindert, indem sie einen Teil der
</I>&gt;<i> Details verdeckt. Optimal w&#228;re, wenn man nach dien Eigenschaften suchen
</I>&gt;<i> k&#246;nnte, ohne dass sie selbst Topics sind - jedenfalls nach meiner
</I>&gt;<i> pers&#246;nlichen Meinung.
</I>
Wie man in Properties suchen kann, habe ich in meiner letzten Mail 
beschrieben.

&gt;<i> Man muss das sicher nicht unbedingt breit treten. Aber es w&#252;rde mich
</I>&gt;<i> auch pers&#246;nlich interessieren. Auf meinem Notebook befinden sich
</I>&gt;<i> beispielsweise mehrere Hunderttausend Files. W&#228;ren das alles Topics und
</I>&gt;<i> zus&#228;tzlich auch die Dateigr&#246;&#223;e, die Zugriffsrechte, etc. dann k&#228;me ich
</I>&gt;<i> auf eine Menge, von der ich mir nicht vorstellen kann, wie man sie in
</I>&gt;<i> einer grafischen Darstellung verwalten wollte. Nicht zu reden, dass das
</I>&gt;<i> dann auch noch leichter bedienbar sein soll als meine Ordner und
</I>&gt;<i> Unterordner jetzt.
</I>&gt;<i>
</I>&gt;<i> [...]
</I>
Hier sprichst Du einen wichtigen Punkt an: die Typ-Property-Dichotomie.

Um es vorweg zu sagen: da&#223; es in DeepaMehta sowohl (typisierte) Topics 
als auch Properties gibt, ist nicht optimal und f&#252;hrt zu erheblichen 
Usability-Problemen. Der Grund, warum DeepaMehta diesen Weg gegangen 
ist, ist da&#223; damals eine einfache/pragmatische L&#246;sung f&#252;r ein komplexes 
Darstellungsproblem gefunden werden mu&#223;te: wie k&#246;nnen die 
fein-granulierten Objekte eines semantischen Informationsspeichers 
(Stra&#223;e, Hausnr, PLZ, Stadt, Geburtsort: alles sind separate Objekte) 
im User Interface zu handhabbaren, d.h. f&#252;r den Anwender n&#252;tzlichen, 
Einheiten aggregiert werden?

Die DeepaMehta-L&#246;sung ist bekannt: die linke Bildschirmh&#228;lfte zeigt 
eine Topic Map, ein Netzwerk aus typisierten Topics und Assoziationen. 
Klickt man einen Topic (oder Assoziation) an, erscheinen in der rechten 
Bildschirmh&#228;lfte die Detail-Informationen des Topics. Die 
Bildschirmdarstellung der Detail-Informationen richtet sich danach, 
welche Properties zum jeweiligen Topic-Typ definiert sind. Dies ist 
eine einfache L&#246;sung des erw&#228;hnten Darstellungsproblems.

&#220;brigens: das Konzept der Bildschirm-Zweiteilung l&#246;st ein verwandtes 
Interface-Problem: Wie kann zwischen Informations-Kontext und 
Informations-Detail gewechselt werden? In DeepaMehta wird sogar eine 
Gleichzeitigkeit erreicht: ohne Arrangieren von Fenstern sind links 
immer der Kontext sichtbar und rechts sind immer die Details sichtbar. 
Innerhalb eines Kontexts ist jedes Detail nur einen Klick entfernt. 
(Andererseits bringt diese starre 2-Teilung auch Probleme mit sich. Es 
ist z.B. nicht m&#246;glich, gleichzeitig 2 Details sichtbar zu haben, etwa 
f&#252;r einen Vergleich.)

Zur&#252;ck zur Typ-Property-Dichotomie: ein praktisches Problem ist, da&#223; 
der Anwender beim Modellieren immer abw&#228;gen mu&#223;: modelliere ich eine 
Information als Topic-Typ oder als Property? Welches sind die 
Konsequenzen?

Als Topic-Typ:
- die Infomation erscheint in der Topic Map als Knoten eines 
semantischen Netzwerks, d.h. die Information wird innerhalb ihres 
Kontexts visualisiert.
- die Information ist addressierbar, d.h. sie kann in anderen Kontexten 
wiederverwendet/visualisiert werden.

Als Property:
- die Information ist zusammen mit den anderen Detail-Informationen 
eines Topics auf einen Klick sichtbar.
- die Information ist nicht addressierbar und stellt keinen eigenen 
Knoten in einem semantischen Netzwerk dar.

Es gibt keine eindeutige Antwort darauf, ob man in DeepaMehta eine 
Information besser als Topic-Typ oder als Property modelliert. Topics 
sind First-Class Objekte, Properties eher untergeordnet. Eine Heuristik 
bzw. Daumenregel ist: je zentraler die Information innerhalb der 
Anwendungsdom&#228;ne ist, desto eher w&#252;rde man sie als Topic-Typen 
modellieren. In einer Kontaktverwaltung z.B., w&#252;rde man eine Jahreszahl 
(Geburtsjahr) eher als Property modellieren, in einer 
Geschichts-Wissensbasis hingegen wahrscheinlich als Topic-Typ.

An den oben beschriebenen Eigenschaften von Topic-Typen und Properties 
wird ein Designproblem, bzw. ein Designfehler, sichtbar: Datenmodell 
und Bildschirmdarstellung sind miteinander verwoben! Daher ist der 
Anwender gezwungen ein Kompromi&#223; zu finden, zwischen
a) Feingranularer semantischer Modellierung, und
b) Handhabbaren Interface-Objekten.

Viele DeepaMehta-Anwender beklagen sich z.B. &#252;ber folgende Situation: 
sie klicken eine Person an, und wollen auf einen Blick alle relevanten 
Angaben zu dieser Person sehen (Email-Adresse, Telefonnr., ...). In 
DeepaMehta m&#252;ssen sie dazu erst, m&#252;hsam mit vielen Klicks, alle 
assoziierten Topics aufdecken. Daher benutzen viele Anwender die 
mitgelieferten Topic-Typen (Email Address, Webpage, Phone Number, ...) 
garnicht und definieren stattdessen entsprechende Properties zum 
Topic-Typ &quot;Person&quot; hinzu. Der Gewinn: alle Person-Informationen auf 
einen Blick. Der Verlust: die Features die an die mitgelieferten Typen 
gekoppelt sind, z.B. Emails schreiben, Webseiten aufrufen.

Fazit: So w&#252;rde ich das nicht nochmal designen. Aber wie hei&#223;t es so 
sch&#246;n: Umwege vergr&#246;&#223;ern die Ortskenntnis :-)

Zukunftsperspektive: In DeepaMehta 3 wird es keine 
Typ-Property-Dichotomie mehr geben. Alles sind Typen. Die Darstellung 
ist vollkommen getrennt vom Datenmodell. Das Problem der handhabbaren 
Interface-Objekte wird durch eine weitere Schicht gel&#246;st: &quot;View 
Prescriptions&quot; sind Regeln, die beschreiben, wie aus einem 
Topic-Aggregat eine Detail-Darstellung erzeugt wird (&#228;hnlich dem 
MIT-Projekt &quot;Haystack&quot;).

Gr&#252;&#223;e
J&#246;rg Richter

www.deepamehta.de


&gt;<i> -- 
</I>&gt;<i> Jens-Christoph Brendel
</I>&gt;<i>
</I>&gt;<i> = Editor-in-Chief              Linux Technical Review =
</I>&gt;<i> Linux New Media  AG       |    Phone:  +49 89 9934 1146
</I>&gt;<i> Putzbrunner Str. 71       |    Fax:    +49 89 9934 1199
</I>&gt;<i> 81929 M&#252;nchen, Germany    |    Mobile: +49 163 356 2561
</I>&gt;<i>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">jbrendel at linuxnewmedia.de</A> - <A HREF="http://www.linuxnewmedia.de">http://www.linuxnewmedia.de</A>
</I>&gt;<i>
</I>&gt;<i> Linux New Media         Lawrence -  Malaga - Manchester
</I>&gt;<i> The Pulse of Linux      M&#252;nchen - Sao Paulo -  Warszawa
</I>&gt;<i>
</I>&gt;<i> Vorstand: Brian Osborn,    Hermann Plank
</I>&gt;<i> Aufsichtsratsvorsitzender: Rudolf Strobl
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000269.html">[deepamehta-users] Beitrag &#252;ber Deepamehta
</A></li>
	<LI>Next message: <A HREF="000271.html">[deepamehta-users] Mittwoch: Musik im Eschschloraque mit Spezialgast
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#270">[ date ]</a>
              <a href="thread.html#270">[ thread ]</a>
              <a href="subject.html#270">[ subject ]</a>
              <a href="author.html#270">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
