<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-June/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%0A%20%3D%3Fiso-8859-1%3Fq%3FKommender_Beitrag_%3DFCber_Deepam%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Fehta_im_Linux_Magazin%3F%3D&In-Reply-To=%3C774fd3295819df18e375bdbd51bb157d%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000265.html">
   <LINK REL="Next"  HREF="000267.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%0A%20%3D%3Fiso-8859-1%3Fq%3FKommender_Beitrag_%3DFCber_Deepam%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Fehta_im_Linux_Magazin%3F%3D&In-Reply-To=%3C774fd3295819df18e375bdbd51bb157d%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin">jri at deepamehta.de
       </A><BR>
    <I>Fri Jun 12 02:33:34 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000265.html">[deepamehta-users] Tagung NMI 2009 Neue Medien der	Informationsgesellschaft in der Akademie der Wissenschaften	Berlin - www.nmi-berlin.de - Das Programm
</A></li>
        <LI>Next message: <A HREF="000267.html">[deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#266">[ date ]</a>
              <a href="thread.html#266">[ thread ]</a>
              <a href="subject.html#266">[ subject ]</a>
              <a href="author.html#266">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Lieber Jens-Christoph,

vielen Dank f&#252;r Deine Mail!
Ich freue mich, da&#223; Du den Faden wieder aufnimmst!

Auch von meiner Seite bitte ich erstmal um Entschuldigung, da&#223; wir den  
Artikel bisher nicht richtig unterst&#252;tzt haben. Ich kann auch f&#252;r meine  
Mitstreiter sprechen, wenn ich sage, da&#223; es nicht an Interesse mangelt.

Zun&#228;chst eine Orientierungsfrage: wird der Artikel im Linux Technical  
Review erscheinen (und nicht im regul&#228;ren Linux Magazin)?

Deine Planung finde ich im Prinzip gut.
Hier m&#246;chte ich gerne auf Deine Fragen eingehen.


On 11.06.2009, at 13:29, Jens-Christoph Brendel wrote:

&gt;<i> Hallo J&#246;rg, hallo Martin,
</I>&gt;<i>
</I>&gt;<i> nachdem die Sache mit dem geplanten Beitrag nicht so recht von der
</I>&gt;<i> Stelle kommt - nach meiner letzten Mail vom 21. April ist die
</I>&gt;<i> Kommunikation scheinbar eingeschlafen - ist es veilleicht Zeit f&#252;r  
</I>&gt;<i> einen
</I>&gt;<i> Plan B. Ich kann einen Beitrag schreiben, der sich ein wenig mit Topic
</I>&gt;<i> Maps als solchen befasst und dann Deepamehta als beispielhaften Editor
</I>&gt;<i> daf&#252;r beschreibt. Das bisher erarbeitete Beispiel reicht daf&#252;r auch. Es
</I>&gt;<i> zeigt dann allerdings nicht, was man unter Ausnutzung aller
</I>&gt;<i> M&#246;glichkeiten vielleicht erreichen k&#246;nnte, sondern nur, was man als
</I>&gt;<i> Einsteiger ad hoc erreichen kann. Aber das ist ja auch eine legitime
</I>&gt;<i> Perspektive.
</I>
Wir sehen DeepaMehta nicht als Topic Map Editor, sondern als &quot;Semantic  
Desktop&quot; oder &quot;Plattform f&#252;r Kollaboration und Wissensmanagement&quot;.

In &quot;Semantic Desktop&quot; spiegelt sich die Vision einer auf semantischen  
Netzwerken basierenden integrierten Arbeitsumgebung wir  
Wissensarbeiter.

In &quot;Plattform f&#252;r ...&quot; kommt zum Ausdruck, da&#223; DeepaMehta nicht nur  
Werkzeug ist, sondern eine Infrastruktur zu Entwicklung und Integration  
von Werkzeugen.

Das Verbindende an DeepaMehta und Topic Maps ist das Konzept der  
semantischen Netzwerke. Zum Verh&#228;ltnis DeepaMehta / Topic Maps siehe  
auch meine n&#228;chste Antwort.

&gt;<i> Wenn ihr wollt, k&#246;nnt ihr einen Textkasten beisteuern &#252;ber die Vision
</I>&gt;<i> eines anderen Benutzerinterfaces f&#252;r Computer auf der Grundlage von
</I>&gt;<i> Topic Maps. Wenn ihr das knackig und plastisch darstellen k&#246;nnt und
</I>&gt;<i> vielleicht sogar einen Screenshot o.&#228;. dazu habt, dann w&#228;re das ein
</I>&gt;<i> abgrenzbarer Aspekt, den man gut in einem Kasten verkaufen kann. Da das
</I>&gt;<i> kein heute verf&#252;gbares Produkt ist, w&#228;re es auch ok, wenn es von seinen
</I>&gt;<i> Sch&#246;pfern beschrieben wird, was wir sonst nicht machen.
</I>&gt;<i>
</I>&gt;<i> F&#252;r den restlichen Beitrag w&#252;rden mich noch ein paar kleine Fragen
</I>&gt;<i> interessieren, die sich sicher schnell beantworten lassen:
</I>&gt;<i>
</I>&gt;<i> 1.) Deepamehta und Standards. Nach meinem Eindruck implementiert
</I>&gt;<i> Deepamehta nicht alle Features von ISO/IEC 13250, auch wenn das ein
</I>&gt;<i> Exportformat ist. Ist Kompatibilit&#228;t hier prinzipiell nicht oder
</I>&gt;<i> nur partiell geplant oder ist das nur noch nicht implementiert?
</I>
Stimmt, DeepaMehta ist keine komplette Umsetzung des Topic Maps  
Standard. Auf der anderen Seite enth&#228;lt DeepaMehta propriet&#228;re  
Erweiterungen -- im Wesentlichen die Properties -- mit dem Hintergrund,  
die (ISO-)Topic Maps Welt mit der (W3C-)RDF Welt zu verschmelzen. Topic  
Maps spannen ein semantisches Netzwerk _oberhalb_ des Dateisystems auf,  
deren Knoten Verweise (Occurrences) auf herk&#246;mmliche (unstrukturierte)  
Dateien enthalten. Mit RDF und DeepaMehta hingegen k&#246;nnen feiner  
granulierte Informatiosstrukturen repr&#228;sentiert werden, die nicht an  
konkrete Medien gekoppelt sind. Diese lassen sich auch algorithmisch  
verarbeiten, und bei Bedarf z.B. in eine Datei transformieren.

Im Kern des DeepaMehta-Datenmodell stehen also nicht Topic Maps allein,  
sondern eine Verschmelzung aus Topic Maps und RDF. Daher sollte sich,  
meiner Meinung nach, der Artikel nicht speziell an Topic Maps  
aufh&#228;ngen, sondern an semantischen Netzwerken im Allgemeinen. In der  
Semantic Web Forschung gibt es eine Reihe von Topic  
Maps-RDF-Integrations-Ans&#228;tzen, ein &#220;berblick findet sich hier:  
www.w3.org/TR/rdftm-survey/

DeepaMehta setzt nicht auf Topic Maps allein, weil DeepaMehta weg  
m&#246;chte von Dateien als first-class Objekten. Denn: viele Informationen,  
die den Alltag eines Wissensarbeiters ausmachen -- Emails, Webseiten,  
Chats, Suchanfragen, Kontakte -- liegen garnicht in Dateiform vor! Die  
Folge ist, da&#223; unsere auf der Desktop-Metapher (Ordner, 1 Datei = 1  
Blatt Papier) basierende Benutzerschnittstelle um diese  
Informationsobjekte separate Applikationswelten drumherumbauen mu&#223;, die  
eine unnat&#252;rliche Fragmentierung der Arbeitsumgebung zur Folge hat.

Zu Deiner Frage: DeepaMehta wird wahrscheinlich den Topic Maps Standard  
niemals komplett und 1:1 unterst&#252;tzen.

Details zum DeepaMehta-Datenmodell, z.B. welche Konzepte des Topic  
Maps-Standard in DeepaMehta eher durch RDF-Konzepte realisiert sind,  
finden sich im Abschnitt &quot;Data Model&quot; meiner  
Fraunhofer-Ver&#246;ffentlichung &quot;DeepaMehta -- Another Computer is  
Possible&quot;:
<A HREF="http://www.deepamehta.de/swe-book/deepamehta-another-computer-is-">http://www.deepamehta.de/swe-book/deepamehta-another-computer-is-</A> 
possible-20070810.pdf

&gt;<i> 2.) Es existieren ja bereits eine Reihe freier (und auch kommerzieller)
</I>&gt;<i> Topic Map Engines wie etwa TM4J und &#228;hnliche Projekte f&#252;r Perl, PHP,
</I>&gt;<i> etc. Wie sieht sich Deepamehta im Verh&#228;ltnis zu diesen Projekten?
</I>
Neben einer Topic Map Engine ist DeepaMehta:

- eine Benutzerschnittstelle f&#252;r Wissensarbeiter.
Informationen, die zu einem Arbeitskontext geh&#246;ren, werden --  
unabh&#228;ngig ihres Formats oder ihrer Herkunft -- in _einem_ Fenster  
dargestellt _und_ bearbeitet. Topics sind z.B. Emails, Webseiten,  
Kontakte, Notizen. Weitere Typen lassen sich interaktiv (graphisch)  
definieren. Auch Suchanfragen sind Topics.

- ein Framework f&#252;r Anwendungsentwicklung.
Topics sind nicht nur Datentr&#228;ger, sondern bieten auch Verhalten, und  
eine Benutzerschnittstelle. Jedem Topictyp kann eine Java-Klasse  
hinterlegt werden, die das Verhalten von Topics dieses Typs  
implementiert. Eine DeepaMehta-Anwendung ist eine Sammlung von Typen,  
und kann separat vertrieben / installiert werden. Vorhandene Typen  
lassen sich zu neuen Anwendungen aggregieren. Alle Anwendungen teilen  
sich _ein_ Fenster.

- eine Integrationsplattform.
Das Anwendungsframework enth&#228;lt das Konzept der Datenquelle. Topics  
k&#246;nnen Inhalte repr&#228;sentieren, die in anderen Systemen existieren, z.B.  
in Datenbanken, LDAP-Servern, oder Webservices. Assoziationen setzen  
Inhalte miteinander in Bezug, auch &#252;ber Systemgrenzen hinaus.

&gt;<i> 3.) Was sind die Ziele f&#252;r die n&#228;chste Zeit, was kann ich als
</I>&gt;<i> Anwender/Interessent in &#252;berschaubarer Zukunft von Deepamehta Neues
</I>&gt;<i> erwarten?
</I>
Unser Communitymitglied Malte Rei&#223;ig hat eine Vielzahl von  
DeepaMehta-Anwendungen und Basis-Erweiterungen entwickelt:

- Twitter Client:
jeder Tweet ein Topic. Visualisierung von Follower-Netzwerken.

- PDF Viewer:
droppe eine PDF-Datei in eine Topic Map, ein PDF-Topic entsteht. Der  
PDF-Inhalt wird direkt im DeepaMehta-Fenster angezeigt.

- Webbrowser:
ein Webpage-Topic repr&#228;sentiert eine Website, die direkt im  
DeepaMehta-Fenster angezeigt wird. Das Anklicken von Links erzeugt neue  
Webpage-Topics. Beim Surfen entsteht so ein visuelles Netzwerk  
verlinkter Webseiten.

- LaTeX Renderer:
Ein LaTeX-Topic enth&#228;lt LaTeX-Quelltext. Das Compile-Kommando erzeugt  
ein LaTeX-Rendering direkt in der Topic Map.

- Flash-Frontend:
DeepaMehta-Inhalte werden per fl&#252;ssigem Flash-Frontend navigierbar.  
Audio-, Video-Inhalte sind integriert. (Bisher nur propriet&#228;re  
Anwendung f&#252;r ein Uni-Projekt: Zoo-Informationssystem)

- JSON-RPC Service
DeepaMehta-Inhalte k&#246;nnen von anderen Anwendungen &#252;ber JSON-RPC  
abgerufen werden. (Bisher nur f&#252;r propriet&#228;re Anwendung &quot;Kiezatlas&quot;,  
ein geografisches CMS).

- Importer
Aus CSV-Dateien werden automatisch Topics erzeugt.

Alle diese Anwendungen haben Proof-of-Concept Status und sind noch  
nicht Teil des Haupt-Entwicklungsstrangs, geschweigedenn Teil einer  
Release. Maltes Ziel ist, die Anwendungen allgmemein verf&#252;gbar zu  
machen. Im Moment ist er mit seiner Diplomarbeit besch&#228;ftigt.

&gt;<i> Vielleicht erstmal soviel. M&#246;glicherweise ergibt sich noch eine
</I>&gt;<i> Nachfrage. Mein pragmatischer Vorschlag w&#228;re, so zu starten. Ich  
</I>&gt;<i> beginne
</I>&gt;<i> mir mal einen Artikel zu &#252;berlegen, ihr beantwortet die Fragen und
</I>&gt;<i> steuert vielleicht den Kasten bei. Am Ende k&#246;nnt ihr auch vorher lesen,
</I>&gt;<i> was rausgekommen ist und wir k&#246;nnten gegebenenfalls sachliche Fehler
</I>&gt;<i> bereinigen. So w&#228;re keine weitere Programmiererei n&#246;tig, was vielleicht
</I>&gt;<i> noch mehr Zeit kosten w&#252;rde. Wie sehr ihr das?
</I>
F&#252;r weitere Fragen stehe ich gerne zur Verf&#252;gung.

Was den &quot;Vision&quot;-Kasten betrifft: da m&#252;ssen wir sehen, wie sich der  
Artikel herausbildet, damit der Kasten dann dazu passt. Vieles der  
DeepaMehta-Vision habe ich hier und in meinen 2 wissenschaftlichen  
Artikeln (www.deepamehta.de / Documentation / Published Articles)  
beschrieben. M&#246;glicherweise kannst Du, Jens-Christoph, damit bereits  
den Kasten bestreiten. M&#246;glicherweise kann auch ich den Kasten  
schreiben, das w&#228;re eine sch&#246;ne Herausforderung f&#252;r mich (die nat&#252;rlich  
viel Widmung/Zeit ben&#246;tigt) und eine sch&#246;ne Chance f&#252;r DeepaMehta.

Auf Deine 2. Mail (&quot;Properties&quot;) werde ich morgen antworten.

Jens-Christoph, ich freue mich &#252;ber unser Vorhaben.

Gr&#252;&#223;e
J&#246;rg Richter

www.deepamehta.de



&gt;<i> freundliche Gr&#252;&#223;e
</I>&gt;<i>
</I>&gt;<i> Jens-Christoph
</I>&gt;<i>
</I>&gt;<i>
</I>&gt;<i>
</I>&gt;<i> -- 
</I>&gt;<i> Jens-Christoph Brendel
</I>&gt;<i>
</I>&gt;<i> = Editor-in-Chief              Linux Technical Review =
</I>&gt;<i> Linux New Media  AG       |    Phone:  +49 89 9934 1146
</I>&gt;<i> Putzbrunner Str. 71       |    Fax:    +49 89 9934 1199
</I>&gt;<i> 81929 M&#252;nchen, Germany    |    Mobile: +49 163 356 2561
</I>&gt;<i>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">jbrendel at linuxnewmedia.de</A> - <A HREF="http://www.linuxnewmedia.de">http://www.linuxnewmedia.de</A>
</I>&gt;<i>
</I>&gt;<i> Linux New Media         Lawrence -  Malaga - Manchester
</I>&gt;<i> The Pulse of Linux      M&#252;nchen - Sao Paulo -  Warszawa
</I>&gt;<i>
</I>&gt;<i> Vorstand: Brian Osborn,    Hermann Plank
</I>&gt;<i> Aufsichtsratsvorsitzender: Rudolf Strobl
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000265.html">[deepamehta-users] Tagung NMI 2009 Neue Medien der	Informationsgesellschaft in der Akademie der Wissenschaften	Berlin - www.nmi-berlin.de - Das Programm
</A></li>
	<LI>Next message: <A HREF="000267.html">[deepamehta-users] Kommender Beitrag &#252;ber Deepamehta im Linux Magazin
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#266">[ date ]</a>
              <a href="thread.html#266">[ thread ]</a>
              <a href="subject.html#266">[ subject ]</a>
              <a href="author.html#266">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
