<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Beitrag &#252;ber Deepamehta
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-June/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%3D%3Fiso-8859-1%3Fq%3FBeitrag_%3DFCber_Deepamehta%3F%3D&In-Reply-To=%3Cdfe4188398fe0250909d4ff1f5f43010%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000268.html">
   <LINK REL="Next"  HREF="000270.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Beitrag &#252;ber Deepamehta</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%3D%3Fiso-8859-1%3Fq%3FBeitrag_%3DFCber_Deepamehta%3F%3D&In-Reply-To=%3Cdfe4188398fe0250909d4ff1f5f43010%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Beitrag &#252;ber Deepamehta">jri at deepamehta.de
       </A><BR>
    <I>Sun Jun 14 22:50:56 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000268.html">[deepamehta-users] Kommender Beitrag &#252;ber  Deepamehta im Linux Magazin
</A></li>
        <LI>Next message: <A HREF="000270.html">[deepamehta-users] DeepaMehta: das Problem der	Typ-Property-Dichotomie
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#269">[ date ]</a>
              <a href="thread.html#269">[ thread ]</a>
              <a href="subject.html#269">[ subject ]</a>
              <a href="author.html#269">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Lieber Jens-Christoph,

danke f&#252;r Deine Mail!
Dein geradliniges Vorgehen und Deine konkrete Planung sind hilfreich 
f&#252;r uns.

Hier m&#246;chte ich auf die Thematik der Properties in DeepaMehta eingehen.


On 11.06.2009, at 17:15, Jens-Christoph Brendel wrote:

&gt;<i> Hallo Martin, hallo J&#246;rg
</I>&gt;<i>
</I>&gt;<i> bis jetzt haben wir ja keinen Termin verpasst. Nun haben wir den 
</I>&gt;<i> Beitrag
</I>&gt;<i> aber f&#252;r die &#252;bern&#228;chste Ausgabe (09/09) vorgesehen und werden ihn in
</I>&gt;<i> 08/09 wahrscheinlich vorschauen. Das setzt uns dann schon ein wenig 
</I>&gt;<i> mehr
</I>&gt;<i> unter Zugzwang :).
</I>&gt;<i>
</I>&gt;<i> Ich denke, es w&#228;re nicht entscheidend, dass wir eine umfangreiche Map
</I>&gt;<i> oder ein langes Listing drucken k&#246;nnen. Das W&#228;re m&#246;glich, wenn es sich
</I>&gt;<i> anbietet, andererseits kann man auf vier, f&#252;nf Magazinseiten sowieso
</I>&gt;<i> nicht alles bis ins Letzte erkl&#228;ren. F&#252;r die erreichbare Tiefe scheint
</I>&gt;<i> mir auch so ausreichend Material verf&#252;gbar. Wir h&#228;tten dann eine Map in
</I>&gt;<i> Gestalt dieser Themenkarte f&#252;r das LTR. Wir k&#246;nnten zeigen, wie man
</I>&gt;<i> einen Topic-Typ anlegt und zwar
</I>&gt;<i>
</I>&gt;<i> a) intuitiv, alle Eigenschaften sind Properties
</I>&gt;<i> b) wie von Euch gezeigt: einige Eigenschaften sind ihrerseits Topics 
</I>&gt;<i> und
</I>&gt;<i> deshalb einfach suchbar
</I>&gt;<i>
</I>&gt;<i> Damit landet man dann allerdings bei dem Problem, vor dem wir zuletzt
</I>&gt;<i> standen. Property-Topics vergr&#246;&#223;ern die Menge der Elemente in der Map
</I>&gt;<i> und machen sie ab einer bestimmten Gr&#246;&#223;e un&#252;bersichtlich. Wenn man
</I>&gt;<i> dasselbe mit Eigenschaften von Topics abbildet, hat man eine 
</I>&gt;<i> zus&#228;tzliche
</I>&gt;<i> Ebene, die die Komplexit&#228;t der Map vermindert, indem sie einen Teil der
</I>&gt;<i> Details verdeckt. Optimal w&#228;re, wenn man nach dien Eigenschaften suchen
</I>&gt;<i> k&#246;nnte, ohne dass sie selbst Topics sind - jedenfalls nach meiner
</I>&gt;<i> pers&#246;nlichen Meinung.
</I>
Zun&#228;chst: man kann nach Properties suchen!

Zu jedem Topic-Typ erzeugt DeepaMehta automatisch einen individuellen 
Such-(Topic-)Typ, um nach Topics suchen zu k&#246;nnen. Es sind die 
Suchtonnen, die von diesem Such-Typ sind. Suchen (im Interface: Tonnen) 
sind also typisierte Topics, und haben ihrerseits Properties. Die 
Properties der Such-Typen dienen als Eingabefelder f&#252;r Suchbegriffe. 
Standardm&#228;&#223;ig hat jeder Such-Typ nur eine &quot;Name&quot;-Property. Diese 
erm&#246;glicht die Suche anhand des Topic-Namens.
=&gt; Der (Power-)Anwender kann zu einem Such-Typ weitere Properties 
hinzuf&#252;gen, um z.B. Personen anhand ihres Geschlechts (eine Property) 
zu suchen.

Datenmodell: Ein Typ ist per Aggregation (rote Assoziation) mit seinem 
Such-Typ verbunden.

Beispiel: Erweitern der Personensuche um Geschlecht-Filter:
1) Decke den &quot;Person&quot;-Typ auf (Search -&gt; Type Builder -&gt; Topic Type).
2) Decke vom Person-Typ aus die &quot;Gender&quot;-Property auf (What's Related 
-&gt; Properties)
3) Decke vom Person-Typ aus den zugeh&#246;rigen Such-Typ, &quot;Person Search&quot;, 
auf (What's Related -&gt; by Association Type / Aggregations)
4) Ziehe eine Assoziation vom Such-Typ zur Gender-Property und 
typisiere diese als Composition (Retype -&gt; Composition)
5) Update den Such-Typ (Update)
=&gt; Ab jetzt steht allen Personen-Suchen (auch die bereits vorhandenen!) 
ein Gender-Filter zu Verf&#252;gung.

Hinweis: wie generell bei Properties kann auch bei den Such-Typen die 
Reihenfolge der Properties (wie sie im Interface erscheinen) definiert 
werden. Wenn z.B. im Interface der Gender-Filter _nach_ dem 
Personen-Filter angezeigt werden soll, gebe der Composition (die in 
Schritt 4 erzeugt wurde) eine Ordinal Number von &quot;110&quot; und Update den 
Typ &quot;Person Search&quot; erneut (der standardm&#228;&#223;ige Name-Filter hat eine 
Ordinal Number von 100).

Bei dieser Gelenheit noch ein Hinweis zu den Suchtonnen: Vom Konzept 
her entspricht eine Suchtonne einem &quot;Smart Folder&quot;, d.h. einer 
Suchanfrage + der Ergebnismenge. In DeepaMehta setzt sich die 
Suchanfrage zusammen aus:
- Typ-Filter
- Topicname-Filter
- Property-Filter
- Assoziations-Filter
Um die einer Suchtonne zugrundeliegenden Suchanfrage erneut zu triggern 
und die Ergebnismenge zu aktualisieren, doppelklicke die Suchtonne.

&gt;<i> Man muss das sicher nicht unbedingt breit treten. Aber es w&#252;rde mich
</I>&gt;<i> auch pers&#246;nlich interessieren. Auf meinem Notebook befinden sich
</I>&gt;<i> beispielsweise mehrere Hunderttausend Files. W&#228;ren das alles Topics und
</I>&gt;<i> zus&#228;tzlich auch die Dateigr&#246;&#223;e, die Zugriffsrechte, etc. dann k&#228;me ich
</I>&gt;<i> auf eine Menge, von der ich mir nicht vorstellen kann, wie man sie in
</I>&gt;<i> einer grafischen Darstellung verwalten wollte. Nicht zu reden, dass das
</I>&gt;<i> dann auch noch leichter bedienbar sein soll als meine Ordner und
</I>&gt;<i> Unterordner jetzt.
</I>
Hier sprichst Du einen wichtigen Punkt an: die Typ-Property-Dichotomie.
Ich m&#246;chte darauf ausf&#252;hrlich antworten, schaffe das aber im Moment 
nicht.
Morgen m&#246;chte ich das nachholen.
Und dann auch auf Deine n&#228;chste Mail eingehen (&quot;weg von den Dateien&quot;).
Zum Textkasten: ich &#252;bernehme das! Ich werde den Textkasten schreiben.

Vielen Dank f&#252;r Deine Impulse!

Gr&#252;&#223;e
J&#246;rg Richter

www.deepamehta.de


&gt;<i> Aber um konkret weiterzukommen w&#252;rde ich vorschlagen: Ihr liefert die
</I>&gt;<i> Antworten und den Kasten, lasst mich schreiben und dann diskutieren wir
</I>&gt;<i> nochmal, wenn ich ein vorzeigbares Ergebnis habe, was man vielleicht
</I>&gt;<i> daran besser machen k&#246;nnte.
</I>&gt;<i>
</I>&gt;<i> beste Gr&#252;&#223;e
</I>&gt;<i>
</I>&gt;<i> Jens-Christoph
</I>&gt;<i> -- 
</I>&gt;<i> Jens-Christoph Brendel
</I>&gt;<i>
</I>&gt;<i> = Editor-in-Chief              Linux Technical Review =
</I>&gt;<i> Linux New Media  AG       |    Phone:  +49 89 9934 1146
</I>&gt;<i> Putzbrunner Str. 71       |    Fax:    +49 89 9934 1199
</I>&gt;<i> 81929 M&#252;nchen, Germany    |    Mobile: +49 163 356 2561
</I>&gt;<i>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">jbrendel at linuxnewmedia.de</A> - <A HREF="http://www.linuxnewmedia.de">http://www.linuxnewmedia.de</A>
</I>&gt;<i>
</I>&gt;<i> Linux New Media         Lawrence -  Malaga - Manchester
</I>&gt;<i> The Pulse of Linux      M&#252;nchen - Sao Paulo -  Warszawa
</I>&gt;<i>
</I>&gt;<i> Vorstand: Brian Osborn,    Hermann Plank
</I>&gt;<i> Aufsichtsratsvorsitzender: Rudolf Strobl
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000268.html">[deepamehta-users] Kommender Beitrag &#252;ber  Deepamehta im Linux Magazin
</A></li>
	<LI>Next message: <A HREF="000270.html">[deepamehta-users] DeepaMehta: das Problem der	Typ-Property-Dichotomie
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#269">[ date ]</a>
              <a href="thread.html#269">[ thread ]</a>
              <a href="subject.html#269">[ subject ]</a>
              <a href="author.html#269">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
