<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Donate via PayPal
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2008-September/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Donate%20via%20PayPal&In-Reply-To=%3C48C011D0.9090905%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000205.html">
   <LINK REL="Next"  HREF="000207.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Donate via PayPal</H1>
    <B>Malte Rei&#223;ig</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Donate%20via%20PayPal&In-Reply-To=%3C48C011D0.9090905%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Donate via PayPal">mre at deepamehta.de
       </A><BR>
    <I>Thu Sep  4 18:50:24 CEST 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000205.html">[deepamehta-users] Donate via PayPal
</A></li>
        <LI>Next message: <A HREF="000207.html">[deepamehta-users] HTML Kodierung von Zeilenumbr&#252;chen im Description Feld
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#206">[ date ]</a>
              <a href="thread.html#206">[ thread ]</a>
              <a href="subject.html#206">[ subject ]</a>
              <a href="author.html#206">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo zusammen!

Es f&#228;llt mir schwer momentan in kurzen S&#228;tzen das zu kommunizieren was
wichtig ist, deshalb bleibts bei einem gro&#223;en Dankesch&#246;n an Urs und J&#246;rg
und an alle die daran mitgearbeitet haben, das Ihr mich hier in eurem
Entwurf ber&#252;cksichtigt! Wirklich, vielen Dank! Das macht Mut.

Ich will noch kurz sagen, das ich an alle die dies lesen appelliere sich
nochmal einen Ruck zu geben uns auf den letzten Metern zu helfen, genau
das zu nach au&#223;en zu kommunizieren was wir in den letzten xx Monaten
geschafft haben. Die Entwickler haben viel gute Arbeit geleistet um
DeepaMehta f&#252;r noch mehr Anwender interessant und besser nutzbar zu
machen (Anstehende Release). Die Dokumentationen sind &#252;berarbeitet
worden (Wiki) und so vollst&#228;ndig wie noch nie. Es sind transparente und
offene Kommunikationskan&#228;le weiterhin gepflegt worden, keine Anfrage
blieb ungeh&#246;rt (Lists, Forum und Englischer Blog). Die
Einf&#252;hrungsveranstaltungen sind weiterhin angeboten und auch gut
angenommen worden. Es wurde viel vor Ort, hier in Berlin und auch aus
Heidelberg und der Schweiz &#252;ber die aktuellen Schw&#228;chen und St&#228;rken des
Entwicklungsstandes und der Kommunikation nach au&#223;en debattiert und
anaylisiert. Dabei sind auch wichtige Impulse von den aktuell aktivsten
DeepaMehta Abenteurern angesto&#223;en worden die jetzt noch auf die
Vollendung warten (z.B. Screencasts und Tutorials). Vor allem J&#246;rg aber
auch Marc und Benedikt haben in teilweise n&#228;chtelanger Kleinstarbeit
alles in Bewegung gesetzt damit die Infrastruktur nach dem
Hardware-Ausfall wieder steht!

Wir wissen wo wir stehen und wir wissen wohin wir wollen! Bitte helft
uns dabei dies alles nach au&#223;en  kommunizieren zu k&#246;nnen nur zusammen
k&#246;nnen wir das schaffen. Der F&#246;rderverein ist meiner Ansicht nach noch
ein entscheidender Schritt um dem DeepaMehta Projekt ein neues Gewand zu
geben. Eine Einladung zum n&#228;chstm&#246;glichen Treffen am 16.9.2008 im
newthinking store schicke ich noch an alle raus.

Geld oder Power, spendet was Ihr k&#246;nnt!
Hoffentlich bis bald!
Euer Malte

PS. Jetzt wollte ich gerade mit meinem Bankier einen Kredit aushandeln
und'nen riesen-fetten Batzen der DeepaMehta Vision zukommen lassen, da
funzt doch glatt der neue Donate-Button nicht! J&#246;rg, Urs? K&#246;nnt Ihr da
was machen?




Urs Lerch schrieb:
&gt;<i> Liebe DeepaMehta-Freunde,
</I>&gt;<i>
</I>&gt;<i> wenn ihr die Homepage deepamehta.de besucht k&#246;nnt ihr seit Anfang Woche
</I>&gt;<i> einen &quot;Donate&quot;-Knopf finden. Wie viele andere Open-Source-Projekte
</I>&gt;<i> wollen wir auf diesem Weg versuchen, kurzfristig etwas finanzielle
</I>&gt;<i> Unterst&#252;tzung f&#252;r Infrastrukur, Communityarbeit und Weiterentwicklung
</I>&gt;<i> der Software zu gewinnen. Und wie ja bereits in fr&#252;heren Postings
</I>&gt;<i> gemeldet, haben wir auch die Absicht einen F&#246;rderverein zu gr&#252;nden, um
</I>&gt;<i> eine langfristige Sicherstellung des Projekts gew&#228;hrleisten zu k&#246;nnen.
</I>&gt;<i>
</I>&gt;<i> Ganz im Sinne der in Open-Source-Projekten &#252;blichen Transparenz wollen
</I>&gt;<i> wir in diesem Zusammenhang folgende Dinge klarstellen:
</I>&gt;<i>
</I>&gt;<i> 1. Das &#252;ber den &quot;Donate&quot;-Knopf gespendete Geld wird momentan von Paypal
</I>&gt;<i>    auf das Privatkonto von J&#246;rg Richter &#252;berwiesen. Sobald ein Verein
</I>&gt;<i>    gegr&#252;ndet ist werden Spenden auf das Vereinskonto &#252;berwiesen.
</I>&gt;<i>
</I>&gt;<i> 2. Ich selbst habe zus&#228;tzlich Zugang auf das Paypal-Konto und kann somit
</I>&gt;<i>    jederzeit Auskunft geben, wieviel Geld bisher gespendet wurde. Selbst
</I>&gt;<i>    habe ich jedoch keinerlei Zugriff auf das gesponserte Geld. Falls
</I>&gt;<i>    gew&#252;nscht k&#246;nnte auch noch eine dritte Person direkte Einsicht
</I>&gt;<i>    erhalten.
</I>&gt;<i>
</I>&gt;<i> 3. J&#246;rg Richter m&#246;chte sich m&#246;glichst weitgehend dem Open-Source-Projekt
</I>&gt;<i>    widmen und dieses weiter vorantreiben. Um ihm dies zu erm&#246;glichen
</I>&gt;<i>    soll ihm die H&#228;lfte des gespendeten Geldes zukommen, jedoch nicht
</I>&gt;<i>    mehr als &#8364; 500 pro Monat. An diesen Lohn sind keine konkreten
</I>&gt;<i>    Aufgaben gebunden. Es soll vielmehr als Dank f&#252;r seine bisher
</I>&gt;<i>    geleistete Arbeit sowie als Vertrauensbeweis f&#252;r sein Engagement
</I>&gt;<i>    verstanden werden.
</I>&gt;<i>
</I>&gt;<i> 4. Malte Reissig hat sich bisher mit sehr viel Herzblut f&#252;r Deepamehta
</I>&gt;<i>    eingesetzt, insbesondere in der Communityarbeit. Um ihm dies sowie
</I>&gt;<i>    Marketingarbeiten zu erm&#246;glichen, soll ihm ein Viertel des
</I>&gt;<i>    gespendeten Geldes, jedoch maximal &#8364; 250 pro Monat direkt zu kommen.
</I>&gt;<i>    Malte kann &#252;ber dieses Geld frei verf&#252;gen, auch als Lohn. Dies ist
</I>&gt;<i>    auch als Vertrauensbeweis f&#252;r sein Engagement zu verstehen.
</I>&gt;<i>
</I>&gt;<i> 5. Der Rest des gespendeten Geldes, jedoch mindestens ein Viertel, soll
</I>&gt;<i>    f&#252;r die Gr&#252;ndung des F&#246;rdervereins zur Verf&#252;gung stehen. Ein
</I>&gt;<i>    allf&#228;lliger &#220;berschuss geht in den noch zu gr&#252;ndenden Verein &#252;ber.
</I>&gt;<i>    Sollte innerhalb eines Jahres kein Verein zustande kommen, wird &#252;ber
</I>&gt;<i>    diese Mailingliste &#252;ber die weitere Verwendung abgestimmt.
</I>&gt;<i>
</I>&gt;<i> 6. Ich bin kein Jurist ;)
</I>&gt;<i>
</I>&gt;<i> Wir hoffen nun nat&#252;rlich, dass m&#246;glichst viele Spender gewonnen werden
</I>&gt;<i> k&#246;nnen, um der Vision DeepaMehta zum Durchbruch zu verhelfen.
</I>&gt;<i>
</I>&gt;<i> Gruss,
</I>&gt;<i> Urs
</I>&gt;<i>
</I>&gt;<i>
</I>&gt;<i> P.S.: Wie immer sind Kommentare erw&#252;nscht. Das Ganze ist auch nicht in
</I>&gt;<i> Stein gemeisselt. Wir m&#252;ssen auch erst mal Erfahrungen machen und sehen,
</I>&gt;<i> ob und wieviel Spenden effektiv reinkommen.
</I>&gt;<i>
</I>&gt;<i>
</I>&gt;<i> _______________________________________________
</I>&gt;<i> deepamehta-users mailing list
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">deepamehta-users at lists.berlios.de</A>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">https://lists.berlios.de/mailman/listinfo/deepamehta-users</A>
</I>&gt;<i>   
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000205.html">[deepamehta-users] Donate via PayPal
</A></li>
	<LI>Next message: <A HREF="000207.html">[deepamehta-users] HTML Kodierung von Zeilenumbr&#252;chen im Description Feld
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#206">[ date ]</a>
              <a href="thread.html#206">[ thread ]</a>
              <a href="subject.html#206">[ subject ]</a>
              <a href="author.html#206">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
