<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Donate via PayPal
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2008-September/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Donate%20via%20PayPal&In-Reply-To=%3C1220477955.7245.4.camel%40ursX61s%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000204.html">
   <LINK REL="Next"  HREF="000206.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Donate via PayPal</H1>
    <B>Urs Lerch</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Donate%20via%20PayPal&In-Reply-To=%3C1220477955.7245.4.camel%40ursX61s%3E"
       TITLE="[deepamehta-users] Donate via PayPal">mail at ulerch.net
       </A><BR>
    <I>Wed Sep  3 23:39:15 CEST 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000204.html">[deepamehta-users] Wegen Spam: Wiki nur noch f&#252;r registrierte Nutzer beschreibbar
</A></li>
        <LI>Next message: <A HREF="000206.html">[deepamehta-users] Donate via PayPal
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#205">[ date ]</a>
              <a href="thread.html#205">[ thread ]</a>
              <a href="subject.html#205">[ subject ]</a>
              <a href="author.html#205">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Liebe DeepaMehta-Freunde,

wenn ihr die Homepage deepamehta.de besucht k&#246;nnt ihr seit Anfang Woche
einen &quot;Donate&quot;-Knopf finden. Wie viele andere Open-Source-Projekte
wollen wir auf diesem Weg versuchen, kurzfristig etwas finanzielle
Unterst&#252;tzung f&#252;r Infrastrukur, Communityarbeit und Weiterentwicklung
der Software zu gewinnen. Und wie ja bereits in fr&#252;heren Postings
gemeldet, haben wir auch die Absicht einen F&#246;rderverein zu gr&#252;nden, um
eine langfristige Sicherstellung des Projekts gew&#228;hrleisten zu k&#246;nnen.

Ganz im Sinne der in Open-Source-Projekten &#252;blichen Transparenz wollen
wir in diesem Zusammenhang folgende Dinge klarstellen:

1. Das &#252;ber den &quot;Donate&quot;-Knopf gespendete Geld wird momentan von Paypal
   auf das Privatkonto von J&#246;rg Richter &#252;berwiesen. Sobald ein Verein
   gegr&#252;ndet ist werden Spenden auf das Vereinskonto &#252;berwiesen.

2. Ich selbst habe zus&#228;tzlich Zugang auf das Paypal-Konto und kann somit
   jederzeit Auskunft geben, wieviel Geld bisher gespendet wurde. Selbst
   habe ich jedoch keinerlei Zugriff auf das gesponserte Geld. Falls
   gew&#252;nscht k&#246;nnte auch noch eine dritte Person direkte Einsicht
   erhalten.

3. J&#246;rg Richter m&#246;chte sich m&#246;glichst weitgehend dem Open-Source-Projekt
   widmen und dieses weiter vorantreiben. Um ihm dies zu erm&#246;glichen
   soll ihm die H&#228;lfte des gespendeten Geldes zukommen, jedoch nicht
   mehr als &#8364; 500 pro Monat. An diesen Lohn sind keine konkreten
   Aufgaben gebunden. Es soll vielmehr als Dank f&#252;r seine bisher
   geleistete Arbeit sowie als Vertrauensbeweis f&#252;r sein Engagement
   verstanden werden.

4. Malte Reissig hat sich bisher mit sehr viel Herzblut f&#252;r Deepamehta
   eingesetzt, insbesondere in der Communityarbeit. Um ihm dies sowie
   Marketingarbeiten zu erm&#246;glichen, soll ihm ein Viertel des
   gespendeten Geldes, jedoch maximal &#8364; 250 pro Monat direkt zu kommen.
   Malte kann &#252;ber dieses Geld frei verf&#252;gen, auch als Lohn. Dies ist
   auch als Vertrauensbeweis f&#252;r sein Engagement zu verstehen.

5. Der Rest des gespendeten Geldes, jedoch mindestens ein Viertel, soll
   f&#252;r die Gr&#252;ndung des F&#246;rdervereins zur Verf&#252;gung stehen. Ein
   allf&#228;lliger &#220;berschuss geht in den noch zu gr&#252;ndenden Verein &#252;ber.
   Sollte innerhalb eines Jahres kein Verein zustande kommen, wird &#252;ber
   diese Mailingliste &#252;ber die weitere Verwendung abgestimmt.

6. Ich bin kein Jurist ;)

Wir hoffen nun nat&#252;rlich, dass m&#246;glichst viele Spender gewonnen werden
k&#246;nnen, um der Vision DeepaMehta zum Durchbruch zu verhelfen.

Gruss,
Urs


P.S.: Wie immer sind Kommentare erw&#252;nscht. Das Ganze ist auch nicht in
Stein gemeisselt. Wir m&#252;ssen auch erst mal Erfahrungen machen und sehen,
ob und wieviel Spenden effektiv reinkommen.



</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000204.html">[deepamehta-users] Wegen Spam: Wiki nur noch f&#252;r registrierte Nutzer beschreibbar
</A></li>
	<LI>Next message: <A HREF="000206.html">[deepamehta-users] Donate via PayPal
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#205">[ date ]</a>
              <a href="thread.html#205">[ thread ]</a>
              <a href="subject.html#205">[ subject ]</a>
              <a href="author.html#205">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
