<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Vortrag &quot;Human Centric Software&quot; an der Uni	Potsdam, 3. November 2010
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2010-November/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Vortrag%20%22Human%20Centric%20Software%22%20an%20der%20Uni%0A%09Potsdam%2C%203.%20November%202010&In-Reply-To=%3CE9511FD9-5CF9-46CA-95D4-2ED28D9E1A62%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   
   <LINK REL="Next"  HREF="000330.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Vortrag &quot;Human Centric Software&quot; an der Uni	Potsdam, 3. November 2010</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Vortrag%20%22Human%20Centric%20Software%22%20an%20der%20Uni%0A%09Potsdam%2C%203.%20November%202010&In-Reply-To=%3CE9511FD9-5CF9-46CA-95D4-2ED28D9E1A62%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Vortrag &quot;Human Centric Software&quot; an der Uni	Potsdam, 3. November 2010">jri at deepamehta.de
       </A><BR>
    <I>Mon Nov  1 16:11:08 CET 2010</I>
    <P><UL>
        
        <LI>Next message: <A HREF="000330.html">[deepamehta-users] Make interactive DeepaMehta topicmaps accessible	to everyone
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#329">[ date ]</a>
              <a href="thread.html#329">[ thread ]</a>
              <a href="subject.html#329">[ subject ]</a>
              <a href="author.html#329">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Einladung zur Ringvorlesung n_space WS 2010/2011 der Informatik der Uni Potsdam &quot;Medienproduktion im Wandel&quot; (&#246;ffentlich und kostenlos) -
Weitere Termine immer mittwochs, bis 2. Februar 2011, 16:00 s.t., immer im Raum 3.06 H.01, Hauptgeb&#228;ude Campus Griebnitzsee.
Vorlesung, zu der Sie und Ihre Freunde herzlich eingeladen sind, Mittwoch, 3. November 2010, 16:00-17:30, H&#246;rsaal 01 im Geb&#228;ude 3.06, Campus Griebnitzsee:
Prof. Dr. Stefan J&#228;hnichen, Technische Universit&#228;t Berlin, Informatik, Direktor Fraunhofer Institut f&#252;r Rechnerarchitektur und Softwaretechnik FIRST, Pr&#228;sident der Gesellschaft f&#252;r Informatik
Steigerung von Produktivit&#228;t und Qualit&#228;t: &#8222;Human Centric Software&#8220; und &#8222;Embedded Systems.
Historisch gesehen, bemisst sich die Evolution der Informatik und der Rechentechnologien an Fortschritten in der Hardwareentwicklung. Steigende Speicherkapazit&#228;ten und zunehmende Rechnergeschwindigkeiten spiegeln technologische Entwicklungen in den Informationswissenschaften wider. Seit &#252;ber vierzig Jahren zeigt sich aber, dass Hauptantriebskraft unserer Industriebranchen die Software und die Technologie f&#252;r deren schnelle, zuverl&#228;ssige und kosteneffektive Entwicklung ist. Hauptaugenmerk galt der Herstellung von Software als Produkt, sowohl in ihrer Entwicklung als auch in ihrer Anpassung an wechselnde Anforderungen sowie in ihrer Nutzung und weiteren Wartung.
Der Vortrag beschreibt den Weg von der Erfindung von effizienten Algorithmen und den Bem&#252;hungen um die Strukturierung and Abstraktion von Entwicklungsprozessen bis hin zur Vision von Software als Basis zur Entwicklung hochverteilter und stark dezentraler Systeme, die auch autonomes Verhalten realisieren. Zu den zuk&#252;nftigen Herausforderungen geh&#246;rt die Entwicklung von Ensembles, die aus einer sehr gro&#223;en Anzahl von Knoten mit komplexen Interaktionen und einer variablen Netzwerktopologie bestehen. Sie arbeiten in offenen und oft nichtdeterministischen Umgebungen. M&#246;gliche Beispiele f&#252;r solche Ensembles sind Systeme zur Umgebungsassistenz, Schw&#228;rme von Nanostrukturen, Roboter oder auch globale virtuelle Unternehmen.

 
Cv
Dr.-Ing. in Elektrotechnik von der Technischen Universit&#228;t Berlin 1974. Seit 1991 Professor f&#252;r das Fachgebiet Softwaretechnik an der Fakult&#228;t f&#252;r Informatik und Elektrotechnik der TU Berlin und Institutsleiter beim Fraunhofer Institut FIRST (fr&#252;her GMD FIRST). Pr&#228;sident der Gesellschaft f&#252;r Informatik.
Stefan J&#228;hnichen zeichnet sich durch langj&#228;hrige Expertise auf dem Gebiet der Softwaretechnik, der Programmiersprachen und des Compilerbaus aus. Im Rahmen zahlreicher Kooperationen und Gremien beteiligt er sich national wie international an Forschungskooperationen, bspw. im Rahmen der IFIP Working Group 2.4 (System Programming Languages), der deutsch-lateinamerikanischen Technologiekooperation (Brasilien, Argentinien, Chile und Mexico) oder dem DFG-Fachkollegium f&#252;r Informatik. Stefan J&#228;hnichen ist Autor mehrerer B&#252;cher und verfasste in seiner Karriere mehr als 50 begutachtete wissenschaftliche Publikationen in Konferenzb&#228;nden und Journalen. Dar&#252;ber hinaus betreute er in seiner bisherigen Laufbahn ca. 63 Promotionen und 5 Habilitationen pers&#246;nlich und 26 Promotionen sowie 3 Habilitationen als Zweitgutachter. Forschungsaufenthalte hatte er an der University of Southern California, Los Angeles, am International Computer Science Institute, Berkeley und am Centre d&#180;&#201;tudes et de Recherches (CERT), Toulouse. Er war Organisator und/oder Leiter gro&#223;er Konferenzen wie der ICSE 96, Berlin, der ETAPS 2000 und der ECOOP 2007 in Berlin und ist Mitglied in zahlreichen Forschungs- und Wissenschaftsorganisationen (Details siehe <A HREF="http://swt.cs.tu-berlin.de/jaehn/">http://swt.cs.tu-berlin.de/jaehn/</A>).
Veranstaltungsort: Hauptgeb&#228;ude der Uni Potsdam am Standort Griebnitzsee 3.06, Raum H&#246;rsaal 01, Erdgeschooss rechts.  
Direkt am S-Bahnhof Griebnitzsee, Ausgang &#8222;Universit&#228;t&#8220;. 
Prof. Dr. Helmert Stra&#223;e, 14482 Potsdam Babelsberg
Bus: 694 ab Potsdam Hauptbahnhof oder mit dem Auto: Gesamtplan &#8211; oder mit der
Regionalbahn / S-Bahn:S-Bahn S1 (alle 10 Minuten), Bahnhof Griebnitzsee, Ausgang Universit&#228;t (1 Station nach/vor Wannsee)
Regionalbahn RB 21 (Griebnitzsee - Wustermark)

-------------- next part --------------
An HTML attachment was scrubbed...
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/deepamehta-users/attachments/20101101/e4bc3585/attachment.html">https://lists.berlios.de/pipermail/deepamehta-users/attachments/20101101/e4bc3585/attachment.html</A>&gt;
-------------- next part --------------
A non-text attachment was scrubbed...
Name: image001.jpg
Type: image/jpeg
Size: 4745 bytes
Desc: not available
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/deepamehta-users/attachments/20101101/e4bc3585/attachment.jpg">https://lists.berlios.de/pipermail/deepamehta-users/attachments/20101101/e4bc3585/attachment.jpg</A>&gt;
</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	
	<LI>Next message: <A HREF="000330.html">[deepamehta-users] Make interactive DeepaMehta topicmaps accessible	to everyone
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#329">[ date ]</a>
              <a href="thread.html#329">[ thread ]</a>
              <a href="subject.html#329">[ subject ]</a>
              <a href="author.html#329">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
