<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] [deepamehta3] Warum alleine am Kern arbeiten?
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-October/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%5Bdeepamehta3%5D%20Warum%20alleine%20am%20Kern%20arbeiten%3F&In-Reply-To=%3C4ACBA67A.2010401%40annette-leeb.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000298.html">
   <LINK REL="Next"  HREF="000300.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] [deepamehta3] Warum alleine am Kern arbeiten?</H1>
    <B>Annette Leeb</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%5Bdeepamehta3%5D%20Warum%20alleine%20am%20Kern%20arbeiten%3F&In-Reply-To=%3C4ACBA67A.2010401%40annette-leeb.de%3E"
       TITLE="[deepamehta-users] [deepamehta3] Warum alleine am Kern arbeiten?">office at annette-leeb.de
       </A><BR>
    <I>Tue Oct  6 22:20:10 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000298.html">[deepamehta-users] DeepaMehta 3 ist gestartet!
</A></li>
        <LI>Next message: <A HREF="000300.html">[deepamehta-users] Planung des n&#228;chsten Community Treffens
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#299">[ date ]</a>
              <a href="thread.html#299">[ thread ]</a>
              <a href="subject.html#299">[ subject ]</a>
              <a href="author.html#299">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Lieber J&#246;rg,
lieber Urs &amp; all,

grade eben blicke ich mit den mailinglists nicht mehr durch, ich habe 
die devel/users-lists mit drauf gesetzt; hoffe, das ist ok.

@Urs, finde auch, eine einheitliche Liste w&#228;re nicht schlecht; wenn das 
&#252;ber die google group laufen soll/kann, meinetwegen; k&#246;nnen wir 
vielleicht bei einem n&#228;chsten Treffen kl&#228;ren.

@jri, was waren denn Deine Gr&#252;nde daf&#252;r, die Gruppe anzulegen?

@Urs, ich habe die erste Mail von J&#246;rg vom 04.10. nicht so gelesen, dass 
J&#246;rg jahrelang an DM3 alleine arbeiten will. Vielleicht &#252;berlappen sich 
Erfahrungen aus fr&#252;heren DM-Zeiten mit den aktuellen in Deiner Lesart? 
Mir scheint, dass es grade so gedacht und gewollt ist, fr&#252;h (&quot;in einigen 
Monaten&quot;), an manchen Ansatzpunkten bereits jetzt Andockm&#246;glichkeiten 
f&#252;r Entwickler und Anwender zu schaffen: Die Dokumentation der 
Schnittstellen als Voraussetzung f&#252;r die Entwicklung von Plugins 
erstellen, Plugin-Vorschl&#228;ge erarbeiten, Erfahrungen mit der 
Installation sammeln und an die Entwickler zur&#252;ck speisen, sich mit den 
Basistechnologien vertraut machen usw.

jri hat mir einen ersten Einblick in seine GitHub-Aktivit&#228;ten vor 
einigen Wochen gegeben. Er hat mir bei einem Problem geholfen, und 
anschlie&#223;end die T&#252;r zu seinem virtuellen Arbeitszimmer ge&#246;ffnet. Nun 
bin ich, wie alle wissen, keine Entwicklerin. Was ich mitbekommen habe, 
war, wie intensiv jri an DM3 arbeitet, dass er daf&#252;r &quot;moderne&quot; Tools und 
eine von ihm neu erkundete Entwicklungsumgebung nutzt (wobei er auch 
erz&#228;hlt hat, dass der Tipp GitHub schon vor langem von Enrico an ihn 
heran getragen wurde), und dass meiner Meinung nach alle Energie in 
diese Richtung gehen wird. Das war &#252;berdeutlich zu sp&#252;ren. Vielleicht 
keine qualifizierte &#196;usserung aus technologischer Perspektive, aus der 
meines Jobs und meiner DM-Erfahrung aber umso mehr.

Warum ich das so ausf&#252;hrlich schreibe: Eigentlich hatten jri und ich 
besprochen, dass ich ein Meeting organisiere, wo er uns von seinen 
Aktivit&#228;ten, dem Stand der Dinge usw. erz&#228;hlt. Als Ausgangspunkt, um 
genau das zu vermeiden, was Du, Urs angesprochen hast, jahrelanges 
isoliertes Arbeiten &quot;unterm Teppich&quot;. Ich muss zugeben, dass ich dem 
nicht nachgekommen bin. Z.T. habe ich zuviel eigene Baustellen am 
Laufen, z.T. f&#252;hlte ich mich &#252;berfordert, eine aussagekr&#228;ftige 
Einladung, Tops, Zielsetzung f&#252;r ein Treffen usw. zu formulieren. 
Wahrscheinlich h&#228;tte ich es einfach angehen sollen, z.B. im Wiki einen 
Entwurf platzieren. Habe ich nicht, sorry. Umso mehr - ein Treffen steht 
an. Ich bin sehr daran interessiert, besser zu verstehen, was jri 
bislang gemacht hat, was seine technologischen Konzepte sind, wie und 
womit er arbeitet, wie Zusammenarbeit an welchen Stellen funktionieren 
kann, welche Aufgaben anstehen, welche langfristigen Perspektiven sich 
abzeichnen usw. Die Infos, die mir fachlich gefehlt haben, hat jri in 
seinen Mails beigesteuert. Meiner Meinung nach eine ideale 
Ausgangsposition, um im pers&#246;nlichen Austausch zu einem gemeinsamen 
Verst&#228;ndnis zu kommen. Was haltet Ihr davon?

Besten Gru&#223;, A.



&gt;<i>
</I>&gt;<i> On 05.10.2009, at 11:15, Urs wrote:
</I>&gt;<i>
</I>&gt;&gt;<i> Hallo J&#246;rg,
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> kannst du bitte ein Statement dazu abgeben, warum du die ersten paar
</I>&gt;&gt;<i> Jahre alleine am Kern von DeepaMehta3 arbeiten willst und von
</I>&gt;&gt;<i> vorneherein alle anderen ausschliesst? Ich finde diese Haltung, um es
</I>&gt;&gt;<i> ganz direkt zu sagen, sehr elit&#228;r.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Danke + Gruss,
</I>&gt;&gt;<i> Urs
</I>&gt;<i>
</I>&gt;<i>
</I>&gt;<i> Lieber Urs,
</I>&gt;<i>
</I>&gt;<i> vielen Dank f&#252;r Deine Frage!
</I>&gt;<i>
</I>&gt;<i> Offen gesagt, sp&#252;re ich in mir ein Proze&#223; widerstreitender Geister, 
</I>&gt;<i> der mitten in Bewegung ist.
</I>&gt;<i>
</I>&gt;<i> Einerseits:
</I>&gt;<i> Ein Projekt ist am Anfang immer die Idee eines Einzelnen. Da will 
</I>&gt;<i> etwas unbedingt heraus, und dann f&#228;ngt derjenige einfach an. Er 
</I>&gt;<i> braucht daf&#252;r keine Legitimation und keine Diskussion. Dieser Anteil 
</I>&gt;<i> entspricht einer K&#252;nstler-Natur.
</I>&gt;<i> Doug Engelbart oder Linus Torwalds haben lange Zeit alleine 
</I>&gt;<i> gearbeitet, um etwas zu erschaffen, an das andere andocken k&#246;nnen.
</I>&gt;<i> Wenn jemand Jahre lang mit gr&#246;&#223;ter Widmung ein bestimmtes Thema 
</I>&gt;<i> bearbeitet, dann ist er an Unterst&#252;tzern interessiert, in denen ein 
</I>&gt;<i> &#228;hnliches Feuer brennt, und er wird sich m&#246;glicherweise gegen 
</I>&gt;<i> Querschl&#228;ger und Schnellschie&#223;er eher abschirmen.
</I>&gt;<i> Elite ist kein Schimpfwort. Apache, Firefox, KDE, Zope, Ruby, Drupal, 
</I>&gt;<i> BSD, Linux und viele weitere ... all diese Projekte repr&#228;sentieren 
</I>&gt;<i> eine Elite.
</I>&gt;<i>
</I>&gt;<i> Andererseits:
</I>&gt;<i> Wenn ein Projekt hinaus in die Welt, eine eigene Dynamik entwickeln 
</I>&gt;<i> soll, wie ein Lebewesen, Unterst&#252;tzer anziehen, eine Community 
</I>&gt;<i> aufbauen will, dann mu&#223; es eine Kultur der Offenheit und Andockbarkeit 
</I>&gt;<i> geben. Diese Dynamik entsteht, wenn jeder sich seinen Interessen und 
</I>&gt;<i> F&#228;higkeiten nach einbringen kann, und das Gef&#252;hl hat, da&#223; dieses 
</I>&gt;<i> Engagement wertgesch&#228;tzt wird und auf fruchtbaren Boden f&#228;llt.
</I>&gt;<i> Daf&#252;r mu&#223; der Projekt-Initiator loslassen k&#246;nnen, andere Personen 
</I>&gt;<i> Ideen und Ansichten reinlassen, sein Kontrollbed&#252;rfnis verringern und 
</I>&gt;<i> die positive Erfahrung machen, da&#223; sich auch bei steigendem 
</I>&gt;<i> Chaos-Anteil Werte schaffen lassen.
</I>&gt;<i>
</I>&gt;<i> Urs, ganz offen gesagt:
</I>&gt;<i> Ich habe die Balance zwischen K&#252;nstler-Trieb, 
</I>&gt;<i> Engineering-Satisfaction, und Sozialer Offenheit noch nicht gefunden. 
</I>&gt;<i> Der Eigenbr&#246;dler ist da genauso vorhanden wie die Sehnsucht nach 
</I>&gt;<i> Gemeinschaft.
</I>&gt;<i>
</I>&gt;<i> Um diese beiden Seiten zu vereinen visiere ich derzeit den 
</I>&gt;<i> beschriebenen &quot;Kern einerseits, Module/Plugins andererseits&quot; Weg an. 
</I>&gt;<i> Das ist auch beim Linux-Kern nicht anders. (Dennoch: was die Social 
</I>&gt;<i> Skills und das Organisationstalent betrifft, habe ich gro&#223;en Respekt 
</I>&gt;<i> vor Linus Torwalds).
</I>&gt;<i>
</I>&gt;<i> Was sich bei mir aber wahrscheinlich nie &#228;ndern wird:
</I>&gt;<i> Ich bin an Ergebnissen interessiert. An der Erreichung von Zielen. 
</I>&gt;<i> Eine DeepaMehta 3 Anwendung zu entwickeln, ein Modul oder ein Plugin, 
</I>&gt;<i> mit einem klaren Nutzen, das kann ein Ziel Sein. Dann erst macht die 
</I>&gt;<i> Diskussion um die Vorgehensweise Sinn. Eine Diskussion mu&#223; sich meiner 
</I>&gt;<i> Meinung nach inhaltlich darum drehen: Das Ziel, die Konzeption, die 
</I>&gt;<i> notwendigen Realisierungsschritte, die Roadmap. Wenn dieses Ziel da 
</I>&gt;<i> ist und die Widmung eines Individuums, sich best&#228;ndig diesem Ziel zu 
</I>&gt;<i> n&#228;hren, wenn diese intensive inhaltliche Diskussion bereits 
</I>&gt;<i> stattgefunden hat, dann halte ich jede Vorgehensweise f&#252;r m&#246;glich. Ob 
</I>&gt;<i> derjenige sich dann mit dem Kernentwickler &#252;ber n&#246;tige Erweiterungen 
</I>&gt;<i> abstimmt oder ob er die Erg&#228;nzungen selber durchf&#252;hrt, macht dann kaum 
</I>&gt;<i> noch einen Unterschied.
</I>&gt;<i>
</I>&gt;<i> Gr&#252;&#223;e
</I>&gt;<i> J&#246;rg
</I>&gt;<i>
</I>&gt;<i> www.deepamehta.de
</I>&gt;<i>
</I>&gt;<i>
</I>


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000298.html">[deepamehta-users] DeepaMehta 3 ist gestartet!
</A></li>
	<LI>Next message: <A HREF="000300.html">[deepamehta-users] Planung des n&#228;chsten Community Treffens
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#299">[ date ]</a>
              <a href="thread.html#299">[ thread ]</a>
              <a href="subject.html#299">[ subject ]</a>
              <a href="author.html#299">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
