<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Slideshow Link / Privacy
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2009-September/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Slideshow%20Link%20/%20Privacy&In-Reply-To=%3Ca2cd910bf90c40db2df89febaebb0c41%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   
   <LINK REL="Next"  HREF="000292.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Slideshow Link / Privacy</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20Slideshow%20Link%20/%20Privacy&In-Reply-To=%3Ca2cd910bf90c40db2df89febaebb0c41%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Slideshow Link / Privacy">jri at deepamehta.de
       </A><BR>
    <I>Tue Sep  1 16:14:43 CEST 2009</I>
    <P><UL>
        
        <LI>Next message: <A HREF="000292.html">[deepamehta-users] Mittwoch im Eschschloraque
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#291">[ date ]</a>
              <a href="thread.html#291">[ thread ]</a>
              <a href="subject.html#291">[ subject ]</a>
              <a href="author.html#291">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Liebe Annette,

vielen Dank f&#252;r Deine Slideshare-Aktivit&#228;t!
Das ist gut.

Zur Privacy:
meiner Meinung nach bietet die Kick-Off-Slideshow keinen Anla&#223; zu 
Bedenken, da die Namen zu den Portraitfotos sind nicht dabei. Und auch 
wenn sie es w&#228;ren, kann ich mir nicht vorstellen, warum das f&#252;r die 
Beteiligten nachteilig sein k&#246;nnte, auch f&#252;r sp&#228;ter nicht. Das 
Engagement in einem Open Source Projekt ist nichts wof&#252;r man sich 
verstecken mu&#223;. Im Gegenteil: Open Source steht f&#252;r gemeinn&#252;tziges 
Engagement und lebt von Transparenz und Offenheit = Andockbarkeit. 
Diesen Weg geht auch DeepaMehta. Aus diesem Grund gibt es auch die 
About-Us Seite www.deepamehta.de/docs/humans.html
auf der neben Namen und Portraitfoto sogar die Email-Adressen im 
Klartext ver&#246;ffentlicht (s.u.) sind.

Meiner Meinung nach soll die Kick-Off Slideshow entweder so 
ver&#246;ffentlicht bleiben wie sie jetzt ist oder ganz entfernt werden. Die 
beiden Slides mit den Gesichtern waren ein zentraler Inhalt des 
Treffens.

DeepaMehtas Email-Adressen-Policy:
Manche Leute vermeiden es, ihre Email-Adresse im Web zu 
ver&#246;ffentlichen, bzw. verschleiern sie irgendwie, um es den 
Adress-Sammel-Robots der Spam-Mafia zu erschweren sie zu erkennen. Mein 
Standpunkt: Ich halte von dieser Verdeckung/Verschleierung nichts. Die 
Verschleierung kann es Normal-Usern erschweren, die richtige 
Email-Adresse zu entziffern. Email und das Internet sind zum 
Kommunizieren da! Es kann nie v&#246;llig verhindert werden, da&#223; 
Email-Adressen doch ins Netz gelangen. Es ist nur eine Frage der Zeit 
bis die Spam-Robots den n&#228;chsten Verschleierungstrick gelernt haben. 
Ich pers&#246;nlich beteilige mich nicht an dieser &quot;Wettr&#252;stung&quot;, die 
letztendlich nur Resourcen verschwendet.
W&#252;rde ich in der realen Welt meinen Briefkasten abbauen um 
Wurfsendungen aus dem Weg zu gehen? zum Preis, da&#223; ich f&#252;r 
Au&#223;enstehende nicht auffindbar/kontaktierbar bin? Da nehme ich lieber 
die t&#228;glichen 2 Minuten f&#252;r den M&#252;lltonnengang in Kauf (+ 2 Minuten 
Spam-Ordner l&#246;schen).

Meiner Meinung nach kann auch das Google-Docs Dokument zum 
Kick-Off-Treffen, das auch die Teilnehmerliste + Emailadressen enth&#228;lt, 
ver&#246;ffentlicht bleiben.

Gr&#252;&#223;e
J&#246;rg



On 01.09.2009, at 05:40, Annette Leeb wrote:

&gt;<i> Lieber J&#246;rg,
</I>&gt;<i>
</I>&gt;<i> schau' bitte mal rein
</I>&gt;<i> <A HREF="http://www.slideshare.net/Antragon/deepa-mehta-3-kick-off">http://www.slideshare.net/Antragon/deepa-mehta-3-kick-off</A>
</I>&gt;<i>
</I>&gt;<i> Ist nicht ohne, mir war gar nicht mehr klar, dass da jede Menge 
</I>&gt;<i> Echt-Fotos drinnen sind. Wie damit umgehen? W&#252;rde die beiden Slides 
</I>&gt;<i> raus nehmen, glaube ich. Tags und Beschreibung kann ich &#228;ndern, wenn 
</I>&gt;<i> Du meinst.
</I>&gt;<i>
</I>&gt;<i> Was mit der .key-Datei passiert, kann ich Dir noch nicht sagen: Sie 
</I>&gt;<i> war nach 5 Std. immer noch Work in Progress, wurde konvertiert; keine 
</I>&gt;<i> Fehlermeldung, ich sch&#228;tze, einfach zu gro&#223;.
</I>&gt;<i>
</I>&gt;<i> Zum Download Reducing the Semantic Distance .pdf-Slides: 
</I>&gt;<i> Fehlermeldung: Datei ist besch&#228;digt, kann nicht repariert werden.
</I>&gt;<i>
</I>&gt;<i> Zum Download der .mov-Datei: Auf YouTube: Ebenfalls nach 5 Std. upload 
</I>&gt;<i> abgebrochen.
</I>&gt;<i>
</I>&gt;<i> *Hier noch M&#246;glichkeiten auf Slide Share f&#252;r sp&#228;ter:
</I>&gt;<i> *
</I>&gt;<i>
</I>&gt;<i> *What's a Slidecast?*
</I>&gt;<i>
</I>&gt;<i> A Slidecast is a format for viewing presentation slides synchronized 
</I>&gt;<i> with an audio (mp3) file. It can be used for conference talks, musical 
</I>&gt;<i> slideshows, webinars, teaching lessons, etc. You can host your mp3 
</I>&gt;<i> file on SlideShare, or use a previously uploaded mp3 URL as well.
</I>&gt;<i>
</I>&gt;<i> *Insert YouTube Videos inside your SlideShare presentation (Muss ich 
</I>&gt;<i> ausprobieren, kann ich mir nicht wirklich vorstellen, wo das dann 
</I>&gt;<i> eingespielt wird; wahrscheinlich zwischen zwei Slides?)*
</I>&gt;<i> Copy and paste the video URL from YouTube, choose where to insert the 
</I>&gt;<i> video, and press &#8220;Insert &amp; Publish&#8221;. The video will now play in your 
</I>&gt;<i> slideshow.
</I>&gt;<i>
</I>&gt;<i> Besten Gru&#223;, A.
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	
	<LI>Next message: <A HREF="000292.html">[deepamehta-users] Mittwoch im Eschschloraque
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#291">[ date ]</a>
              <a href="thread.html#291">[ thread ]</a>
              <a href="subject.html#291">[ subject ]</a>
              <a href="author.html#291">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
