<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-users] Mittwoch: Vortrag von Prof. Dr. Frieder Nake: &quot;Zwischen probabilistischer Theorie und pr&#228;zisen Vergn&#252;gen - Zur fr&#252;hen Computerkunst in Deutschland mit Ausblick aufs Jetzt&quot;
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-users/2010-July/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%3D%3Fiso-8859-1%3Fq%3FMittwoch%3D3A_Vortrag_von_Prof%3D2E%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3F_Dr%3D2E_Frieder_Nake%3D3A_%3D22Zwischen_probabilistischer_Theor%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Fie_und_pr%3DE4zisen_Vergn%3DFCgen_-_Zur_fr%3DFChen_Computerkunst%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3F_in_Deutschland_mit_Ausblick_aufs_Jetzt%3D22%3F%3D&In-Reply-To=%3C6D0EA161-E192-46AD-80E3-C8FF6CAB53E2%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   
   
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-users] Mittwoch: Vortrag von Prof. Dr. Frieder Nake: &quot;Zwischen probabilistischer Theorie und pr&#228;zisen Vergn&#252;gen - Zur fr&#252;hen Computerkunst in Deutschland mit Ausblick aufs Jetzt&quot;</H1>
    <B>J&#246;rg Richter</B> 
    <A HREF="mailto:deepamehta-users%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-users%5D%20%3D%3Fiso-8859-1%3Fq%3FMittwoch%3D3A_Vortrag_von_Prof%3D2E%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3F_Dr%3D2E_Frieder_Nake%3D3A_%3D22Zwischen_probabilistischer_Theor%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3Fie_und_pr%3DE4zisen_Vergn%3DFCgen_-_Zur_fr%3DFChen_Computerkunst%3F%3D%0A%20%3D%3Fiso-8859-1%3Fq%3F_in_Deutschland_mit_Ausblick_aufs_Jetzt%3D22%3F%3D&In-Reply-To=%3C6D0EA161-E192-46AD-80E3-C8FF6CAB53E2%40deepamehta.de%3E"
       TITLE="[deepamehta-users] Mittwoch: Vortrag von Prof. Dr. Frieder Nake: &quot;Zwischen probabilistischer Theorie und pr&#228;zisen Vergn&#252;gen - Zur fr&#252;hen Computerkunst in Deutschland mit Ausblick aufs Jetzt&quot;">jri at deepamehta.de
       </A><BR>
    <I>Mon Jul  5 00:54:01 CEST 2010</I>
    <P><UL>
        
        
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#326">[ date ]</a>
              <a href="thread.html#326">[ thread ]</a>
              <a href="subject.html#326">[ subject ]</a>
              <a href="author.html#326">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Prof. Dr. Frieder Nake, Bremen, in der 11. Ringvorlesung 2010 n_space &quot;Medienkonsum im Wandel&quot; des Instituts f&#252;r Informatik der Uni Potsdam am Mittwoch, 7. Juli 2010, um 16:00-17:00, diesmal in der Berlin-Brandenburgischen Akademie der Wissenschaften, Markgrafenstra&#223;e 38, 10117 Berlin Mitte, Leibniz-Saal, &#246;ffentlich, kostenlos

Prof. Dr. Frieder Nake, Universit&#228;t Bremen und Hochschule der K&#252;nste, Bremen

   

Zwischen probabilistischer Theorie und pr&#228;zisen Vergn&#252;gen -
Zur fr&#252;hen Computerkunst in Deutschland mit Ausblick aufs Jetzt.

Abstract

Die gro&#223;e und schwer beladene gesellschaftliche Unternehmung der Kunst hat in den letzten f&#252;nfzig Jahren einen besonderen Impuls aus der Elektronik und Informatik erfahren. Die K&#252;nste der digitalen Medien sind starker Ausdruck hiervon. Ohne algorithmische Verfahren (und somit ohne Computer) sind sie undenkbar. Das Internet als Medium der Medien aber kommt aus der Informationstechnik herauf und beeinflusst aufs Tiefste nicht nur seine Herkunft, sondern nachhaltig alle Aktivit&#228;ten der Individuen, Institutionen und Gesellschaften. 
Leitende Frage kann daher sein: Wie wirkt die technische Struktur Internet auf zwei disparate Felder wie die Kunst und die Informatik ein, gibt es Konvergenzen zwischen ihnen, und worin bestehen solche? 
F&#252;r den Vortrag soll solches Fragen den Hintergrund daf&#252;r abgeben, einen konkreten Fall etwas genauer zu betrachten &#8211; den Fall der Computerkunst in ihren Anf&#228;ngen und heute. Die Betrachtung soll wiederum in der Spannung zwischen Probabilismus (Wahrscheinlichkeitstheorie) und dem Vergn&#252;gen angestellt werden, das wir bei sinnlicher Wahrnehmung von &#196;sthetischem empfinden k&#246;nnen. Nach einem Titel bei Max Bense geht es bei Konkreter Kunst (zu der manches in der Computerkunst gerechnet werden kann) um eine Spielart von Vergn&#252;gen, die er die &#8222;pr&#228;zisen&#8220; genannt hat. 
In anderen Worten geht es um die damals diskutierte Kluft zwischen zwei &#8222;Kulturen&#8220;, der szientifischen und der literarischen. An sie soll erinnert werden. Insbesondere aber soll das Zusammentreffen von beiden als Algorithmik und &#196;sthetik in der Programmierung von Computern und Zeichenautomaten beleuchtet werden &#8211; ein notwendiges Zusammentreffen, wenn die Maschine des Berechnens, der Computer, dazu gebracht werden soll, zu zeichnen. Was n&#228;mlich muss dem Zeichnen daf&#252;r zugemutet werden? Und was dar&#252;ber hinaus, wenn nicht nur &#252;berhaupt gezeichnet werden soll, sondern wenn dies auch noch in gestalterischer, k&#252;nstlerischer Absicht geschieht. Hohe Anstrengung des formalen Denkens, hohes Vergn&#252;gen der sinnlichen Wahrnehmung sind die Pole einer Aktivit&#228;t, die das k&#252;nstlerische Meisterwerk der Vergangenheit &#252;berantwortet.
CV Frieder Nake, Universit&#228;t Bremen &amp; Hochschule f&#252;r K&#252;nste Bremen

Biografische Notiz

Prof. Dr. Frieder Nake, University of Bremen, Computer Science 
P.O.Box 330440, D-28334 Bremen, Germany, Tel. +49-421-218 3525              +49-421-218 3525       
<A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">nake at informatik.uni-bremen.de</A>, www.agis.informatik.uni-bremen.de
Vita

Geboren 16.12.1938 
1958-64           Studium der Mathematik in Stuttgart 
1965                 erste Ausstellung von Computerkunst, Stuttgart. Viele weitere in der Folge 
1966                 First Prize im Computer Art Contest von &#8222;Computers and Automation&#8221; 
1967                 Promotion zum Dr.rer.nat. in Wahrscheinlichkeitstheorie 
1968-69           Postdoctoral Fellow, University of Toronto 
1970-72           Assistant Professor Computer Science, University of B.C. in Vancouver 
Seit 1972         Professor an der Universit&#228;t Bremen, Grafische Datenverarbeitung und Interaktive Systeme 
1997                 Berninghausen-Preis f&#252;r ausgezeichnete Lehre und ihre Innovation 
Seit 2004         mit Lehrauftr&#228;gen an der Universit&#228;t Bremen und der Hochschule f&#252;r K&#252;nste, Bremen, in Digitale Medien und Computergrafik
Gastprofessor:

Universit&#228;t Wien 1988, Universitetet Oslo 1995, University of Colorado at Boulder 1997 und 1998, Aarhus Universitet 2000 , 2002, 2004, 2005, International School of New Media L&#252;beck 2003, 2005, 2006, Hochschule f&#252;r K&#252;nste Bremen 2005-06, Universit&#228;t Basel 2007, Donau-Universit&#228;t Krems 2009, 2010, Universidad de Costa Rica 2009
Aktuelle Arbeitsschwerpunkte

Gestaltung digitaler Medien, Interaktive Grafik, Computerkunst, Technische Semiotik, Theorie der Informatik, Computer in Lernumgebungen 
compArt | Kompetenzzentrum Digitale Kunst (gef&#246;rdert von der Rudolf Augstein Stiftung)
Buchpublikationen

F. Nake, A. Rosenfeld (eds.): Graphic Languages. Proc. of the IFIP Working Conference on Graphic Languages. Amsterdam: North-Holland Publ. Co., 1972
F. Nake: &#196;sthetik als Informationsverarbeitung. Grundlagen und Anwendungen der Informatik im Bereich &#228;sthetischer Produktion und Kritik. Wien, New York: Springer-Verlag, 1974 (engl. &#220;bersetzung in Vorbereitung)
F. Nake (ed.): Graphik in Dokumenten. Berlin, Heidelberg, New York: Springer-Verlag, 1986
W. Coy, F. Nake, et al. (eds.): Sichtweisen der Informatik. Braunschweig, Wiesbaden: Vieweg, 1992
F. Nake, D. Stoller (eds.): Algorithmus und Kunst. &#8221;Die pr&#228;zisen Vergn&#252;gen&#8221;. Hamburg: Sautter &amp; Lackmann, 1993
F. Nake (ed.): Die ertr&#228;gliche Leichtigkeit der Zeichen. &#196;sthetik, Semiotik, Informatik. Baden-Baden: Agis-Verlag 1993
P.B&#248;gh Andersen &amp; F. Nake: Computers and Signs. Prolegomena to a Semiotic Foundation of Computing Science. In preparation
Zahlreiche Zeitschriften- und Konferenzbeitr&#228;ge
Der Vortrag erfolgt im Rahmen der Tagung NMI 2010 (Neue Medien der Informationsgesellschaft), zu der Sie an diesem Tage auch herzlich in die Berlin-Brandenburgische Akademie der Wissenschaften eingeladen sind. Bitte aber anmelden unter www.nmi-berlin.de und unter Bemerkungen &quot;Ringvorlesung&quot; angeben, ankreuzen und  &quot;Auf Einladung des Veranstalters&quot;. Hat Ihnen der Vortrag gefallen? Dann bleiben Sie gerne noch zum Sommerempfang der Alcatel-Lucent Stiftung &quot;&#220;ber den D&#228;chern von Berlin&quot;  auf der Dachterrasse der Akademie.  Wir sorgen dort ab 20:00 auch f&#252;r einwandfreien Empfang des Fu&#223;ball WM Spiels Deutschland-Spanien :-) . 
Weitere Informationen zur Veranstaltungsreihe unter <A HREF="http://www.medienengineering.de/Ringvorlesungen/SS2010/ringevent_n_space.htm">http://www.medienengineering.de/Ringvorlesungen/SS2010/ringevent_n_space.htm</A> und zur Alcatel-Lucent Stiftung f&#252;r Kommunikationsforschung unter <A HREF="http://www.stiftungaktuell.de.">http://www.stiftungaktuell.de.</A>
Veranstaltungsort: Berlin-Brandenburgische Akademie der Wissenschaften, Markgrafenstra&#223;e 38, 10117 Berlin, Leibniz-Saal, anschlie&#223;end Dachterrasse und Wintergarten -siehe www.bbaw.de   
Klaus Rebensburg
 
Prof. Dr.-Ing. Klaus Rebensburg
Universit&#228;t Potsdam, Institut f&#252;r Informatik, Netzwerktechnologien und multimediale Teledienste (Medienengineering)
Haus 3.4.1.17, August-Bebel Stra&#223;e 89, 14482 Potsdam, www.medienengineering.de
Telefon mobil: 0177 8090214, <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-users">klaus.rebensburg at uni-potsdam.de</A>, www.klausrebensburg.de, XING, Skype: klaustech
 

-------------- next part --------------
An HTML attachment was scrubbed...
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/deepamehta-users/attachments/20100705/3beac785/attachment.html">https://lists.berlios.de/pipermail/deepamehta-users/attachments/20100705/3beac785/attachment.html</A>&gt;
-------------- next part --------------
A non-text attachment was scrubbed...
Name: image003.jpg
Type: image/jpeg
Size: 1987 bytes
Desc: not available
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/deepamehta-users/attachments/20100705/3beac785/attachment.jpg">https://lists.berlios.de/pipermail/deepamehta-users/attachments/20100705/3beac785/attachment.jpg</A>&gt;
-------------- next part --------------
A non-text attachment was scrubbed...
Name: image006.jpg
Type: image/jpeg
Size: 6324 bytes
Desc: not available
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/deepamehta-users/attachments/20100705/3beac785/attachment-0001.jpg">https://lists.berlios.de/pipermail/deepamehta-users/attachments/20100705/3beac785/attachment-0001.jpg</A>&gt;
-------------- next part --------------
A non-text attachment was scrubbed...
Name: image008.jpg
Type: image/jpeg
Size: 4920 bytes
Desc: not available
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/deepamehta-users/attachments/20100705/3beac785/attachment-0002.jpg">https://lists.berlios.de/pipermail/deepamehta-users/attachments/20100705/3beac785/attachment-0002.jpg</A>&gt;
</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	
	
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#326">[ date ]</a>
              <a href="thread.html#326">[ thread ]</a>
              <a href="subject.html#326">[ subject ]</a>
              <a href="author.html#326">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-users">More information about the deepamehta-users
mailing list</a><br>
</body></html>
